{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 511,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 512,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 513,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.90395709913864
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.591106674218624
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.241808134955125
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.241808134955125
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.365787015235348
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.702787811604161
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.33020759048787
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.591266733111176
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.761440056608437
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.8104260849975127
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.1773035178185083
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.911618269589713
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.771245129828728
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.597019178913062
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.3334710325146855
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.083477267208414
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.894443149475197
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.73702296493198
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.2381641272548443
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -5.118583277537418
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -5.146573089183114
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.716253100146861
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -12.288461631621859
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -11.720656928201192
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.46132131560771
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.90032634493267
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -11.92953864385032
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.531709833439836
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -13.174403266949609
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.966376996449517
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -14.719186667907849
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -16.436544164381225
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.15587646831358
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -13.303752126625069
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -17.02604923784414
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.417158584135366
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.7168418056646537
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.827021061639575
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -13.235937524951542
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -13.930728917903597
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.521399258686134
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.322763688295684
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -16.016785850221446
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -11.960278122526567
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -12.449727318980154
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -12.735172771367282
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -12.05377182734511
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.66430848228342
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -14.550161811161153
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -14.689686600487043
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.765661086908956
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -14.332828183763958
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.626725003100532
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -11.753491960431925
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.80629282675884
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.85637885710176
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -13.306407940965462
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -14.048541201659102
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -11.566082657735132
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.28606823687301
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.38825531133313
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -13.014392061827229
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -13.126876385510572
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -14.876679418875117
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.85637885710176
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.592392135218475
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -13.400362935829847
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -10.122641913198285
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -10.127711739962445
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.64507771305265
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -13.043835047130651
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -10.633157731346913
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.983694632884934
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -14.569317815821236
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.810395770421
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.976884157283921
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -12.48000180196388
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -12.47056343835468
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.904578624813723
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.410171146585128
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -9.160527124627954
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -13.76722185504845
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -13.771315767589055
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.612075907925615
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -12.10930503937878
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.571621215515023
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -16.290238987826655
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.840615610749552
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -13.65845219193606
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.106773926912544
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.814253376396707
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -12.792576680836925
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -12.022246654761704
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.351017054042664
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.287839056543756
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -14.067677122026815
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -10.819692096153206
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.051009681356913
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.726896737697864
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -11.89815964491178
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -13.102304759239201
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.059251095711412
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -13.041731433713517
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.43923076004433
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -12.360845196306832
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.3859681475302175
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -12.616855483726095
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -14.189828211243276
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -10.930494743947227
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.285337027042342
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -7.692314805999663
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -14.053931201442374
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -10.957420715693274
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -13.373864747082477
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -13.9614198711644
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -12.932478584182295
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -14.771259117673997
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -12.559202827884217
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -14.94853693882472
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -11.78562925592175
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -13.904114782708174
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.194908973891225
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -12.270786551323214
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -11.316404752259471
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -11.10184716376202
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -16.090462478574548
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -9.964477386715027
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -14.83511615910566
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -11.887057236129893
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -11.93468089428847
      },
      {
        "glyphs": [
          "["
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.52767832258972
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -19.35415340978307
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.06927541748109
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.4590425983374686
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8292810028616344
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.363428351506361
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.342421715923805
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -6.0278444467917325
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -11.839412971384352
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.989372339224792
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.75887816760272
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.828230343856649
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -7.0101989112971825
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -7.014346326176231
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.104502443868508
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.750011297600535
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.216818331845277
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.413079125665194
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.565500799063988
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.583235664823233
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.685335770400416
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.728889138346712
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.839974012042754
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.89053839550733
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.945081667273003
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.1066937806788
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.12308600221748
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.19278742290875
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.369629082907082
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.404059232921048
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.433570833172096
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.439237087406187
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.547689542524314
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.551968384730332
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.566212068649165
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.73392617779592
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.759809434847877
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.843459077360695
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.93986042563703
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.963172653917391
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.157601050249752
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.173707784844249
      },
      {
        "glyphs": [
          "H",
          "2",
          "+"
        ],
        "score": -10.222729873779516
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.264293107314616
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.321942080705567
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.366835777223688
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.385100486737297
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.417974852919498
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.422787231045543
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.425748893540668
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.453370523506228
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.522751125449776
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.544684936691224
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.673633339894346
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -10.808458890892076
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.81295607011292
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.81836029600615
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.878287747374973
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.900273147356742
      },
      {
        "glyphs": [
          "Pt",
          "+"
        ],
        "score": -10.950215700785837
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.068267698443433
      },
      {
        "glyphs": [
          "Si",
          "H",
          "2"
        ],
        "score": -11.085072647986818
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.100662298089386
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.136368966165096
      },
      {
        "glyphs": [
          "Zr",
          "+"
        ],
        "score": -11.228695519307239
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.247567937902181
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.335304500931631
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.34070563108822
      },
      {
        "glyphs": [
          "Si",
          "H",
          "3"
        ],
        "score": -11.36700649630736
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.417180236288699
      },
      {
        "glyphs": [
          "Mg",
          "+"
        ],
        "score": -11.44055572704213
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.454003642049335
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.545863297455883
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.546206267550472
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.570929316464294
      },
      {
        "glyphs": [
          "Ca",
          "+"
        ],
        "score": -11.623173383652539
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.629089850311898
      },
      {
        "glyphs": [
          "Fe",
          "+"
        ],
        "score": -11.656259181823067
      },
      {
        "glyphs": [
          "Zn",
          "+"
        ],
        "score": -11.72395320488099
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.729702478572491
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.734798853974812
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.735914294127676
      },
      {
        "glyphs": [
          "Cu",
          "+"
        ],
        "score": -11.742339828843143
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.750127249500727
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.763149086729031
      },
      {
        "glyphs": [
          "Ti",
          "+"
        ],
        "score": -11.808843026301933
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.809161485978194
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.815062884689283
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.832193381106832
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.833844138645945
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.839658715532652
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.853422399817399
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.930578046895167
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.97651909260542
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.054497840924018
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.070177112784855
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.079851380098047
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.087688569217407
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.092882251405161
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.10245938936164
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.107943874046892
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.126953910896235
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.135669621739488
      },
      {
        "glyphs": [
          "Pd",
          "+"
        ],
        "score": -12.161638497892673
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.167260239440786
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.171039251290667
      },
      {
        "glyphs": [
          "Ir",
          "+"
        ],
        "score": -12.179359701980838
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.197228659854806
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.215042142705354
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.215796950289995
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.245405404294564
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.24840542169437
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.280144522311558
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.291182624727346
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.291679149575511
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.321676784367074
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.339769231522334
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.344172952581369
      },
      {
        "glyphs": [
          "Ni",
          "+"
        ],
        "score": -12.345575578840233
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.3503909194037
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.35351707129259
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.356239795031879
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.35958559219983
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.379142226477608
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.380252590473159
      },
      {
        "glyphs": [
          "Ru",
          "+"
        ],
        "score": -12.40292284578551
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.419316032803549
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.442073277824909
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.46080937080266
      },
      {
        "glyphs": [
          "Al",
          "+"
        ],
        "score": -12.46205463676324
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.4633507166797
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.522291326970638
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.537588289421436
      },
      {
        "glyphs": [
          "Co",
          "+"
        ],
        "score": -12.5529299883009
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.553591431307163
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.576054533766223
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.630705587352292
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.681724178098404
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.714755952042127
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.72081330499466
      },
      {
        "glyphs": [
          "Al",
          "H",
          "3"
        ],
        "score": -12.734852855884604
      },
      {
        "glyphs": [
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.745474962521822
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.766961314798143
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.783126586746903
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.798356811578364
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "N"
        ],
        "score": -12.809990098896673
      },
      {
        "glyphs": [
          "Au",
          "+"
        ],
        "score": -12.81008028744288
      },
      {
        "glyphs": [
          "Ba",
          "+"
        ],
        "score": -12.810351596864484
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.836624808809576
      },
      {
        "glyphs": [
          "N",
          "=",
          "N",
          "N"
        ],
        "score": -12.844979870297017
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.845008773802705
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.84797599484174
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.856256162523444
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -12.875422657509658
      },
      {
        "glyphs": [
          "1",
          "8",
          "F"
        ],
        "score": -12.875426035113106
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N"
        ],
        "score": -12.876264052073944
      },
      {
        "glyphs": [
          "Sn",
          "+"
        ],
        "score": -12.88608898223373
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.924200766624546
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.929492184054169
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.930881982423307
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.933518572720851
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.963453395957252
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.979285041328607
      },
      {
        "glyphs": [
          "Mn",
          "+"
        ],
        "score": -12.987836889349651
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.988312232839474
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.989592524674954
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.996924683699644
      },
      {
        "glyphs": [
          "N",
          "=",
          "P"
        ],
        "score": -13.015100538727225
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.022583424700278
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -13.036467622026601
      },
      {
        "glyphs": [
          "P",
          "P"
        ],
        "score": -13.07105963788013
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.09573933796267
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -13.108840961456206
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.122822609773667
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -13.123469075149714
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.124048874967613
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -13.128717098613429
      },
      {
        "glyphs": [
          "W",
          "+"
        ],
        "score": -13.133542998912588
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.145151225947261
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.145365711223691
      },
      {
        "glyphs": [
          "I",
          "I"
        ],
        "score": -13.1615536842115
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.16218100367677
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.163956583190922
      },
      {
        "glyphs": [
          "Hf",
          "+"
        ],
        "score": -13.168787107410052
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -13.172316921633314
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "N"
        ],
        "score": -13.177110089097367
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
