{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2050,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2051,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2052,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2053,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2054,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2055,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        153,
        153
      ],
      [
        45,
        45
      ],
      [
        22,
        102
      ],
      [
        159,
        153
      ],
      [
        71,
        150
      ],
      [
        148,
        45
      ],
      [
        159,
        162
      ],
      [
        160,
        160
      ],
      [
        102,
        45
      ],
      [
        93,
        45
      ],
      [
        22,
        45
      ],
      [
        154,
        153
      ],
      [
        160,
        45
      ],
      [
        8,
        153
      ],
      [
        45,
        153
      ],
      [
        164,
        23
      ],
      [
        164,
        24
      ],
      [
        174,
        163
      ],
      [
        175,
        163
      ],
      [
        159,
        159
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        160,
        93
      ],
      [
        93,
        153
      ],
      [
        45,
        169
      ],
      [
        102,
        160
      ],
      [
        179,
        153
      ],
      [
        148,
        154
      ],
      [
        8,
        150
      ],
      [
        102,
        169
      ],
      [
        186,
        163
      ],
      [
        102,
        153
      ],
      [
        7,
        150
      ],
      [
        166,
        166
      ],
      [
        153,
        154
      ],
      [
        45,
        167
      ],
      [
        148,
        93
      ],
      [
        148,
        102
      ],
      [
        160,
        153
      ],
      [
        166,
        45
      ],
      [
        196,
        187
      ],
      [
        195,
        191
      ],
      [
        154,
        159
      ],
      [
        45,
        1
      ],
      [
        157,
        153
      ],
      [
        22,
        160
      ],
      [
        45,
        168
      ],
      [
        93,
        160
      ],
      [
        154,
        154
      ],
      [
        171,
        93
      ],
      [
        153,
        170
      ],
      [
        155,
        153
      ],
      [
        160,
        167
      ],
      [
        168,
        153
      ],
      [
        45,
        122
      ],
      [
        22,
        93
      ],
      [
        202,
        93
      ],
      [
        148,
        13
      ],
      [
        216,
        163
      ],
      [
        167,
        153
      ],
      [
        174,
        150
      ],
      [
        160,
        184
      ],
      [
        22,
        122
      ],
      [
        175,
        150
      ],
      [
        160,
        168
      ],
      [
        45,
        154
      ],
      [
        8,
        154
      ],
      [
        154,
        170
      ],
      [
        45,
        204
      ],
      [
        93,
        169
      ],
      [
        148,
        127
      ],
      [
        160,
        102
      ],
      [
        160,
        190
      ],
      [
        229,
        150
      ],
      [
        162,
        170
      ],
      [
        159,
        170
      ],
      [
        122,
        45
      ],
      [
        166,
        160
      ],
      [
        159,
        154
      ],
      [
        93,
        122
      ],
      [
        178,
        154
      ],
      [
        122,
        153
      ],
      [
        45,
        22
      ],
      [
        171,
        153
      ],
      [
        193,
        154
      ],
      [
        171,
        168
      ],
      [
        93,
        1
      ],
      [
        162,
        157
      ],
      [
        170,
        170
      ],
      [
        213,
        153
      ],
      [
        192,
        192
      ],
      [
        171,
        102
      ],
      [
        180,
        153
      ],
      [
        166,
        93
      ],
      [
        181,
        160
      ],
      [
        159,
        201
      ],
      [
        160,
        154
      ],
      [
        160,
        122
      ],
      [
        153,
        203
      ],
      [
        102,
        22
      ],
      [
        22,
        168
      ],
      [
        162,
        155
      ],
      [
        154,
        162
      ],
      [
        148,
        153
      ],
      [
        184,
        184
      ],
      [
        45,
        161
      ],
      [
        153,
        157
      ],
      [
        166,
        171
      ],
      [
        93,
        171
      ],
      [
        154,
        155
      ],
      [
        154,
        210
      ],
      [
        170,
        154
      ],
      [
        184,
        102
      ],
      [
        93,
        197
      ],
      [
        186,
        191
      ],
      [
        160,
        1
      ],
      [
        179,
        160
      ],
      [
        193,
        159
      ],
      [
        3,
        12
      ],
      [
        154,
        178
      ],
      [
        45,
        214
      ],
      [
        13,
        150
      ],
      [
        245,
        173
      ],
      [
        262,
        187
      ],
      [
        122,
        160
      ],
      [
        180,
        169
      ],
      [
        195,
        71
      ],
      [
        167,
        102
      ],
      [
        164,
        71
      ],
      [
        22,
        182
      ],
      [
        179,
        105
      ],
      [
        102,
        171
      ],
      [
        102,
        221
      ],
      [
        160,
        169
      ],
      [
        93,
        93
      ],
      [
        148,
        38
      ],
      [
        159,
        203
      ],
      [
        183,
        153
      ],
      [
        164,
        187
      ],
      [
        180,
        160
      ],
      [
        22,
        171
      ],
      [
        93,
        181
      ],
      [
        169,
        153
      ],
      [
        148,
        71
      ],
      [
        162,
        154
      ],
      [
        102,
        181
      ],
      [
        102,
        105
      ],
      [
        294,
        150
      ],
      [
        148,
        50
      ],
      [
        45,
        50
      ],
      [
        171,
        190
      ],
      [
        148,
        94
      ],
      [
        102,
        166
      ],
      [
        202,
        173
      ],
      [
        258,
        153
      ],
      [
        181,
        153
      ],
      [
        213,
        45
      ],
      [
        63,
        153
      ],
      [
        285,
        191
      ],
      [
        310,
        191
      ],
      [
        195,
        187
      ],
      [
        7,
        280
      ],
      [
        192,
        45
      ],
      [
        194,
        153
      ],
      [
        93,
        168
      ],
      [
        192,
        166
      ],
      [
        205,
        153
      ],
      [
        201,
        154
      ],
      [
        22,
        206
      ],
      [
        122,
        173
      ],
      [
        166,
        102
      ],
      [
        179,
        181
      ],
      [
        171,
        154
      ],
      [
        93,
        166
      ],
      [
        157,
        162
      ],
      [
        22,
        212
      ],
      [
        14,
        150
      ],
      [
        171,
        167
      ],
      [
        102,
        122
      ],
      [
        155,
        154
      ],
      [
        192,
        160
      ],
      [
        50,
        153
      ],
      [
        302,
        163
      ],
      [
        93,
        22
      ],
      [
        274,
        274
      ],
      [
        171,
        122
      ],
      [
        277,
        11
      ],
      [
        63,
        45
      ],
      [
        166,
        153
      ],
      [
        1,
        93
      ],
      [
        148,
        122
      ],
      [
        93,
        288
      ],
      [
        307,
        187
      ],
      [
        166,
        168
      ],
      [
        45,
        44
      ],
      [
        148,
        105
      ],
      [
        193,
        162
      ],
      [
        201,
        157
      ],
      [
        192,
        171
      ],
      [
        180,
        122
      ],
      [
        160,
        235
      ],
      [
        241,
        181
      ],
      [
        228,
        153
      ],
      [
        202,
        160
      ],
      [
        209,
        154
      ],
      [
        241,
        171
      ],
      [
        153,
        210
      ],
      [
        159,
        210
      ],
      [
        261,
        154
      ],
      [
        207,
        154
      ],
      [
        93,
        208
      ],
      [
        214,
        93
      ],
      [
        184,
        167
      ],
      [
        204,
        169
      ],
      [
        263,
        263
      ],
      [
        274,
        93
      ],
      [
        93,
        102
      ],
      [
        159,
        207
      ],
      [
        208,
        169
      ],
      [
        102,
        102
      ],
      [
        148,
        144
      ],
      [
        213,
        160
      ],
      [
        379,
        150
      ],
      [
        148,
        79
      ],
      [
        171,
        182
      ],
      [
        102,
        93
      ],
      [
        245,
        160
      ],
      [
        214,
        102
      ],
      [
        207,
        207
      ],
      [
        166,
        190
      ],
      [
        192,
        198
      ],
      [
        45,
        63
      ],
      [
        102,
        38
      ],
      [
        164,
        163
      ],
      [
        382,
        150
      ],
      [
        148,
        80
      ],
      [
        166,
        180
      ],
      [
        193,
        237
      ],
      [
        201,
        170
      ],
      [
        206,
        168
      ],
      [
        302,
        187
      ],
      [
        202,
        45
      ],
      [
        307,
        150
      ],
      [
        71,
        187
      ],
      [
        22,
        166
      ],
      [
        179,
        171
      ],
      [
        148,
        112
      ],
      [
        160,
        240
      ],
      [
        13,
        191
      ],
      [
        169,
        93
      ],
      [
        277,
        12
      ],
      [
        166,
        167
      ],
      [
        193,
        170
      ],
      [
        44,
        153
      ],
      [
        192,
        236
      ],
      [
        354,
        191
      ],
      [
        184,
        153
      ],
      [
        287,
        280
      ],
      [
        188,
        153
      ],
      [
        256,
        160
      ],
      [
        160,
        204
      ],
      [
        13,
        187
      ],
      [
        160,
        212
      ],
      [
        184,
        168
      ],
      [
        394,
        191
      ],
      [
        192,
        266
      ],
      [
        342,
        153
      ],
      [
        22,
        153
      ],
      [
        171,
        169
      ],
      [
        14,
        187
      ],
      [
        167,
        167
      ],
      [
        102,
        250
      ],
      [
        285,
        407
      ],
      [
        170,
        207
      ],
      [
        7,
        335
      ],
      [
        196,
        150
      ],
      [
        287,
        428
      ],
      [
        71,
        191
      ],
      [
        184,
        190
      ],
      [
        160,
        50
      ],
      [
        287,
        187
      ],
      [
        258,
        105
      ],
      [
        204,
        204
      ],
      [
        287,
        420
      ],
      [
        343,
        343
      ],
      [
        249,
        160
      ],
      [
        45,
        105
      ],
      [
        102,
        208
      ],
      [
        227,
        204
      ],
      [
        183,
        93
      ],
      [
        155,
        162
      ],
      [
        148,
        77
      ],
      [
        179,
        220
      ],
      [
        206,
        102
      ],
      [
        249,
        45
      ],
      [
        180,
        181
      ],
      [
        209,
        170
      ],
      [
        229,
        71
      ],
      [
        241,
        182
      ],
      [
        207,
        170
      ],
      [
        154,
        157
      ],
      [
        287,
        335
      ],
      [
        181,
        122
      ],
      [
        148,
        44
      ],
      [
        93,
        242
      ],
      [
        230,
        105
      ],
      [
        180,
        171
      ],
      [
        157,
        159
      ],
      [
        221,
        221
      ],
      [
        153,
        155
      ],
      [
        349,
        191
      ],
      [
        206,
        190
      ],
      [
        193,
        207
      ],
      [
        227,
        169
      ],
      [
        227,
        154
      ],
      [
        164,
        150
      ],
      [
        153,
        8
      ],
      [
        170,
        203
      ],
      [
        262,
        150
      ],
      [
        171,
        206
      ],
      [
        171,
        348
      ],
      [
        213,
        173
      ],
      [
        166,
        154
      ],
      [
        241,
        166
      ],
      [
        241,
        153
      ],
      [
        148,
        83
      ],
      [
        227,
        167
      ],
      [
        226,
        154
      ],
      [
        22,
        198
      ],
      [
        148,
        12
      ],
      [
        1,
        173
      ],
      [
        245,
        45
      ],
      [
        202,
        181
      ],
      [
        241,
        168
      ],
      [
        262,
        402
      ],
      [
        462,
        187
      ],
      [
        179,
        223
      ],
      [
        154,
        203
      ],
      [
        484,
        191
      ],
      [
        166,
        122
      ],
      [
        277,
        13
      ],
      [
        227,
        190
      ],
      [
        166,
        173
      ],
      [
        155,
        170
      ],
      [
        93,
        361
      ],
      [
        168,
        161
      ],
      [
        179,
        230
      ],
      [
        181,
        169
      ],
      [
        198,
        168
      ],
      [
        169,
        169
      ],
      [
        93,
        182
      ],
      [
        179,
        122
      ],
      [
        206,
        154
      ],
      [
        14,
        191
      ],
      [
        148,
        129
      ],
      [
        450,
        187
      ],
      [
        294,
        187
      ],
      [
        265,
        193
      ],
      [
        229,
        163
      ],
      [
        227,
        168
      ],
      [
        93,
        214
      ],
      [
        206,
        122
      ],
      [
        405,
        150
      ],
      [
        148,
        147
      ],
      [
        22,
        181
      ],
      [
        160,
        161
      ],
      [
        171,
        212
      ],
      [
        186,
        187
      ],
      [
        148,
        14
      ],
      [
        249,
        171
      ],
      [
        268,
        170
      ],
      [
        179,
        255
      ],
      [
        213,
        171
      ],
      [
        160,
        299
      ],
      [
        148,
        125
      ],
      [
        241,
        197
      ],
      [
        203,
        170
      ],
      [
        527,
        163
      ],
      [
        214,
        167
      ],
      [
        179,
        231
      ],
      [
        93,
        198
      ],
      [
        93,
        161
      ],
      [
        148,
        142
      ],
      [
        148,
        32
      ],
      [
        171,
        184
      ],
      [
        285,
        512
      ],
      [
        188,
        102
      ],
      [
        122,
        171
      ],
      [
        206,
        167
      ],
      [
        148,
        64
      ],
      [
        179,
        211
      ],
      [
        513,
        150
      ],
      [
        180,
        230
      ],
      [
        179,
        93
      ],
      [
        533,
        150
      ],
      [
        349,
        187
      ],
      [
        405,
        320
      ],
      [
        234,
        154
      ],
      [
        214,
        168
      ],
      [
        102,
        204
      ],
      [
        456,
        280
      ],
      [
        214,
        181
      ],
      [
        102,
        192
      ],
      [
        267,
        154
      ],
      [
        459,
        170
      ],
      [
        279,
        168
      ],
      [
        15,
        150
      ],
      [
        148,
        136
      ],
      [
        541,
        150
      ],
      [
        166,
        181
      ],
      [
        148,
        146
      ],
      [
        102,
        198
      ],
      [
        102,
        236
      ],
      [
        249,
        198
      ],
      [
        249,
        166
      ],
      [
        211,
        153
      ],
      [
        24,
        150
      ],
      [
        23,
        150
      ],
      [
        166,
        197
      ],
      [
        277,
        14
      ],
      [
        167,
        161
      ],
      [
        45,
        77
      ],
      [
        186,
        436
      ],
      [
        180,
        197
      ],
      [
        93,
        204
      ],
      [
        148,
        56
      ],
      [
        102,
        167
      ],
      [
        166,
        185
      ],
      [
        8,
        280
      ],
      [
        148,
        141
      ],
      [
        7,
        565
      ],
      [
        196,
        402
      ],
      [
        228,
        161
      ],
      [
        274,
        173
      ],
      [
        488,
        14
      ],
      [
        214,
        171
      ],
      [
        184,
        154
      ],
      [
        122,
        122
      ],
      [
        188,
        161
      ],
      [
        214,
        122
      ],
      [
        93,
        228
      ],
      [
        202,
        171
      ],
      [
        179,
        208
      ],
      [
        209,
        157
      ],
      [
        274,
        160
      ],
      [
        373,
        373
      ],
      [
        159,
        338
      ],
      [
        154,
        201
      ],
      [
        588,
        150
      ],
      [
        206,
        263
      ],
      [
        170,
        201
      ],
      [
        160,
        44
      ],
      [
        202,
        230
      ],
      [
        214,
        197
      ],
      [
        300,
        153
      ],
      [
        443,
        443
      ],
      [
        196,
        587
      ],
      [
        456,
        335
      ],
      [
        196,
        191
      ],
      [
        148,
        89
      ],
      [
        467,
        467
      ],
      [
        184,
        169
      ],
      [
        93,
        105
      ],
      [
        166,
        231
      ],
      [
        171,
        240
      ],
      [
        148,
        108
      ],
      [
        102,
        242
      ],
      [
        93,
        244
      ],
      [
        618,
        320
      ],
      [
        122,
        181
      ],
      [
        162,
        207
      ],
      [
        93,
        167
      ],
      [
        403,
        169
      ],
      [
        159,
        8
      ],
      [
        292,
        153
      ],
      [
        93,
        259
      ],
      [
        148,
        63
      ],
      [
        148,
        70
      ],
      [
        93,
        236
      ],
      [
        179,
        244
      ],
      [
        354,
        436
      ],
      [
        148,
        46
      ],
      [
        148,
        53
      ],
      [
        204,
        299
      ],
      [
        148,
        99
      ],
      [
        179,
        166
      ],
      [
        267,
        167
      ],
      [
        213,
        181
      ],
      [
        220,
        263
      ],
      [
        202,
        231
      ],
      [
        50,
        45
      ],
      [
        45,
        221
      ],
      [
        184,
        122
      ],
      [
        202,
        223
      ],
      [
        265,
        159
      ],
      [
        160,
        105
      ],
      [
        166,
        179
      ],
      [
        122,
        169
      ],
      [
        22,
        197
      ],
      [
        593,
        45
      ],
      [
        93,
        252
      ],
      [
        166,
        194
      ],
      [
        230,
        181
      ],
      [
        285,
        187
      ],
      [
        166,
        182
      ],
      [
        249,
        236
      ],
      [
        349,
        576
      ],
      [
        180,
        22
      ],
      [
        168,
        169
      ],
      [
        349,
        575
      ],
      [
        640,
        320
      ],
      [
        277,
        15
      ],
      [
        3,
        13
      ],
      [
        636,
        150
      ],
      [
        290,
        190
      ],
      [
        93,
        154
      ],
      [
        201,
        155
      ],
      [
        93,
        250
      ],
      [
        194,
        190
      ],
      [
        102,
        244
      ],
      [
        171,
        50
      ],
      [
        167,
        169
      ],
      [
        157,
        237
      ],
      [
        178,
        8
      ],
      [
        148,
        121
      ],
      [
        192,
        153
      ],
      [
        522,
        320
      ],
      [
        160,
        63
      ],
      [
        183,
        122
      ],
      [
        166,
        223
      ],
      [
        71,
        280
      ],
      [
        171,
        235
      ],
      [
        102,
        228
      ],
      [
        208,
        122
      ],
      [
        310,
        150
      ],
      [
        122,
        378
      ],
      [
        548,
        150
      ],
      [
        228,
        93
      ],
      [
        226,
        157
      ],
      [
        207,
        203
      ],
      [
        542,
        150
      ],
      [
        122,
        93
      ],
      [
        279,
        93
      ],
      [
        249,
        266
      ],
      [
        206,
        489
      ],
      [
        167,
        93
      ],
      [
        566,
        150
      ],
      [
        157,
        170
      ],
      [
        213,
        235
      ],
      [
        249,
        192
      ],
      [
        166,
        208
      ],
      [
        271,
        171
      ],
      [
        245,
        171
      ],
      [
        214,
        208
      ],
      [
        171,
        161
      ],
      [
        290,
        167
      ],
      [
        45,
        38
      ],
      [
        209,
        155
      ],
      [
        71,
        335
      ],
      [
        227,
        102
      ],
      [
        148,
        158
      ],
      [
        179,
        197
      ],
      [
        569,
        320
      ],
      [
        202,
        166
      ],
      [
        102,
        324
      ],
      [
        719,
        150
      ],
      [
        170,
        210
      ],
      [
        394,
        150
      ],
      [
        508,
        508
      ],
      [
        267,
        184
      ],
      [
        245,
        197
      ],
      [
        230,
        171
      ],
      [
        155,
        159
      ],
      [
        159,
        226
      ],
      [
        192,
        190
      ],
      [
        148,
        115
      ],
      [
        569,
        150
      ],
      [
        168,
        93
      ],
      [
        193,
        210
      ],
      [
        93,
        221
      ],
      [
        166,
        211
      ],
      [
        279,
        154
      ],
      [
        192,
        93
      ],
      [
        122,
        256
      ],
      [
        206,
        184
      ],
      [
        148,
        35
      ],
      [
        180,
        166
      ],
      [
        522,
        150
      ],
      [
        641,
        150
      ],
      [
        50,
        308
      ],
      [
        198,
        154
      ],
      [
        157,
        154
      ],
      [
        179,
        228
      ],
      [
        148,
        140
      ],
      [
        271,
        181
      ],
      [
        1,
        160
      ],
      [
        214,
        166
      ],
      [
        230,
        122
      ],
      [
        155,
        209
      ],
      [
        249,
        321
      ],
      [
        179,
        168
      ],
      [
        181,
        181
      ],
      [
        274,
        45
      ],
      [
        299,
        299
      ],
      [
        277,
        16
      ],
      [
        148,
        90
      ],
      [
        192,
        167
      ],
      [
        188,
        93
      ],
      [
        202,
        250
      ],
      [
        267,
        190
      ],
      [
        624,
        150
      ],
      [
        299,
        169
      ],
      [
        548,
        320
      ],
      [
        290,
        348
      ],
      [
        15,
        191
      ],
      [
        183,
        167
      ],
      [
        285,
        773
      ],
      [
        237,
        155
      ],
      [
        584,
        150
      ],
      [
        148,
        54
      ],
      [
        184,
        348
      ],
      [
        206,
        240
      ],
      [
        307,
        433
      ],
      [
        213,
        180
      ],
      [
        180,
        208
      ],
      [
        122,
        223
      ],
      [
        179,
        314
      ],
      [
        168,
        348
      ],
      [
        266,
        190
      ],
      [
        166,
        242
      ],
      [
        584,
        320
      ],
      [
        643,
        150
      ],
      [
        635,
        187
      ],
      [
        166,
        230
      ],
      [
        279,
        182
      ],
      [
        102,
        168
      ],
      [
        230,
        244
      ],
      [
        451,
        168
      ],
      [
        1,
        45
      ],
      [
        169,
        168
      ],
      [
        102,
        252
      ],
      [
        238,
        153
      ],
      [
        304,
        153
      ],
      [
        169,
        161
      ],
      [
        180,
        93
      ],
      [
        744,
        150
      ],
      [
        77,
        153
      ],
      [
        302,
        191
      ],
      [
        157,
        226
      ],
      [
        22,
        105
      ],
      [
        214,
        182
      ],
      [
        382,
        433
      ],
      [
        170,
        8
      ],
      [
        275,
        212
      ],
      [
        170,
        338
      ],
      [
        206,
        328
      ],
      [
        194,
        161
      ],
      [
        327,
        122
      ],
      [
        122,
        426
      ],
      [
        183,
        169
      ],
      [
        263,
        167
      ],
      [
        102,
        154
      ],
      [
        619,
        619
      ],
      [
        354,
        575
      ],
      [
        450,
        150
      ],
      [
        63,
        63
      ],
      [
        220,
        190
      ],
      [
        166,
        169
      ],
      [
        220,
        102
      ],
      [
        290,
        154
      ],
      [
        195,
        150
      ],
      [
        196,
        71
      ],
      [
        354,
        576
      ],
      [
        167,
        190
      ],
      [
        624,
        320
      ],
      [
        148,
        91
      ],
      [
        267,
        122
      ],
      [
        228,
        221
      ],
      [
        122,
        166
      ],
      [
        220,
        167
      ],
      [
        752,
        150
      ],
      [
        635,
        150
      ],
      [
        300,
        122
      ],
      [
        180,
        168
      ],
      [
        148,
        37
      ],
      [
        122,
        235
      ],
      [
        206,
        271
      ],
      [
        148,
        31
      ],
      [
        179,
        309
      ],
      [
        214,
        228
      ],
      [
        122,
        344
      ],
      [
        265,
        207
      ],
      [
        206,
        235
      ],
      [
        194,
        167
      ],
      [
        259,
        169
      ],
      [
        311,
        167
      ],
      [
        211,
        154
      ],
      [
        241,
        198
      ],
      [
        256,
        173
      ],
      [
        202,
        255
      ],
      [
        263,
        102
      ],
      [
        196,
        436
      ],
      [
        180,
        211
      ],
      [
        194,
        102
      ],
      [
        277,
        17
      ],
      [
        290,
        122
      ],
      [
        102,
        266
      ],
      [
        105,
        153
      ],
      [
        50,
        173
      ],
      [
        179,
        253
      ],
      [
        171,
        63
      ],
      [
        160,
        372
      ],
      [
        22,
        253
      ],
      [
        171,
        44
      ],
      [
        171,
        204
      ],
      [
        220,
        168
      ],
      [
        734,
        150
      ],
      [
        93,
        218
      ],
      [
        169,
        167
      ],
      [
        181,
        171
      ],
      [
        148,
        73
      ],
      [
        179,
        331
      ],
      [
        166,
        184
      ],
      [
        354,
        187
      ],
      [
        226,
        155
      ],
      [
        249,
        339
      ],
      [
        683,
        150
      ],
      [
        169,
        122
      ],
      [
        694,
        102
      ],
      [
        192,
        173
      ],
      [
        311,
        231
      ],
      [
        324,
        153
      ],
      [
        148,
        123
      ],
      [
        566,
        589
      ],
      [
        373,
        263
      ],
      [
        155,
        201
      ],
      [
        180,
        223
      ],
      [
        614,
        614
      ],
      [
        202,
        211
      ],
      [
        462,
        150
      ],
      [
        102,
        339
      ],
      [
        643,
        320
      ],
      [
        778,
        150
      ],
      [
        93,
        192
      ],
      [
        102,
        249
      ],
      [
        241,
        206
      ],
      [
        311,
        102
      ],
      [
        169,
        102
      ],
      [
        332,
        153
      ],
      [
        166,
        240
      ],
      [
        22,
        208
      ],
      [
        93,
        184
      ],
      [
        834,
        150
      ],
      [
        241,
        314
      ],
      [
        284,
        153
      ],
      [
        169,
        235
      ],
      [
        311,
        190
      ],
      [
        171,
        263
      ],
      [
        764,
        150
      ],
      [
        162,
        8
      ],
      [
        171,
        283
      ],
      [
        522,
        589
      ],
      [
        169,
        228
      ],
      [
        245,
        208
      ],
      [
        154,
        8
      ],
      [
        166,
        251
      ],
      [
        122,
        240
      ],
      [
        184,
        50
      ],
      [
        166,
        228
      ],
      [
        593,
        153
      ],
      [
        183,
        168
      ],
      [
        71,
        163
      ],
      [
        184,
        63
      ],
      [
        44,
        45
      ],
      [
        148,
        134
      ],
      [
        93,
        370
      ],
      [
        378,
        378
      ],
      [
        236,
        154
      ],
      [
        311,
        211
      ],
      [
        171,
        218
      ],
      [
        167,
        154
      ],
      [
        205,
        161
      ],
      [
        102,
        63
      ],
      [
        192,
        241
      ],
      [
        468,
        193
      ],
      [
        148,
        107
      ],
      [
        164,
        191
      ],
      [
        249,
        357
      ],
      [
        206,
        348
      ],
      [
        220,
        154
      ],
      [
        192,
        197
      ],
      [
        169,
        182
      ],
      [
        3,
        14
      ],
      [
        214,
        105
      ],
      [
        192,
        194
      ],
      [
        488,
        19
      ],
      [
        267,
        182
      ],
      [
        183,
        228
      ],
      [
        198,
        122
      ],
      [
        256,
        171
      ],
      [
        194,
        93
      ],
      [
        22,
        236
      ],
      [
        167,
        184
      ],
      [
        181,
        197
      ],
      [
        324,
        167
      ],
      [
        542,
        433
      ],
      [
        192,
        231
      ],
      [
        213,
        256
      ],
      [
        148,
        157
      ],
      [
        372,
        93
      ],
      [
        148,
        39
      ],
      [
        148,
        42
      ],
      [
        148,
        119
      ],
      [
        967,
        191
      ],
      [
        324,
        190
      ],
      [
        277,
        18
      ],
      [
        204,
        184
      ],
      [
        250,
        105
      ],
      [
        285,
        420
      ],
      [
        270,
        157
      ],
      [
        105,
        45
      ],
      [
        160,
        214
      ],
      [
        93,
        266
      ],
      [
        250,
        171
      ],
      [
        658,
        689
      ],
      [
        122,
        230
      ],
      [
        192,
        252
      ],
      [
        450,
        191
      ],
      [
        214,
        184
      ],
      [
        933,
        150
      ],
      [
        30,
        150
      ],
      [
        168,
        168
      ],
      [
        148,
        989
      ],
      [
        249,
        324
      ],
      [
        230,
        93
      ],
      [
        263,
        371
      ],
      [
        184,
        240
      ],
      [
        266,
        167
      ],
      [
        727,
        727
      ],
      [
        542,
        717
      ],
      [
        122,
        197
      ],
      [
        179,
        38
      ],
      [
        179,
        256
      ],
      [
        148,
        55
      ],
      [
        214,
        218
      ],
      [
        311,
        185
      ],
      [
        332,
        168
      ],
      [
        327,
        102
      ],
      [
        256,
        122
      ],
      [
        179,
        102
      ],
      [
        311,
        153
      ],
      [
        247,
        154
      ],
      [
        241,
        105
      ],
      [
        63,
        150
      ],
      [
        171,
        1
      ],
      [
        349,
        150
      ],
      [
        227,
        408
      ],
      [
        192,
        181
      ],
      [
        166,
        244
      ],
      [
        93,
        238
      ],
      [
        166,
        50
      ],
      [
        220,
        184
      ],
      [
        332,
        223
      ],
      [
        1002,
        191
      ],
      [
        160,
        22
      ],
      [
        206,
        169
      ],
      [
        202,
        198
      ],
      [
        192,
        211
      ],
      [
        969,
        320
      ],
      [
        93,
        299
      ],
      [
        166,
        238
      ],
      [
        954,
        1012
      ],
      [
        227,
        122
      ],
      [
        148,
        74
      ],
      [
        658,
        150
      ],
      [
        167,
        105
      ],
      [
        180,
        204
      ],
      [
        105,
        105
      ],
      [
        230,
        166
      ],
      [
        213,
        223
      ],
      [
        263,
        271
      ],
      [
        122,
        183
      ],
      [
        188,
        182
      ],
      [
        734,
        191
      ],
      [
        830,
        512
      ],
      [
        604,
        604
      ],
      [
        192,
        168
      ],
      [
        171,
        105
      ],
      [
        183,
        102
      ],
      [
        274,
        171
      ],
      [
        102,
        413
      ],
      [
        891,
        150
      ],
      [
        214,
        242
      ],
      [
        279,
        102
      ],
      [
        249,
        249
      ],
      [
        167,
        63
      ],
      [
        148,
        78
      ],
      [
        184,
        235
      ],
      [
        243,
        157
      ],
      [
        34,
        150
      ],
      [
        148,
        1058
      ],
      [
        93,
        235
      ],
      [
        216,
        930
      ],
      [
        230,
        208
      ],
      [
        180,
        231
      ],
      [
        153,
        1
      ],
      [
        641,
        320
      ],
      [
        332,
        154
      ],
      [
        183,
        154
      ],
      [
        204,
        168
      ],
      [
        584,
        191
      ],
      [
        241,
        236
      ],
      [
        122,
        168
      ],
      [
        207,
        162
      ],
      [
        102,
        77
      ],
      [
        488,
        16
      ],
      [
        102,
        357
      ],
      [
        148,
        132
      ],
      [
        166,
        348
      ],
      [
        227,
        240
      ],
      [
        277,
        19
      ],
      [
        846,
        150
      ],
      [
        378,
        102
      ],
      [
        213,
        283
      ],
      [
        204,
        301
      ],
      [
        102,
        321
      ],
      [
        263,
        190
      ],
      [
        245,
        181
      ],
      [
        148,
        155
      ],
      [
        263,
        168
      ],
      [
        249,
        211
      ],
      [
        332,
        180
      ],
      [
        227,
        184
      ],
      [
        245,
        180
      ],
      [
        1087,
        191
      ],
      [
        122,
        231
      ],
      [
        241,
        242
      ],
      [
        102,
        50
      ],
      [
        148,
        68
      ],
      [
        93,
        206
      ],
      [
        342,
        105
      ],
      [
        160,
        77
      ],
      [
        122,
        182
      ],
      [
        846,
        191
      ],
      [
        327,
        168
      ],
      [
        192,
        180
      ],
      [
        271,
        105
      ],
      [
        879,
        150
      ],
      [
        179,
        383
      ],
      [
        284,
        161
      ],
      [
        220,
        304
      ],
      [
        122,
        208
      ],
      [
        249,
        389
      ],
      [
        279,
        228
      ],
      [
        22,
        321
      ],
      [
        830,
        407
      ],
      [
        77,
        77
      ],
      [
        180,
        242
      ],
      [
        192,
        102
      ],
      [
        184,
        218
      ],
      [
        1076,
        150
      ],
      [
        148,
        82
      ],
      [
        184,
        44
      ],
      [
        608,
        168
      ],
      [
        204,
        167
      ],
      [
        184,
        489
      ],
      [
        50,
        160
      ],
      [
        204,
        102
      ],
      [
        117,
        150
      ],
      [
        971,
        150
      ],
      [
        148,
        1127
      ],
      [
        843,
        191
      ],
      [
        44,
        173
      ],
      [
        193,
        203
      ],
      [
        332,
        181
      ],
      [
        441,
        204
      ],
      [
        241,
        208
      ],
      [
        213,
        93
      ],
      [
        93,
        329
      ],
      [
        241,
        266
      ],
      [
        166,
        105
      ],
      [
        180,
        244
      ],
      [
        286,
        105
      ],
      [
        192,
        184
      ],
      [
        166,
        44
      ],
      [
        468,
        170
      ],
      [
        241,
        212
      ],
      [
        213,
        230
      ],
      [
        268,
        159
      ],
      [
        330,
        122
      ],
      [
        259,
        348
      ],
      [
        548,
        433
      ],
      [
        148,
        104
      ],
      [
        944,
        150
      ],
      [
        683,
        320
      ],
      [
        116,
        150
      ],
      [
        122,
        215
      ],
      [
        148,
        1154
      ],
      [
        166,
        204
      ],
      [
        211,
        161
      ],
      [
        102,
        444
      ],
      [
        193,
        750
      ],
      [
        267,
        348
      ],
      [
        184,
        1
      ],
      [
        179,
        242
      ],
      [
        541,
        320
      ],
      [
        241,
        336
      ],
      [
        220,
        422
      ],
      [
        1032,
        150
      ],
      [
        566,
        320
      ],
      [
        208,
        171
      ],
      [
        166,
        206
      ],
      [
        258,
        182
      ],
      [
        220,
        373
      ],
      [
        22,
        242
      ],
      [
        167,
        348
      ],
      [
        188,
        288
      ],
      [
        293,
        93
      ],
      [
        277,
        20
      ],
      [
        166,
        235
      ],
      [
        167,
        168
      ],
      [
        364,
        169
      ],
      [
        241,
        252
      ],
      [
        3,
        15
      ],
      [
        311,
        154
      ],
      [
        168,
        102
      ],
      [
        179,
        167
      ],
      [
        283,
        235
      ],
      [
        843,
        150
      ],
      [
        821,
        821
      ],
      [
        942,
        321
      ],
      [
        192,
        336
      ],
      [
        311,
        181
      ],
      [
        267,
        263
      ],
      [
        204,
        190
      ],
      [
        324,
        211
      ],
      [
        928,
        163
      ],
      [
        93,
        50
      ],
      [
        170,
        268
      ],
      [
        258,
        171
      ],
      [
        167,
        50
      ],
      [
        220,
        271
      ],
      [
        180,
        255
      ],
      [
        451,
        167
      ],
      [
        249,
        181
      ],
      [
        290,
        182
      ],
      [
        180,
        256
      ],
      [
        183,
        235
      ],
      [
        214,
        198
      ],
      [
        647,
        422
      ],
      [
        213,
        122
      ],
      [
        213,
        166
      ],
      [
        274,
        231
      ],
      [
        230,
        168
      ],
      [
        227,
        372
      ],
      [
        304,
        122
      ],
      [
        324,
        168
      ],
      [
        179,
        198
      ],
      [
        148,
        47
      ],
      [
        274,
        255
      ],
      [
        488,
        15
      ],
      [
        166,
        161
      ],
      [
        148,
        69
      ],
      [
        259,
        93
      ],
      [
        928,
        150
      ],
      [
        196,
        163
      ],
      [
        505,
        166
      ],
      [
        169,
        22
      ],
      [
        192,
        185
      ],
      [
        332,
        179
      ],
      [
        1074,
        93
      ],
      [
        245,
        231
      ],
      [
        166,
        305
      ],
      [
        249,
        167
      ],
      [
