{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 511,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 512,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 513,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.872470830736637
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.556036782687142
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2067382434236436
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2067382434236436
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.31908351825159
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.314752796986713
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.818149934174489
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.295137698956388
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.556196841579695
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.724089064084632
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.7754590527055356
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.161640876641748
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8795896046061316
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.736171638018156
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.5623132232544705
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.298401140983204
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.048407375676932
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.861166085988309
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.701953073523669
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.2035445622633247
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -11.3699810405614
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -11.39755600551839
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.68118320861538
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -18.54758258281483
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -19.316355017504556
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.426251424076227
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.865256453401189
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -18.650214260351323
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.496639941908354
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -18.827093270786555
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.935956218851219
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -18.597581307469707
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -16.403190777593498
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.120806576782098
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -18.499963287826425
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -16.99097934631266
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.382088692603885
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.75727205843803
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -19.316354515740958
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -18.827093253806357
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.82709293137013
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.486329367154653
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.289050116120489
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -15.981715958689962
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -18.329363999145784
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -19.04211199303824
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.82709337928535
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -16.16317838698214
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.62923859075194
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.70576874359265
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.965187585627884
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.730591195377478
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.650213385182223
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.591677483512758
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -18.32936401569124
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.771222935227359
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.821308965570278
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -16.659132172210004
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -18.547581983286126
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -18.96518865429508
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.474523015926465
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.353185419801648
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -19.125445347612114
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -17.97076269368539
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -14.841609527343632
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.821308965570278
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.564718748024372
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -16.637228330073317
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.70576992447591
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -18.965188945356573
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.61000782152117
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.764593254099353
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -18.183668402383077
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.948624741353452
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -17.096460905190323
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.775325878889518
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -19.55246628482292
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -19.31635494024512
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -18.650214196500286
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.86950873328224
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.3768834083383474
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -19.31635508579797
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -19.125445196913656
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -18.965188415680817
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.577006016394137
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -19.125445499137456
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.536551323983542
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -16.255169096295173
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.828554147247452
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.705769452509006
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.162134501718858
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.77918348486522
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -18.05652376384075
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.54758260947946
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.315947162511183
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.252769165012275
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.764592782173445
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -18.499963603283877
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.01593978982543
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.691826846166382
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -18.89376022230058
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -17.707358021795212
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.02418120417993
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -18.454508802991988
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.40416086851285
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -18.49996349931395
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.362450986185017
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -18.59758171515401
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -19.42746568623864
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -18.290902506807864
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.25026713551086
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -18.454509064485194
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -18.329363362297002
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -18.705770132248386
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -18.253865123602125
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.764593013025863
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.764593281799236
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -14.736189251853228
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -18.118076850401362
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -14.913467047293238
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -19.31635501476965
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.65021385171561
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.159839082359744
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -19.316354968395082
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -19.216354825371372
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -16.055392587043066
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.60727817147112
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -19.12544475137036
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -18.369364019905365
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.086826916586944
      },
      {
        "glyphs": [
          "["
        ],
        "score": -5.9049296407583025
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.492608431058239
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -3.8965075697700406
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.03420552594961
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.6631995290577564
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.897023395597646
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.329404343004452
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.212087763404032
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.994407113496154
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -20.311997657422122
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -4.586271972830161
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -5.086282335524203
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -5.114312620189427
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.903669926491483
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.25038262926263
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -6.6530261529429175
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.714076308833356
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.78826756715301
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -6.94340369373206
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -6.948954723288095
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.047497569727069
      },
      {
        "glyphs": [
          "[",
          "2",
          "H"
        ],
        "score": -7.18137720400321
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.689017505703783
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -7.692636086921629
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.179375843030424
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.385220278833076
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.519579925491708
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.55231863522044
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.636979433372698
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.678927499779771
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.801315403516021
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.858197928154084
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.867635645036966
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.065298013707228
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.074126871684287
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.125496694815963
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.139849304316748
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.320777340710292
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.340005526104239
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.361816352826228
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.384318710476622
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.473901843549884
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.502387531720345
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.535994191485885
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "2"
        ],
        "score": -9.577696971794948
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.678396541760048
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.680875115130354
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "3"
        ],
        "score": -9.692321612922257
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.71105095701892
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.795334146270188
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.859248753086977
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.923508717120404
      },
      {
        "glyphs": [
          "[",
          "Y"
        ],
        "score": -9.929874954160338
      },
      {
        "glyphs": [
          "[",
          "Ir"
        ],
        "score": -10.087668097688592
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -10.092787188925744
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.097447576184209
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.131492350381063
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.164957965696056
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -10.165759510095013
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.205751521089205
      },
      {
        "glyphs": [
          "[",
          "N",
          "H",
          "2"
        ],
        "score": -10.221737410147908
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.266537970367123
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.325951952436181
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -10.332796130811873
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.354710703360679
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.386822576074897
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.389170068177723
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.433158563742733
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.477022844284592
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -10.538527810245018
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.5441512216017
      },
      {
        "glyphs": [
          "[",
          "Li"
        ],
        "score": -10.598604250455434
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.626475493104545
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.733347944148978
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.734783947124187
      },
      {
        "glyphs": [
          "[",
          "Pt"
        ],
        "score": -10.784906240384235
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.824195823785267
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.839019197322875
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.86224897741648
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -10.877351215570819
      },
      {
        "glyphs": [
          "[",
          "Se"
        ],
        "score": -10.896050588322103
      },
      {
        "glyphs": [
          "[",
          "Pt",
          "+"
        ],
        "score": -10.915342082078906
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C"
        ],
        "score": -10.929943753501709
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H"
        ],
        "score": -10.947405655091801
      },
      {
        "glyphs": [
          "[",
          "S",
          "-"
        ],
        "score": -10.955493246125082
      },
      {
        "glyphs": [
          "[",
          "Sn"
        ],
        "score": -10.977549946213324
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.06055122112101
      },
      {
        "glyphs": [
          "[",
          "W"
        ],
        "score": -11.066990120506365
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "2"
        ],
        "score": -11.094513643789353
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.097207977867258
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.100034389907648
      },
      {
        "glyphs": [
          "[",
          "Zr",
          "+"
        ],
        "score": -11.194011451515669
      },
      {
        "glyphs": [
          "[",
          "V"
        ],
        "score": -11.281381201352238
      },
      {
        "glyphs": [
          "[",
          "P",
          "H"
        ],
        "score": -11.282876271976868
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.295793226087216
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.323239295801168
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -11.360146245626629
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "3"
        ],
        "score": -11.360795990300188
      },
      {
        "glyphs": [
          "[",
          "Mg",
          "+"
        ],
        "score": -11.405530967841631
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.424346830865225
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.427405687287106
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.457966041864708
      },
      {
        "glyphs": [
          "[",
          "Ge"
        ],
        "score": -11.47065316952515
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.488792418784367
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.498358895492709
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.54390724450449
      },
      {
        "glyphs": [
          "[",
          "Ca",
          "+"
        ],
        "score": -11.588251443464506
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -11.621890918306649
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.632641385966322
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.638508395552796
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.647728212703516
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.666487182967876
      },
      {
        "glyphs": [
          "[",
          "Al"
        ],
        "score": -11.688505230583285
      },
      {
        "glyphs": [
          "[",
          "Zn",
          "+"
        ],
        "score": -11.689315971232919
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.701154239198637
      },
      {
        "glyphs": [
          "[",
          "Cu",
          "+"
        ],
        "score": -11.711703753668674
      },
      {
        "glyphs": [
          "[",
          "Fe"
        ],
        "score": -11.719021031750493
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.729306031223707
      },
      {
        "glyphs": [
          "[",
          "Ti"
        ],
        "score": -11.751015065491494
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.763859474270353
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.76972377164077
      },
      {
        "glyphs": [
          "[",
          "Ti",
          "+"
        ],
        "score": -11.77386443369996
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.785410105467324
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.78695744018715
      },
      {
        "glyphs": [
          "[",
          "se"
        ],
        "score": -11.804343079877858
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.835280813904436
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.84683666017541
      },
      {
        "glyphs": [
          "[",
          "Zn"
        ],
        "score": -11.85298615393528
      },
      {
        "glyphs": [
          "[",
          "Rb"
        ],
        "score": -11.864004741677274
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.895455999966009
      },
      {
        "glyphs": [
          "[",
          "As"
        ],
        "score": -11.89566487263616
      },
      {
        "glyphs": [
          "[",
          "Zr"
        ],
        "score": -11.9009173858011
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -11.922786585756795
      },
      {
        "glyphs": [
          "[",
          "Co"
        ],
        "score": -11.926030445174757
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.937433027183488
      },
      {
        "glyphs": [
          "[",
          "Cl",
          "+"
        ],
        "score": -11.943207310141288
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -11.984014519183225
      },
      {
        "glyphs": [
          "[",
          "Pd"
        ],
        "score": -11.988470659556834
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.9988998946778
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.014822049716233
      },
      {
        "glyphs": [
          "[",
          "Cu"
        ],
        "score": -12.028597542157598
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.034913900253928
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.051642905896896
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.056357818756076
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.060375476861958
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.060965237381298
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.072748575219359
      },
      {
        "glyphs": [
          "[",
          "Ni"
        ],
        "score": -12.075050569687777
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.079266847085758
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.079661874544021
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.097813969788373
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.102597064372254
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.107853377612814
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.111187893483068
      },
      {
        "glyphs": [
          "[",
          "Pd",
          "+"
        ],
        "score": -12.126748570474751
      },
      {
        "glyphs": [
          "[",
          "Ir",
          "+"
        ],
        "score": -12.144992632876923
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.145387776923299
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.182985037049995
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -12.19071248616654
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.194552111524569
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.202008001444229
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -12.212724297039095
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.22914203050363
      },
      {
        "glyphs": [
          "[",
          "U"
        ],
        "score": -12.23624790705039
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.240748687149997
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.254356551376473
      },
      {
        "glyphs": [
          "[",
          "Ag"
        ],
        "score": -12.255285274467381
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.303552582678476
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.310489270702877
      },
      {
        "glyphs": [
          "[",
          "Ni",
          "+"
        ],
        "score": -12.310617846864012
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.313748474150634
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.322677992710005
      },
      {
        "glyphs": [
          "[",
          "Ru"
        ],
        "score": -12.327627762311526
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.334031152991015
      },
      {
        "glyphs": [
          "[",
          "P",
          "-"
        ],
        "score": -12.337870491630643
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.35218850425612
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.367393453312282
      },
      {
        "glyphs": [
          "[",
          "Ru",
          "+"
        ],
        "score": -12.36814488415547
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.384683722945814
      },
      {
        "glyphs": [
          "[",
          "Sb"
        ],
        "score": -12.391940306788008
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.40597848477025
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.411749808681744
      },
      {
        "glyphs": [
          "[",
          "Cr"
        ],
        "score": -12.415734750280741
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.424731459664947
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.426145891970984
      },
      {
        "glyphs": [
          "[",
          "Al",
          "+"
        ],
        "score": -12.427269541833782
      },
      {
        "glyphs": [
          "[",
          "Mo"
        ],
        "score": -12.437462425332141
      },
      {
        "glyphs": [
          "[",
          "Mn"
        ],
        "score": -12.445935126756858
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.472229308764305
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.494562910187437
      },
      {
        "glyphs": [
          "[",
          "Co",
          "+"
        ],
        "score": -12.519425985909507
      },
      {
        "glyphs": [
          "[",
          "Te"
        ],
        "score": -12.527919155289343
      },
      {
        "glyphs": [
          "[",
          "I",
          "+"
        ],
        "score": -12.551834032976647
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.574161168045308
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.578991764310334
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "N"
        ],
        "score": -12.645170815228905
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.658362238674972
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.674575230286317
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.679221958048378
      },
      {
        "glyphs": [
          "[",
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.684138017956771
      },
      {
        "glyphs": [
          "[",
          "Al",
          "H",
          "3"
        ],
        "score": -12.700165549523389
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.701489851622075
      },
      {
        "glyphs": [
          "[",
          "Cs"
        ],
        "score": -12.702358406402807
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.721181923784808
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -12.72731800317217
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
