{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1023,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1024,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1025,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1026,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1027,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1028,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1029,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.878902252804522
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.555718755604586
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.206420216341087
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.206420216341087
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.31876549116903
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.316479014124042
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.817966825412736
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.294819671873832
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.555878814497138
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.72913494676469
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.775159083242425
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.161391339724098
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8793281520792036
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.735928752977756
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.561995204555441
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.298211359546784
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.048245684566028
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.860963683352836
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.701725245652925
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.20414428665557
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -11.375551370121613
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -11.403752681927019
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.680865181532823
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -18.547266755728813
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -19.31603919269299
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.42593339699367
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.864938426318632
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -18.649898412736235
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -16.71185470630269
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -18.826777445810617
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.93900132931495
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -18.59726548352912
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.12048854969954
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -18.49964746641316
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -16.990661319230103
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.381807641560398
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.7578301045770601
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -19.316038690359136
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -18.826777426713797
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.82677710666239
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.486011340072096
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.2887584143719515
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -15.981397931607406
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -18.329048174252478
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -19.041796167730418
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.826777552092583
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -18.76427754224586
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.628920563669382
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.70545291728272
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.964871759259655
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.73027316829492
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.649897560842284
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.591359456450018
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -18.32904819077291
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.770904908144802
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.82099093848772
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -18.117766055825513
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -18.547266158806522
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -18.964873069799054
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.4746675020385815
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.35286739271909
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -19.12512952229031
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -17.970446869025317
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -18.70545244528324
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.82099093848772
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.5664367969721145
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -17.917103285017706
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.70545409932933
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -18.96487311790099
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.609689794438612
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.764277427006753
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -18.18335257538406
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.948306714270895
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -18.826776443226947
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.77500785180696
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -19.552150458911413
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -19.31603911451822
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -18.649898371504158
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.869190706199685
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.377800403749461
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -19.316039257828056
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -19.125129235672727
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -18.964872588648802
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.57668798931158
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -19.125129673694165
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.536233296900985
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -19.427143669136004
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.8287000260215507
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.705453627761436
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.180240160849191
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.778865457782665
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -18.05620769402215
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.547266784501247
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.315629135428626
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -19.216034828142647
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.764276735537546
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -18.499647778273037
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.015621762742875
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.691508819083825
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -18.893444394966615
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -17.707042195006714
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.023863177097374
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -18.45419297817957
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.403842841430293
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -18.499647671408447
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.367008228722536
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -18.597266720438217
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -19.42714985867773
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -18.290586678051202
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.249949108428304
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -18.454193239280645
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -18.32904753578947
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -18.7054542205621
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -18.253549296804803
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.76427703132809
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.764277428169915
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -18.36904554841894
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -18.11776100064211
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.826774636462332
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -19.316039188985425
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.649897897330128
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.893442177759525
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -19.316039142641067
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.31168182538763
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -19.216038999716293
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.70544819056674
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -18.705454101392117
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -19.12512818909458
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -18.369048194983762
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.086515208520222
      },
      {
        "glyphs": [
          "["
        ],
        "score": -5.905735648154085
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.492290403975682
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -3.896189542687484
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.449052608501617
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.6628792436355475
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8967058701714947
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.329372731895301
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.378603213455367
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.994250076950097
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -21.1450413078664
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -4.585984748184032
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -5.085964302102131
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -5.113994586218581
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.905857474966885
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.250064291721573
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -6.652707024531294
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.718321654884999
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.797892089058964
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -6.944392013148917
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -6.953140163471238
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.049831021040511
      },
      {
        "glyphs": [
          "[",
          "2",
          "H"
        ],
        "score": -7.181057416448402
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -7.692319552020168
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.69894841059531
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.192496013315873
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.39578234831445
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.519274347650821
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.551902283331172
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.661308246202752
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.688156850504475
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.802641772981227
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.857445763963032
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.876843038610822
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.069656236215014
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.08758838070254
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.125178667650877
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.143498176401108
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.346971314195049
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.371095521436127
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.388623026108691
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.414322932869606
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.482857196003653
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.51254174609709
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.53566318082957
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "2"
        ],
        "score": -9.577362297052899
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.680580261926528
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "3"
        ],
        "score": -9.692000922986725
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.699372753561448
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.712303899086264
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.827829404027325
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.859758521046652
      },
      {
        "glyphs": [
          "[",
          "Y"
        ],
        "score": -9.92955608505333
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.933881615775896
      },
      {
        "glyphs": [
          "[",
          "Ir"
        ],
        "score": -10.087353187646176
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -10.092469161534714
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.124994709083944
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.130779819456105
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.164733049299688
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -10.165534666309235
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.20069464778954
      },
      {
        "glyphs": [
          "[",
          "N",
          "H",
          "2"
        ],
        "score": -10.221224782456318
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.257320126686805
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.329637116595393
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -10.332524325202355
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.35866737787953
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.385996878050673
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.391825381444528
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.430481555719936
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.518024867205986
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.53717654435661
      },
      {
        "glyphs": [
          "[",
          "Li"
        ],
        "score": -10.598286222255227
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -10.599938513713417
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.658366558007138
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.752201051515701
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.766781466147956
      },
      {
        "glyphs": [
          "[",
          "Pt"
        ],
        "score": -10.784591339001903
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.824066361867631
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.844035403693521
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.861935839718306
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -10.8981265096348
      },
      {
        "glyphs": [
          "[",
          "Pt",
          "+"
        ],
        "score": -10.91502049270114
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H"
        ],
        "score": -10.94702632330605
      },
      {
        "glyphs": [
          "[",
          "S",
          "-"
        ],
        "score": -10.955143108881405
      },
      {
        "glyphs": [
          "[",
          "Sn"
        ],
        "score": -10.977672664484603
      },
      {
        "glyphs": [
          "[",
          "Se"
        ],
        "score": -10.987873118024913
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C"
        ],
        "score": -11.01259342052272
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.060243032167666
      },
      {
        "glyphs": [
          "[",
          "W"
        ],
        "score": -11.06667521069825
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "2"
        ],
        "score": -11.094210330660008
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.100833217591108
      },
      {
        "glyphs": [
          "[",
          "Zr",
          "+"
        ],
        "score": -11.19369188475007
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.21438931345418
      },
      {
        "glyphs": [
          "[",
          "V"
        ],
        "score": -11.281066289150864
      },
      {
        "glyphs": [
          "[",
          "P",
          "H"
        ],
        "score": -11.301460771360894
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.355426544519268
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "3"
        ],
        "score": -11.360488692612815
      },
      {
        "glyphs": [
          "[",
          "Mg",
          "+"
        ],
        "score": -11.405212693952555
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -11.434120491206489
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.446787366647692
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.448783681505178
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.452274485835355
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.513183358193604
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.519911713434853
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.521245091752634
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.545360227661039
      },
      {
        "glyphs": [
          "[",
          "Ge"
        ],
        "score": -11.587089580487556
      },
      {
        "glyphs": [
          "[",
          "Ca",
          "+"
        ],
        "score": -11.587933072033548
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -11.621570053623246
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.661588124665188
      },
      {
        "glyphs": [
          "[",
          "Zn",
          "+"
        ],
        "score": -11.688995289143095
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.695097578308133
      },
      {
        "glyphs": [
          "[",
          "Cu",
          "+"
        ],
        "score": -11.71138344853484
      },
      {
        "glyphs": [
          "[",
          "Fe"
        ],
        "score": -11.718706128758914
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.723504024842985
      },
      {
        "glyphs": [
          "[",
          "Al"
        ],
        "score": -11.723974710056277
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.73534021359064
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.740080934578565
      },
      {
        "glyphs": [
          "[",
          "Ti"
        ],
        "score": -11.750700164165467
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.763561318983404
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.76945924195797
      },
      {
        "glyphs": [
          "[",
          "Ti",
          "+"
        ],
        "score": -11.77354320745982
      },
      {
        "glyphs": [
          "[",
          "se"
        ],
        "score": -11.804025052781165
      },
      {
        "glyphs": [
          "[",
          "Zn"
        ],
        "score": -11.852671250740514
      },
      {
        "glyphs": [
          "[",
          "Rb"
        ],
        "score": -11.863686712647231
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.873583722474464
      },
      {
        "glyphs": [
          "[",
          "Zr"
        ],
        "score": -11.900602467746467
      },
      {
        "glyphs": [
          "[",
          "Co"
        ],
        "score": -11.925715540339517
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.93792892325167
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.942795933628561
      },
      {
        "glyphs": [
          "[",
          "Cl",
          "+"
        ],
        "score": -11.942879505157975
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.951565238289652
      },
      {
        "glyphs": [
          "[",
          "Pd"
        ],
        "score": -11.988155756119063
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.024067851568708
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.025098197479698
      },
      {
        "glyphs": [
          "[",
          "Cu"
        ],
        "score": -12.028242235030211
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.031843166004926
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -12.03271822450261
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.051560723708574
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.05420625357519
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.059996490323087
      },
      {
        "glyphs": [
          "[",
          "Ni"
        ],
        "score": -12.074735667315968
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.08563507657376
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.088107292100027
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.10562937286663
      },
      {
        "glyphs": [
          "[",
          "As"
        ],
        "score": -12.117225326011122
      },
      {
        "glyphs": [
          "[",
          "Pd",
          "+"
        ],
        "score": -12.126426952955882
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.131916179333807
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.143395201495608
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.144522424372083
      },
      {
        "glyphs": [
          "[",
          "Ir",
          "+"
        ],
        "score": -12.144650212155648
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.170556701650407
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -12.190394415760688
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.194264628839438
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.196448057984803
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.201708792515957
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -12.212406225533986
      },
      {
        "glyphs": [
          "[",
          "U"
        ],
        "score": -12.235933002650164
      },
      {
        "glyphs": [
          "[",
          "Ag"
        ],
        "score": -12.254967243313327
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.268462501040208
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.278996389732567
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.303268609219844
      },
      {
        "glyphs": [
          "[",
          "Ni",
          "+"
        ],
        "score": -12.310295862661864
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.314464508822667
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.332957752874455
      },
      {
        "glyphs": [
          "[",
          "P",
          "-"
        ],
        "score": -12.33752527266089
      },
      {
        "glyphs": [
          "[",
          "Ru"
        ],
        "score": -12.349642907254262
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.360402547418206
      },
      {
        "glyphs": [
          "[",
          "Ru",
          "+"
        ],
        "score": -12.3677820631584
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.387562674958033
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.402260883803212
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.411455048103367
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.414231640072224
      },
      {
        "glyphs": [
          "[",
          "Cr"
        ],
        "score": -12.415419845811677
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.423387137598834
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.424983676959226
      },
      {
        "glyphs": [
          "[",
          "Al",
          "+"
        ],
        "score": -12.42681206508553
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.426973914808462
      },
      {
        "glyphs": [
          "[",
          "Mo"
        ],
        "score": -12.437147516874198
      },
      {
        "glyphs": [
          "[",
          "Mn"
        ],
        "score": -12.445620223588008
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.470055971615874
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.50616858157861
      },
      {
        "glyphs": [
          "[",
          "Co",
          "+"
        ],
        "score": -12.51910230059418
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.535371617055567
      },
      {
        "glyphs": [
          "[",
          "I",
          "+"
        ],
        "score": -12.551512711795857
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.557381960246893
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.578837394448858
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.59222801545746
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.593487154403508
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.646050747973
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.65886598126183
      },
      {
        "glyphs": [
          "[",
          "Te"
        ],
        "score": -12.664275741891425
      },
      {
        "glyphs": [
          "[",
          "Sb"
        ],
        "score": -12.676431556756963
      },
      {
        "glyphs": [
          "[",
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.68382411049635
      },
      {
        "glyphs": [
          "[",
          "Al",
          "H",
          "3"
        ],
        "score": -12.69984950602781
      },
      {
        "glyphs": [
          "[",
          "Cs"
        ],
        "score": -12.702040374505906
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.719358775152083
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.720915540209418
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.730189834074215
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.744742138826041
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.750239219472691
      },
      {
        "glyphs": [
          "[",
          "1",
          "8",
          "F"
        ],
        "score": -12.757979545253544
      },
      {
        "glyphs": [
          "[",
          "Pb"
        ],
        "score": -12.761584229690845
      },
      {
        "glyphs": [
          "[",
          "Au",
          "+"
        ],
        "score": -12.774900124209227
      },
      {
        "glyphs": [
          "[",
          "Ba",
          "+"
        ],
        "score": -12.774971105549245
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.792898312804882
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.79342865767752
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.801500385794734
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
