{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 255,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 256,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 257,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 258,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 259,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 260,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 261,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -10.88152113762957
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -12.196980011688954
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2122889996289796
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2122889996289796
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.263841720757789
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.319932833650389
      },
      {
        "glyphs": [
          "."
        ],
        "score": -9.032471941053663
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -4.509778227114882
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -9.537145383626784
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -3.2525228142377127
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.4107851423728786
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8699572918597163
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.5443402934154875
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.3325252789698805
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.03655180275709
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -6.750995250531529
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.601919100640956
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.560328270762419
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.053431470902531
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -9.724822068486993
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -9.793043248565072
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -18.21216716050309
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -18.211467160503087
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -18.21186716050309
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -18.21396716050309
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -18.211767160503086
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -12.89550507137821
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -18.21196716050309
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -18.21096716050309
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -18.212667160503088
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -7.694984930047076
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.5954896885722363
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -18.211267160503088
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -18.212967160503087
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -7.032235648868905
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -18.212867160503087
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -15.764067160503085
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -18.21236716050309
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -9.850507344687713
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -18.21086716050309
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -15.764067160503084
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -18.213267160503086
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -18.21206716050309
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -2.852027979315231
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -17.214067160503088
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -18.21066716050309
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -18.213067160503087
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -10.230444378362675
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -18.212567160503088
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -18.211567160503087
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -18.21246716050309
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -16.38073382716975
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -18.212767160503088
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -18.21076716050309
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -18.211167160503088
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -4.249457868076817
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -18.21356716050309
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -18.21346716050309
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.321855979438764
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -10.730850992451733
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -18.21046716050309
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -18.21376716050309
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -18.213167160503087
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -17.214067160503088
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -18.21056716050309
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -7.106199334595704
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -18.211667160503087
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -18.21366716050309
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -18.211367160503087
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -16.714067160503088
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -18.21386716050309
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -15.930733827169753
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -16.380733827169752
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -18.211067160503088
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -17.214067160503088
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.21226716050309
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -18.21336716050309
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -16.130733827169752
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.214067160503088
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "["
        ],
        "score": -7.1763197784502815
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -5.359284110813441
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -2.612873101070047
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -18.214067160503088
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.845503557121953
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -6.101689153703775
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -8.067436378824153
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -16.3807338271298
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -8.84422720361373
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -15.621210017605984
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -3.2918721368117083
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -3.3892292866256586
      },
      {
        "glyphs": [
          "c",
          "c",
          "c"
        ],
        "score": -5.0044603433633466
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -5.611221516660798
      },
      {
        "glyphs": [
          "o",
          "c"
        ],
        "score": -6.541622899087589
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.837214953747829
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.048847512778011
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.16887848505648
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.243546080113797
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -7.689952043959433
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.732879927222964
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -7.739314826764982
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.901942638876232
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.912522632240879
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -8.17748548555662
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.262296947518259
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.293969712798418
      },
      {
        "glyphs": [
          "C",
          "#",
          "C"
        ],
        "score": -8.320159195286577
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.356631345996094
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.412715046176451
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "c"
        ],
        "score": -8.561469072127954
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.581466184095909
      },
      {
        "glyphs": [
          "c",
          "n",
          "c"
        ],
        "score": -8.624951034869985
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.776419502105961
      },
      {
        "glyphs": [
          "c",
          "o",
          "c"
        ],
        "score": -8.94295432464604
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -9.017833091794317
      },
      {
        "glyphs": [
          "%",
          "1"
        ],
        "score": -9.028979264500487
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -9.104336462887114
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.164192731433568
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "n"
        ],
        "score": -9.17080746257428
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "o"
        ],
        "score": -9.204716677411174
      },
      {
        "glyphs": [
          "n",
          "n"
        ],
        "score": -9.312726415079657
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "s"
        ],
        "score": -9.504998211153064
      },
      {
        "glyphs": [
          "c",
          "s",
          "c"
        ],
        "score": -9.590912511655972
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -9.610228247425272
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -9.625099939554142
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.826796968803748
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.891199544330624
      },
      {
        "glyphs": [
          "N",
          "S"
        ],
        "score": -9.905865392221477
      },
      {
        "glyphs": [
          "n",
          "o"
        ],
        "score": -9.942044717971688
      },
      {
        "glyphs": [
          "n",
          "n",
          "c"
        ],
        "score": -9.956295233468335
      },
      {
        "glyphs": [
          "n",
          "c",
          "n"
        ],
        "score": -9.965095372454124
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "c"
        ],
        "score": -9.966968201346166
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.043936316551466
      },
      {
        "glyphs": [
          "n",
          "c",
          "c"
        ],
        "score": -10.078563756243145
      },
      {
        "glyphs": [
          "c",
          "c",
          "n"
        ],
        "score": -10.09070051754958
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -10.117471402460476
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -10.162949124302322
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -10.251252223288098
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -10.261602915824756
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -10.264774084404717
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.449655130927216
      },
      {
        "glyphs": [
          "C",
          "S",
          "S"
        ],
        "score": -10.455784204426678
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -10.492531895081829
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -10.506153341380912
      },
      {
        "glyphs": [
          "o",
          "n"
        ],
        "score": -10.586113641826827
      },
      {
        "glyphs": [
          "S",
          "S"
        ],
        "score": -10.612469647783293
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.720858426080017
      },
      {
        "glyphs": [
          "o",
          "c",
          "c",
          "c"
        ],
        "score": -10.753619020451612
      },
      {
        "glyphs": [
          "S",
          "S",
          "C"
        ],
        "score": -10.762203719099315
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.809676907250253
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.828649133691847
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -10.907335468459301
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.909910366933284
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.915211761228875
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -10.985122731048872
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -11.086485616315542
      },
      {
        "glyphs": [
          "c",
          "c",
          "s"
        ],
        "score": -11.159168747711433
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -11.175221485885078
      },
      {
        "glyphs": [
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -11.177362008376843
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.19293438797419
      },
      {
        "glyphs": [
          "c",
          "n",
          "n"
        ],
        "score": -11.237442604852987
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -11.274873900610457
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.28337854773214
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "c"
        ],
        "score": -11.350533551412287
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -11.375651710873854
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.406616510905042
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -11.413283576596982
      },
      {
        "glyphs": [
          "[",
          "S",
          "@@"
        ],
        "score": -11.437360112886726
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.466741242657172
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.469000446770995
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.472861537087418
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -11.530942708742554
      },
      {
        "glyphs": [
          "o",
          "n",
          "c"
        ],
        "score": -11.548547917081763
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -11.55264086818688
      },
      {
        "glyphs": [
          "[",
          "S",
          "@"
        ],
        "score": -11.712088787703628
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.832635098316803
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.864374796160112
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -11.98097324833606
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.01421642364559
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.060097561790304
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.290223133304242
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -12.527878779636918
      },
      {
        "glyphs": [
          "[",
          "As"
        ],
        "score": -12.677507444081584
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -12.691984893978912
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.792787056289665
      },
      {
        "glyphs": [
          "S",
          "S",
          "S",
          "S"
        ],
        "score": -12.851200588778891
      }
    ]
  }
}