{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        45,
        45
      ],
      [
        153,
        153
      ],
      [
        22,
        102
      ],
      [
        71,
        150
      ],
      [
        148,
        45
      ],
      [
        163,
        23
      ],
      [
        163,
        24
      ],
      [
        164,
        162
      ],
      [
        165,
        162
      ],
      [
        93,
        45
      ],
      [
        160,
        153
      ],
      [
        154,
        153
      ],
      [
        159,
        45
      ],
      [
        45,
        153
      ],
      [
        148,
        154
      ],
      [
        173,
        162
      ],
      [
        22,
        45
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        102,
        175
      ],
      [
        159,
        159
      ],
      [
        160,
        160
      ],
      [
        159,
        93
      ],
      [
        159,
        102
      ],
      [
        93,
        153
      ],
      [
        160,
        169
      ],
      [
        22,
        153
      ],
      [
        154,
        160
      ],
      [
        45,
        168
      ],
      [
        157,
        153
      ],
      [
        154,
        154
      ],
      [
        102,
        45
      ],
      [
        159,
        153
      ],
      [
        93,
        122
      ],
      [
        164,
        150
      ],
      [
        93,
        185
      ],
      [
        165,
        150
      ],
      [
        8,
        153
      ],
      [
        176,
        45
      ],
      [
        45,
        122
      ],
      [
        153,
        154
      ],
      [
        153,
        170
      ],
      [
        176,
        153
      ],
      [
        22,
        93
      ],
      [
        45,
        1
      ],
      [
        171,
        93
      ],
      [
        45,
        22
      ],
      [
        22,
        168
      ],
      [
        182,
        45
      ],
      [
        155,
        153
      ],
      [
        148,
        93
      ],
      [
        93,
        159
      ],
      [
        7,
        150
      ],
      [
        8,
        150
      ],
      [
        209,
        211
      ],
      [
        154,
        170
      ],
      [
        102,
        159
      ],
      [
        45,
        175
      ],
      [
        177,
        185
      ],
      [
        203,
        93
      ],
      [
        148,
        102
      ],
      [
        219,
        212
      ],
      [
        45,
        154
      ],
      [
        159,
        171
      ],
      [
        153,
        157
      ],
      [
        168,
        153
      ],
      [
        159,
        122
      ],
      [
        159,
        168
      ],
      [
        153,
        188
      ],
      [
        171,
        102
      ],
      [
        154,
        155
      ],
      [
        182,
        159
      ],
      [
        153,
        189
      ],
      [
        93,
        168
      ],
      [
        160,
        170
      ],
      [
        159,
        154
      ],
      [
        171,
        153
      ],
      [
        22,
        122
      ],
      [
        153,
        186
      ],
      [
        198,
        153
      ],
      [
        205,
        159
      ],
      [
        169,
        170
      ],
      [
        160,
        154
      ],
      [
        153,
        208
      ],
      [
        170,
        170
      ],
      [
        102,
        153
      ],
      [
        154,
        169
      ],
      [
        93,
        1
      ],
      [
        176,
        172
      ],
      [
        160,
        188
      ],
      [
        22,
        159
      ],
      [
        176,
        168
      ],
      [
        182,
        153
      ],
      [
        160,
        186
      ],
      [
        93,
        215
      ],
      [
        176,
        159
      ],
      [
        154,
        180
      ],
      [
        122,
        45
      ],
      [
        179,
        93
      ],
      [
        198,
        45
      ],
      [
        155,
        154
      ],
      [
        102,
        236
      ],
      [
        93,
        171
      ],
      [
        177,
        122
      ],
      [
        169,
        157
      ],
      [
        170,
        157
      ],
      [
        181,
        185
      ],
      [
        93,
        190
      ],
      [
        246,
        172
      ],
      [
        170,
        155
      ],
      [
        169,
        154
      ],
      [
        205,
        172
      ],
      [
        177,
        153
      ],
      [
        157,
        169
      ],
      [
        205,
        171
      ],
      [
        154,
        208
      ],
      [
        171,
        168
      ],
      [
        45,
        63
      ],
      [
        179,
        159
      ],
      [
        180,
        154
      ],
      [
        182,
        168
      ],
      [
        179,
        102
      ],
      [
        171,
        190
      ],
      [
        93,
        102
      ],
      [
        202,
        168
      ],
      [
        148,
        122
      ],
      [
        153,
        155
      ],
      [
        225,
        45
      ],
      [
        186,
        157
      ],
      [
        169,
        155
      ],
      [
        160,
        208
      ],
      [
        171,
        122
      ],
      [
        203,
        159
      ],
      [
        22,
        171
      ],
      [
        202,
        93
      ],
      [
        202,
        159
      ],
      [
        199,
        186
      ],
      [
        93,
        191
      ],
      [
        159,
        175
      ],
      [
        122,
        153
      ],
      [
        8,
        154
      ],
      [
        160,
        189
      ],
      [
        170,
        154
      ],
      [
        102,
        172
      ],
      [
        159,
        249
      ],
      [
        198,
        159
      ],
      [
        122,
        159
      ],
      [
        102,
        168
      ],
      [
        154,
        157
      ],
      [
        176,
        181
      ],
      [
        225,
        159
      ],
      [
        159,
        63
      ],
      [
        189,
        154
      ],
      [
        176,
        191
      ],
      [
        23,
        150
      ],
      [
        284,
        313
      ],
      [
        159,
        292
      ],
      [
        155,
        169
      ],
      [
        205,
        181
      ],
      [
        154,
        188
      ],
      [
        160,
        259
      ],
      [
        209,
        212
      ],
      [
        102,
        182
      ],
      [
        93,
        179
      ],
      [
        93,
        175
      ],
      [
        171,
        154
      ],
      [
        24,
        150
      ],
      [
        284,
        325
      ],
      [
        205,
        179
      ],
      [
        170,
        188
      ],
      [
        203,
        45
      ],
      [
        186,
        154
      ],
      [
        202,
        102
      ],
      [
        1,
        93
      ],
      [
        188,
        170
      ],
      [
        102,
        171
      ],
      [
        223,
        160
      ],
      [
        157,
        154
      ],
      [
        225,
        153
      ],
      [
        181,
        122
      ],
      [
        199,
        169
      ],
      [
        187,
        153
      ],
      [
        228,
        168
      ],
      [
        200,
        154
      ],
      [
        206,
        153
      ],
      [
        227,
        154
      ],
      [
        93,
        22
      ],
      [
        203,
        172
      ],
      [
        179,
        168
      ],
      [
        122,
        172
      ],
      [
        22,
        172
      ],
      [
        176,
        171
      ],
      [
        157,
        170
      ],
      [
        171,
        194
      ],
      [
        179,
        122
      ],
      [
        93,
        183
      ],
      [
        228,
        153
      ],
      [
        199,
        170
      ],
      [
        200,
        157
      ],
      [
        282,
        171
      ],
      [
        93,
        182
      ],
      [
        198,
        172
      ],
      [
        245,
        154
      ],
      [
        176,
        182
      ],
      [
        102,
        22
      ],
      [
        155,
        170
      ],
      [
        214,
        157
      ],
      [
        199,
        188
      ],
      [
        179,
        171
      ],
      [
        22,
        179
      ],
      [
        170,
        208
      ],
      [
        93,
        181
      ],
      [
        246,
        45
      ],
      [
        186,
        170
      ],
      [
        155,
        200
      ],
      [
        102,
        176
      ],
      [
        179,
        153
      ],
      [
        157,
        160
      ],
      [
        159,
        1
      ],
      [
        171,
        175
      ],
      [
        157,
        214
      ],
      [
        159,
        332
      ],
      [
        189,
        188
      ],
      [
        171,
        215
      ],
      [
        22,
        181
      ],
      [
        229,
        160
      ],
      [
        181,
        153
      ],
      [
        205,
        279
      ],
      [
        237,
        154
      ],
      [
        231,
        154
      ],
      [
        253,
        63
      ],
      [
        285,
        170
      ],
      [
        199,
        208
      ],
      [
        241,
        157
      ],
      [
        200,
        170
      ],
      [
        159,
        22
      ],
      [
        22,
        183
      ],
      [
        202,
        171
      ],
      [
        171,
        256
      ],
      [
        22,
        192
      ],
      [
        203,
        171
      ],
      [
        246,
        159
      ],
      [
        203,
        279
      ],
      [
        93,
        192
      ],
      [
        157,
        186
      ],
      [
        307,
        160
      ],
      [
        93,
        93
      ],
      [
        176,
        93
      ],
      [
        231,
        157
      ],
      [
        160,
        8
      ],
      [
        198,
        181
      ],
      [
        205,
        182
      ],
      [
        282,
        172
      ],
      [
        210,
        168
      ],
      [
        203,
        181
      ],
      [
        45,
        161
      ],
      [
        280,
        168
      ],
      [
        214,
        154
      ],
      [
        93,
        235
      ],
      [
        45,
        105
      ],
      [
        200,
        155
      ],
      [
        170,
        186
      ],
      [
        22,
        222
      ],
      [
        210,
        171
      ],
      [
        198,
        171
      ],
      [
        223,
        170
      ],
      [
        155,
        160
      ],
      [
        102,
        179
      ],
      [
        253,
        175
      ],
      [
        285,
        199
      ],
      [
        171,
        63
      ],
      [
        154,
        186
      ],
      [
        229,
        170
      ],
      [
        182,
        171
      ],
      [
        171,
        249
      ],
      [
        198,
        225
      ],
      [
        182,
        172
      ],
      [
        102,
        191
      ],
      [
        182,
        226
      ],
      [
        210,
        154
      ],
      [
        171,
        332
      ],
      [
        307,
        170
      ],
      [
        127,
        150
      ],
      [
        148,
        441
      ],
      [
        170,
        189
      ],
      [
        93,
        265
      ],
      [
        159,
        204
      ],
      [
        176,
        234
      ],
      [
        176,
        251
      ],
      [
        199,
        336
      ],
      [
        202,
        179
      ],
      [
        93,
        194
      ],
      [
        169,
        189
      ],
      [
        189,
        170
      ],
      [
        189,
        189
      ],
      [
        215,
        168
      ],
      [
        102,
        181
      ],
      [
        233,
        154
      ],
      [
        179,
        63
      ],
      [
        160,
        336
      ],
      [
        427,
        50
      ],
      [
        179,
        194
      ],
      [
        223,
        189
      ],
      [
        285,
        160
      ],
      [
        93,
        244
      ],
      [
        205,
        207
      ],
      [
        377,
        159
      ],
      [
        22,
        226
      ],
      [
        203,
        222
      ],
      [
        203,
        182
      ],
      [
        93,
        251
      ],
      [
        177,
        22
      ],
      [
        205,
        341
      ],
      [
        290,
        159
      ],
      [
        358,
        63
      ],
      [
        202,
        181
      ],
      [
        282,
        182
      ],
      [
        102,
        228
      ],
      [
        93,
        204
      ],
      [
        155,
        186
      ],
      [
        93,
        202
      ],
      [
        93,
        207
      ],
      [
        186,
        155
      ],
      [
        290,
        153
      ],
      [
        394,
        182
      ],
      [
        216,
        44
      ],
      [
        182,
        181
      ],
      [
        179,
        179
      ],
      [
        205,
        204
      ],
      [
        205,
        234
      ],
      [
        394,
        279
      ],
      [
        210,
        175
      ],
      [
        261,
        194
      ],
      [
        171,
        192
      ],
      [
        202,
        226
      ],
      [
        239,
        63
      ],
      [
        222,
        168
      ],
      [
        216,
        175
      ],
      [
        216,
        77
      ],
      [
        93,
        236
      ],
      [
        171,
        292
      ],
      [
        198,
        177
      ],
      [
        203,
        341
      ],
      [
        102,
        185
      ],
      [
        93,
        277
      ],
      [
        179,
        154
      ],
      [
        63,
        45
      ],
      [
        205,
        225
      ],
      [
        157,
        241
      ],
      [
        93,
        154
      ],
      [
        122,
        171
      ],
      [
        160,
        229
      ],
      [
        203,
        179
      ],
      [
        210,
        22
      ],
      [
        198,
        179
      ]
    ]
  }
}