{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 255,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 256,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 257,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 258,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 259,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 260,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 261,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -7.0736046706877325
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.1534873723781374
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.1534873723781374
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.2281629358801105
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.139312849089961
      },
      {
        "glyphs": [
          "."
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -8.103106420491455
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.7075745472201476
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.3281663113393023
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -4.595036961634538
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -6.670193347667343
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -9.755342912016244
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -13.442727618387346
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "="
        ],
        "score": -2.9452787629192763
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -4.194741073758184
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -4.227192317607626
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -5.8721019756776585
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.4978619517982494
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.343021503800873
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.332191347431033
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -3.4202272816238946
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.893799899911009
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.2341533254955586
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.6127748765944965
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -9.898623860993052
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.089024954409133
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -11.080567725074351
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "["
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -9.005714965884438
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.0653477966164893
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.4865959121877204
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -5.675400334710437
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.024914908415099
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -15.749638636187598
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -6.070661779627233
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -8.081673236526106
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.335842989599454
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -8.53425738844052
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.380285521138491
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.24320030340633
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -10.48549492145316
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.681779970991169
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.707125302949661
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.867414518341011
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.93926121887904
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -10.947368220076713
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.027001532773722
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.07191052583752
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -11.245724281075383
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.336832716471621
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.33872201544964
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.46189938916763
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.534451964908852
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.564618687493784
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.60037222742459
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -11.633926879210408
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.638208103573552
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.747833995944449
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.829298144214654
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.832880401489705
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -11.850964000231254
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.889159288687654
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.934695213679959
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C"
        ],
        "score": -11.997804913792876
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.006412639455004
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.02002838341868
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.040581316239406
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -12.050424519012076
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.085521141683753
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.100058540838685
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -12.103511238399324
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.103627189981324
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.129799045871852
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.172636391643135
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.232174461610654
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.24453663565632
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.26461574551152
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.269303452517516
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -12.303812524433905
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.325014518070223
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.340061303540697
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.360909879766588
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.408007802321226
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.416131568003518
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.43977441270992
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.462053616967614
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.525636430036279
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.534165570369613
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.592387283578844
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -12.653068620734274
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.654115036191072
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.668916049578918
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.684772788482912
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.758961296647398
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.770451380755635
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "#"
        ],
        "score": -12.793232767965169
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.800110425038515
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.82736596530156
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.833037486473781
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.862460703275424
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.885337547796187
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.94922233149262
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.978378674457725
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.031545180318393
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.070185441177383
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.098265281546286
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -13.115987494920557
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.16771271020302
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.174569931974698
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.174859636137796
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.185943009282749
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.25773352953898
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -13.294901327114797
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.299653243749097
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.403437427573202
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -13.442750640793744
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.451440001994024
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "#"
        ],
        "score": -13.459034975608295
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.483000741959511
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.522469906384822
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.55258451480251
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.57205830035399
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.59327140487733
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.647802659991706
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -13.700560343155196
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.726746939227802
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.0408054118629
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.13028633324615
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.174057549139878
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.30398047597582
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -14.30409345484421
      }
    ]
  }
}