{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 927,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 928,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 929,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 930,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 931,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 932,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 933,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -10.663298029066413
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -11.666553731355375
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2134604249209193
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2134604249209193
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.267363820261494
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.3187991289765435
      },
      {
        "glyphs": [
          "."
        ],
        "score": -9.033643366345602
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -4.510949652406822
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -9.58107343674123
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -3.2536993589276815
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.411962535536418
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8711402623865325
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.545511718707427
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.33369670426182
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.03772322804903
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -6.752241563258227
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.603090525932895
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.561941484224064
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.0552061679156086
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -8.212299603851282
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -8.376951273587082
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -19.57943979153483
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -19.57883979153483
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -19.58003979153483
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -19.58083979153483
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -19.57963979153483
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -13.19618350413409
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -19.57973979153483
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -19.57813979153483
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -7.696156355339015
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.591485261075384
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -19.58093979153483
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -19.57863979153483
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -7.0333869366565125
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -19.58113979153483
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -18.181137568023477
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -19.57853979153483
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -9.851678769979653
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -19.57983979153483
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -18.182772202854338
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -19.57843979153483
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -19.57953979153483
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -2.8531916118813783
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -17.215238585795028
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -19.579139791534832
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -19.57793979153483
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -10.23890487901904
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -19.57873979153483
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -19.580739791534832
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -19.57933979153483
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -17.215238584087015
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -19.57803979153483
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -19.580539791534832
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -19.579039791534832
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -4.249522352214697
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -15.920173826810817
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -19.57993979153483
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.3230230108477876
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -10.630144315486902
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -19.58023979153483
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -19.57893979153483
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -19.58103979153483
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -17.21523858575507
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -19.57773979153483
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -7.10327821194292
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -19.57783979153483
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -19.580639791534832
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -19.58033979153483
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -18.175197358711515
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -19.57923979153483
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -18.182107195630646
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -17.170891486861578
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -19.58043979153483
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -17.215238585795028
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -19.57823979153483
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -19.58013979153483
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -16.131905252461692
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.215238585795028
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -19.57833979153483
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.215238585795028
      },
      {
        "glyphs": [
          "["
        ],
        "score": -6.765848479208032
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -5.3604555361053805
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -2.6140445263619867
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -19.58123979153483
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.8462317486031576
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -6.101674147614602
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -7.904400661204395
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -17.21523853091547
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -8.887870952856428
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -15.622381442897924
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -3.298739688652905
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -3.3955729114830735
      },
      {
        "glyphs": [
          "c",
          "c",
          "c"
        ],
        "score": -5.078926830762132
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -5.627830235693226
      },
      {
        "glyphs": [
          "o",
          "c"
        ],
        "score": -6.609327615188338
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.8418745117812545
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -7.042411130072546
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.0475989708636675
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.348726606352836
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.4817293704732695
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.627718127650535
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -7.752793343324415
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.9615253425919885
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.04672058709147
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.186981160118034
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -8.189147938038056
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.203638169109968
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.250086826892955
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.262260944514201
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.45202582037114
      },
      {
        "glyphs": [
          "C",
          "#",
          "C"
        ],
        "score": -8.51237112894364
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.569600336154547
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "c"
        ],
        "score": -8.570492527622482
      },
      {
        "glyphs": [
          "c",
          "n",
          "c"
        ],
        "score": -8.681766544546175
      },
      {
        "glyphs": [
          "c",
          "o",
          "c"
        ],
        "score": -8.704835030865953
      },
      {
        "glyphs": [
          "%",
          "1"
        ],
        "score": -9.060126273142842
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "n"
        ],
        "score": -9.135789397348878
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -9.173261397441328
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "o"
        ],
        "score": -9.219521236702738
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.221509106826133
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -9.25582332701008
      },
      {
        "glyphs": [
          "n",
          "n"
        ],
        "score": -9.360919568232259
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "s"
        ],
        "score": -9.50229177076563
      },
      {
        "glyphs": [
          "c",
          "s",
          "c"
        ],
        "score": -9.608147067697143
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -9.611695892920045
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -9.714886678821436
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.819155009622374
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "c"
        ],
        "score": -9.870869813199098
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.894998289486674
      },
      {
        "glyphs": [
          "N",
          "S"
        ],
        "score": -9.93377114357822
      },
      {
        "glyphs": [
          "n",
          "n",
          "c"
        ],
        "score": -9.963003838721866
      },
      {
        "glyphs": [
          "n",
          "c",
          "n"
        ],
        "score": -9.974070709997626
      },
      {
        "glyphs": [
          "n",
          "o"
        ],
        "score": -9.983451950835029
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -10.080022631077004
      },
      {
        "glyphs": [
          "c",
          "c",
          "n"
        ],
        "score": -10.155920472071092
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.165858034427783
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -10.247204248226643
      },
      {
        "glyphs": [
          "n",
          "c",
          "c"
        ],
        "score": -10.289888373864745
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -10.312234497098437
      },
      {
        "glyphs": [
          "C",
          "S",
          "S"
        ],
        "score": -10.510662972807703
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -10.583970188142088
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -10.609730668302811
      },
      {
        "glyphs": [
          "S",
          "S"
        ],
        "score": -10.663286836797152
      },
      {
        "glyphs": [
          "o",
          "c",
          "c",
          "c"
        ],
        "score": -10.699155921622829
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -10.713204986071071
      },
      {
        "glyphs": [
          "o",
          "n"
        ],
        "score": -10.729135225736337
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.729586326118005
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -10.776715124834892
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.80011861316787
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.832869237175474
      },
      {
        "glyphs": [
          "S",
          "S",
          "C"
        ],
        "score": -10.883551659510605
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -10.97883044521818
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.984043921266032
      },
      {
        "glyphs": [
          "c",
          "c",
          "s"
        ],
        "score": -11.073672942701817
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -11.078621784118885
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -11.08811234299861
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -11.164087010507485
      },
      {
        "glyphs": [
          "c",
          "n",
          "n"
        ],
        "score": -11.187310523664445
      },
      {
        "glyphs": [
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -11.21076196025275
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -11.230146626791054
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.254008809171893
      },
      {
        "glyphs": [
          "=",
          "N",
          "N"
        ],
        "score": -11.345579661392057
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "c"
        ],
        "score": -11.352663094605383
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -11.37259538056434
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -11.415967023181159
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c"
        ],
        "score": -11.429081749859119
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.443907927760783
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.455136997552035
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.459482800214328
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.48294294030601
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.512164095783238
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.52029668598363
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.52988883902346
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -11.53410781719512
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -11.555123840582882
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -11.560815978294524
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.59976269709881
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.617151519977059
      },
      {
        "glyphs": [
          "o",
          "n",
          "c"
        ],
        "score": -11.644912672388509
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.712775497272368
      },
      {
        "glyphs": [
          "[",
          "S",
          "@@"
        ],
        "score": -11.773630374331313
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.795719069017807
      },
      {
        "glyphs": [
          "[",
          "S",
          "@"
        ],
        "score": -11.815514207666181
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.816502293306435
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.849914170898888
      },
      {
        "glyphs": [
          "c",
          "c",
          "s",
          "c"
        ],
        "score": -11.937071310793925
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.97630346523389
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.03029601541671
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.12494402283735
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "n"
        ],
        "score": -12.140687384293674
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.169002646919939
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.231582601547675
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.241524456978105
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.27994308388072
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.297056999781393
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.365137021065582
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -12.529244309073981
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.56434422835528
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "o"
        ],
        "score": -12.590925403414392
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.637110105385633
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.64382938089733
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.66587574065733
      },
      {
        "glyphs": [
          "[",
          "As"
        ],
        "score": -12.67867887081729
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.679128565713409
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "N"
        ],
        "score": -12.687630379306393
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -12.693058997492582
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.706600104325364
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -12.715481498399946
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "N",
          "="
        ],
        "score": -12.734779666249718
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.741711820274745
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.752099055088738
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.761854021726474
      },
      {
        "glyphs": [
          "[",
          "S",
          "@",
          "H"
        ],
        "score": -12.783417138789023
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "n"
        ],
        "score": -12.790815797318412
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.833299480481578
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.84362963853173
      },
      {
        "glyphs": [
          "[",
          "S",
          "@@",
          "H"
        ],
        "score": -12.873896679680616
      },
      {
        "glyphs": [
          "S",
          "S",
          "S"
        ],
        "score": -12.88569406490286
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.886805491032769
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.907264771313693
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.918950167386205
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.967839580769544
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -12.97704390644924
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.979991579300066
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.984879977939471
      },
      {
        "glyphs": [
          "[",
          "B"
        ],
        "score": -13.017384181834025
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "N"
        ],
        "score": -13.03211477554322
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.048139878572766
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.07510554114507
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -13.094542746038151
      },
      {
        "glyphs": [
          "[",
          "Se"
        ],
        "score": -13.135127405015119
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.142908422762623
      },
      {
        "glyphs": [
          "S",
          "S",
          "S",
          "S"
        ],
        "score": -13.151141032965102
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "o"
        ],
        "score": -13.169987819869341
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.182740506677952
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.19259361072378
      },
      {
        "glyphs": [
          "c",
          "n",
          "n",
          "n"
        ],
        "score": -13.211326982781308
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.244882242949132
      },
      {
        "glyphs": [
          "s",
          "n",
          "n"
        ],
        "score": -13.273619487332123
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S"
        ],
        "score": -13.350653318214459
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.359919960003896
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -13.362843501017679
      },
      {
        "glyphs": [
          "[",
          "Mg",
          "+"
        ],
        "score": -13.426281168917448
      },
      {
        "glyphs": [
          "o",
          "c",
          "n",
          "c"
        ],
        "score": -13.427453408762783
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.455132133307657
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.467218297045825
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.47930942891653
      },
      {
        "glyphs": [
          "[",
          "Ca"
        ],
        "score": -13.502845701526182
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.515846361062168
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -13.52872491887766
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.560439768499993
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -13.59233129100759
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -13.602189113781918
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -13.60918819903981
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -13.619728042337181
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.629436195572822
      },
      {
        "glyphs": [
          "s",
          "n",
          "c"
        ],
        "score": -13.64440241211895
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.666010532644414
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.668556400776252
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.671491137425713
      },
      {
        "glyphs": [
          "[",
          "Fe"
        ],
        "score": -13.67476834351237
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "c"
        ],
        "score": -13.686805343063686
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.689998640972105
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -13.734883181597079
      },
      {
        "glyphs": [
          "s",
          "s",
          "c"
        ],
        "score": -13.74931804569151
      },
      {
        "glyphs": [
          "s",
          "c",
          "c"
        ],
        "score": -13.758508874862716
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "S",
          "C"
        ],
        "score": -13.771620214563072
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.779102863487058
