{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 798,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 799,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 800,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 801,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 802,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 803,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 804,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -10.450197211296048
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -11.597359676621881
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2156284315863832
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2156284315863832
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.268417003139561
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.106975770958828
      },
      {
        "glyphs": [
          "."
        ],
        "score": -9.035811373011066
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -4.513117659072286
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -9.590693823478697
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -3.2558619345461537
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.414130509209345
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.873308161449444
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.547679725372891
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.335864710927284
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.039891234714494
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -6.754409569919924
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.605258532598359
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.563667702719822
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.0548173978470565
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -3.293049973735739
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -3.3902679729894896
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -16.71740659246049
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -14.835961289979341
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -12.68084687590176
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -16.134073259127156
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -12.292280870414395
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -17.21740659242053
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -15.767406592460489
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -7.698324362004479
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.2806566423987924
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.505013704574973
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -16.71740659242053
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -7.034707955760483
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -14.187164656093303
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -16.13316483774753
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -15.287716883904881
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -9.853846776645117
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -13.676373526812197
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -15.76740659246049
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -15.388438338440695
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -2.836911080928161
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -14.668920093287838
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -16.1340732590872
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -10.240142878474225
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -16.717342668948252
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -12.531218211476219
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -15.499549449554284
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -17.217406525852365
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.938164305296116
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -16.38332888120738
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -15.76740659246049
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -4.2348297863612725
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -9.894538976279595
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -16.383370094345374
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.320370673964085
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -9.914443645881516
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -16.3840732590872
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -16.3840732590872
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -16.717406592420534
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -6.986783168595977
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -15.934073259127157
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -13.125116719200058
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -11.089825048245066
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -16.71740659246049
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -18.142389962602905
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -15.934073259127157
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -16.384073259127156
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -16.134073259127156
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.21509142860773
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -14.651181493812501
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -16.134073259127156
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.21740659246049
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -15.498841004813084
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.21740659246049
      },
      {
        "glyphs": [
          "["
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -5.362623542770844
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -19.515007114153573
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.8369117668848016
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -5.690278584678772
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -7.803562517163764
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -17.21740653434282
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -8.890495758812355
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -15.624549449563387
      },
      {
        "glyphs": [
          "c",
          "c",
          "c"
        ],
        "score": -5.116742570524423
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -5.634371767509682
      },
      {
        "glyphs": [
          "o",
          "c"
        ],
        "score": -6.637462066134214
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -6.982058854306178
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.020247618907794
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.347875202293311
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.387119223023104
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.06130910090307
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.110186729876826
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -8.190706433479384
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.21099404133613
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.268046327311952
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.273838465074064
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.303950868908615
      },
      {
        "glyphs": [
          "C",
          "#",
          "C"
        ],
        "score": -8.34234655452233
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.531450810512764
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "c"
        ],
        "score": -8.57870488781361
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.610624069310928
      },
      {
        "glyphs": [
          "c",
          "o",
          "c"
        ],
        "score": -8.702728837977482
      },
      {
        "glyphs": [
          "c",
          "n",
          "c"
        ],
        "score": -8.724108341625007
      },
      {
        "glyphs": [
          "%",
          "1"
        ],
        "score": -9.067768052127409
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -9.154726116704849
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "n"
        ],
        "score": -9.200834806105016
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "o"
        ],
        "score": -9.222240634129502
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.226372197212257
      },
      {
        "glyphs": [
          "n",
          "n"
        ],
        "score": -9.443069160247667
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "s"
        ],
        "score": -9.505368342023074
      },
      {
        "glyphs": [
          "c",
          "s",
          "c"
        ],
        "score": -9.603876585283201
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -9.621397846851139
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -9.774205708405548
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "c"
        ],
        "score": -9.918555059460111
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.958181649548
      },
      {
        "glyphs": [
          "n",
          "c",
          "n"
        ],
        "score": -9.969565023784565
      },
      {
        "glyphs": [
          "n",
          "n",
          "c"
        ],
        "score": -9.975049597112598
      },
      {
        "glyphs": [
          "N",
          "S"
        ],
        "score": -10.005033665937638
      },
      {
        "glyphs": [
          "n",
          "o"
        ],
        "score": -10.018720656718774
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -10.099877678379233
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -10.30921284277979
      },
      {
        "glyphs": [
          "c",
          "c",
          "n"
        ],
        "score": -10.346877971283451
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -10.425575354989132
      },
      {
        "glyphs": [
          "C",
          "S",
          "S"
        ],
        "score": -10.478337770175212
      },
      {
        "glyphs": [
          "S",
          "S"
        ],
        "score": -10.558809539936881
      },
      {
        "glyphs": [
          "o",
          "c",
          "c",
          "c"
        ],
        "score": -10.711633549223258
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.752863072257384
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.812605367247698
      },
      {
        "glyphs": [
          "o",
          "n"
        ],
        "score": -10.834066503867657
      },
      {
        "glyphs": [
          "S",
          "S",
          "C"
        ],
        "score": -10.854468053128606
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.97229556607483
      },
      {
        "glyphs": [
          "c",
          "c",
          "s"
        ],
        "score": -10.987961312078081
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.002811568776602
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -11.048268254185219
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.078722682396052
      },
      {
        "glyphs": [
          "c",
          "n",
          "n"
        ],
        "score": -11.222265176158135
      },
      {
        "glyphs": [
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -11.311193191909831
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "c"
        ],
        "score": -11.373341367409758
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -11.405418950326455
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c"
        ],
        "score": -11.405698995131889
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.491193921264053
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.5039051512604
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -11.546638115169706
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.55151980430185
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.581380459193152
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -11.583856400727068
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.609135742322358
      },
      {
        "glyphs": [
          "o",
          "n",
          "c"
        ],
        "score": -11.644310717635049
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.653175842123982
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.674506216193354
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.69478220006021
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.721204528242628
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.834357512503164
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.917677808408644
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.94173726770056
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.96257049482707
      },
      {
        "glyphs": [
          "c",
          "c",
          "s",
          "c"
        ],
        "score": -12.019369768483362
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.042110366676335
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.055370107735921
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.080781839968576
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.230198492706954
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "n"
        ],
        "score": -12.232476511055484
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.264140413281226
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -12.560148496824922
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.565822637746377
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "o"
        ],
        "score": -12.598862767329855
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.644085658289196
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.659697714883109
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.690533912996479
      },
      {
        "glyphs": [
          "Fe",
          "+"
        ],
        "score": -12.695242348191586
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.71613086724776
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "N",
          "="
        ],
        "score": -12.752221565971677
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.762927868806777
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.770557130716337
      },
      {
        "glyphs": [
          "S",
          "S",
          "S"
        ],
        "score": -12.858160860050209
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "n"
        ],
        "score": -12.858911579975112
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.861859347416823
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.87953491294973
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.88243302934177
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.901823742553333
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.928121878372805
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.963721392607503
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.978090735873128
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.991397209057434
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.996927962366605
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "N"
        ],
        "score": -13.024216134965187
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -13.106100875921788
      },
      {
        "glyphs": [
          "S",
          "S",
          "S",
          "S"
        ],
        "score": -13.134959461078552
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -13.13737708397297
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "o"
        ],
        "score": -13.191889453511365
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.252356423387221
      },
      {
        "glyphs": [
          "s",
          "n",
          "n"
        ],
        "score": -13.275380609861212
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.284566070941967
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S"
        ],
        "score": -13.29179022792324
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.315564509345013
      },
      {
        "glyphs": [
          "c",
          "n",
          "n",
          "n"
        ],
        "score": -13.317054416522508
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -13.329156252067746
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.364888878991808
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -13.397668298684351
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -13.419402698059034
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -13.421818866616912
      },
      {
        "glyphs": [
          "Mg",
          "+"
        ],
        "score": -13.428473982392052
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.446878832247297
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.458694033162551
      },
      {
        "glyphs": [
          "o",
          "c",
          "n",
          "c"
        ],
        "score": -13.472031896202393
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.565999446420992
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.573670156033192
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -13.599557096154616
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -13.610376402786398
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.616958979616825
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.617457030625216
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -13.621880263861637
      },
      {
        "glyphs": [
          "s",
          "n",
          "c"
        ],
        "score": -13.658892925589154
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.698203071716852
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.701582909099923
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.713455201160627
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.71957426497444
      },
      {
        "glyphs": [
          "s",
          "s",
          "c"
        ],
        "score": -13.74240508791777
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.750295579869805
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -13.751311932161993
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.780661751155431
      },
      {
        "glyphs": [
          "n",
          "s",
          "c"
        ],
        "score": -13.787765615491123
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "S",
          "C"
        ],
        "score": -13.799695291574702
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.8044878155496
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.842051718260256
      },
      {
        "glyphs": [
          "o",
          "n",
          "c",
          "c"
        ],
        "score": -13.843964714687534
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "c"
        ],
        "score": -13.851375222368343
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.875797578289678
      },
      {
        "glyphs": [
          "n",
          "n",
          "s"
        ],
        "score": -13.879497895081379
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.879761564077658
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -13.895913187490494
      },
      {
        "glyphs": [
          "s",
          "c",
          "n"
        ],
        "score": -13.923080130589712
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -13.976504014539723
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.991896625931346
      },
      {
        "glyphs": [
          "S",
          "=",
          "C",
          "=",
          "N"
        ],
        "score": -13.995423491220343
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.005572255415867
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.035930776714462
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -14.083941064277287
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.097410487872352
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "n"
        ],
        "score": -14.146487873004922
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.148279057172669
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -14.16688270824044
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -14.180803815406065
      },
      {
        "glyphs": [
          "n",
          "c",
          "s"
        ],
        "score": -14.194872256469104
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.19762670626067
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -14.214145938865741
      },
      {
        "glyphs": [
          "Ni",
          "+"
        ],
        "score": -14.222500714640804
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -14.268603737074407
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
