{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1026,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1027,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1028,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1029,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1030,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1031,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        45,
        45
      ],
      [
        153,
        153
      ],
      [
        22,
        102
      ],
      [
        45,
        23
      ],
      [
        45,
        24
      ],
      [
        162,
        71
      ],
      [
        163,
        71
      ],
      [
        93,
        45
      ],
      [
        160,
        153
      ],
      [
        154,
        153
      ],
      [
        159,
        45
      ],
      [
        45,
        153
      ],
      [
        154,
        71
      ],
      [
        22,
        45
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        102,
        172
      ],
      [
        159,
        159
      ],
      [
        160,
        160
      ],
      [
        159,
        93
      ],
      [
        159,
        102
      ],
      [
        93,
        153
      ],
      [
        160,
        167
      ],
      [
        22,
        153
      ],
      [
        154,
        160
      ],
      [
        45,
        166
      ],
      [
        157,
        153
      ],
      [
        154,
        154
      ],
      [
        102,
        45
      ],
      [
        159,
        153
      ],
      [
        93,
        122
      ],
      [
        93,
        182
      ],
      [
        8,
        153
      ],
      [
        173,
        45
      ],
      [
        45,
        122
      ],
      [
        153,
        154
      ],
      [
        153,
        168
      ],
      [
        173,
        153
      ],
      [
        22,
        93
      ],
      [
        45,
        1
      ],
      [
        169,
        93
      ],
      [
        45,
        22
      ],
      [
        22,
        166
      ],
      [
        179,
        45
      ],
      [
        155,
        153
      ],
      [
        93,
        159
      ],
      [
        93,
        7
      ],
      [
        154,
        168
      ],
      [
        102,
        159
      ],
      [
        45,
        172
      ],
      [
        174,
        182
      ],
      [
        198,
        93
      ],
      [
        102,
        8
      ],
      [
        45,
        154
      ],
      [
        159,
        169
      ],
      [
        153,
        157
      ],
      [
        166,
        153
      ],
      [
        159,
        122
      ],
      [
        159,
        166
      ],
      [
        153,
        185
      ],
      [
        169,
        102
      ],
      [
        154,
        155
      ],
      [
        179,
        159
      ],
      [
        153,
        186
      ],
      [
        93,
        166
      ],
      [
        160,
        168
      ],
      [
        159,
        154
      ],
      [
        169,
        153
      ],
      [
        22,
        122
      ],
      [
        153,
        183
      ],
      [
        193,
        153
      ],
      [
        200,
        159
      ],
      [
        167,
        168
      ],
      [
        160,
        154
      ],
      [
        153,
        203
      ],
      [
        168,
        168
      ],
      [
        102,
        153
      ],
      [
        154,
        167
      ],
      [
        93,
        1
      ],
      [
        173,
        170
      ],
      [
        160,
        185
      ],
      [
        22,
        159
      ],
      [
        173,
        166
      ],
      [
        179,
        153
      ],
      [
        160,
        183
      ],
      [
        93,
        207
      ],
      [
        173,
        159
      ],
      [
        154,
        177
      ],
      [
        122,
        45
      ],
      [
        176,
        93
      ],
      [
        193,
        45
      ],
      [
        155,
        154
      ],
      [
        102,
        227
      ],
      [
        93,
        169
      ],
      [
        174,
        122
      ],
      [
        167,
        157
      ],
      [
        168,
        157
      ],
      [
        178,
        182
      ],
      [
        93,
        187
      ],
      [
        237,
        170
      ],
      [
        168,
        155
      ],
      [
        167,
        154
      ],
      [
        200,
        170
      ],
      [
        174,
        153
      ],
      [
        157,
        167
      ],
      [
        200,
        169
      ],
      [
        154,
        203
      ],
      [
        169,
        166
      ],
      [
        45,
        63
      ],
      [
        176,
        159
      ],
      [
        177,
        154
      ],
      [
        179,
        166
      ],
      [
        176,
        102
      ],
      [
        169,
        187
      ],
      [
        93,
        102
      ],
      [
        197,
        166
      ],
      [
        153,
        155
      ],
      [
        216,
        45
      ],
      [
        183,
        157
      ],
      [
        167,
        155
      ],
      [
        160,
        203
      ],
      [
        169,
        122
      ],
      [
        198,
        159
      ],
      [
        22,
        169
      ],
      [
        197,
        93
      ],
      [
        197,
        159
      ],
      [
        194,
        183
      ],
      [
        93,
        188
      ],
      [
        159,
        172
      ],
      [
        122,
        153
      ],
      [
        8,
        154
      ],
      [
        160,
        186
      ],
      [
        168,
        154
      ],
      [
        102,
        170
      ],
      [
        159,
        240
      ],
      [
        193,
        159
      ],
      [
        122,
        159
      ],
      [
        102,
        166
      ],
      [
        154,
        157
      ],
      [
        173,
        178
      ],
      [
        216,
        159
      ],
      [
        159,
        63
      ],
      [
        186,
        154
      ],
      [
        173,
        188
      ],
      [
        122,
        23
      ],
      [
        159,
        282
      ],
      [
        155,
        167
      ],
      [
        200,
        178
      ],
      [
        154,
        185
      ],
      [
        160,
        250
      ],
      [
        93,
        8
      ],
      [
        102,
        179
      ],
      [
        93,
        176
      ],
      [
        93,
        172
      ],
      [
        169,
        154
      ],
      [
        122,
        24
      ],
      [
        200,
        176
      ],
      [
        168,
        185
      ],
      [
        198,
        45
      ],
      [
        183,
        154
      ],
      [
        197,
        102
      ],
      [
        1,
        93
      ],
      [
        185,
        168
      ],
      [
        102,
        169
      ],
      [
        214,
        160
      ],
      [
        157,
        154
      ],
      [
        216,
        153
      ],
      [
        178,
        122
      ],
      [
        194,
        167
      ],
      [
        184,
        153
      ],
      [
        219,
        166
      ],
      [
        195,
        154
      ],
      [
        201,
        153
      ],
      [
        218,
        154
      ],
      [
        93,
        22
      ],
      [
        198,
        170
      ],
      [
        176,
        166
      ],
      [
        122,
        170
      ],
      [
        22,
        170
      ],
      [
        173,
        169
      ],
      [
        157,
        168
      ],
      [
        169,
        190
      ],
      [
        176,
        122
      ],
      [
        93,
        180
      ],
      [
        219,
        153
      ],
      [
        194,
        168
      ],
      [
        195,
        157
      ],
      [
        273,
        169
      ],
      [
        93,
        179
      ],
      [
        193,
        170
      ],
      [
        236,
        154
      ],
      [
        173,
        179
      ],
      [
        102,
        22
      ],
      [
        155,
        168
      ],
      [
        206,
        157
      ],
      [
        194,
        185
      ],
      [
        176,
        169
      ],
      [
        22,
        176
      ],
      [
        168,
        203
      ],
      [
        93,
        178
      ],
      [
        237,
        45
      ],
      [
        183,
        168
      ],
      [
        155,
        195
      ],
      [
        102,
        173
      ],
      [
        176,
        153
      ],
      [
        157,
        160
      ],
      [
        159,
        1
      ],
      [
        169,
        172
      ],
      [
        157,
        206
      ],
      [
        159,
        320
      ],
      [
        186,
        185
      ],
      [
        169,
        207
      ],
      [
        22,
        178
      ],
      [
        220,
        160
      ],
      [
        178,
        153
      ],
      [
        200,
        270
      ],
      [
        228,
        154
      ],
      [
        222,
        154
      ],
      [
        244,
        63
      ],
      [
        275,
        168
      ],
      [
        194,
        203
      ],
      [
        232,
        157
      ],
      [
        195,
        168
      ],
      [
        159,
        22
      ],
      [
        22,
        180
      ],
      [
        197,
        169
      ],
      [
        169,
        247
      ],
      [
        22,
        189
      ],
      [
        198,
        169
      ],
      [
        237,
        159
      ],
      [
        198,
        270
      ],
      [
        93,
        189
      ],
      [
        157,
        183
      ],
      [
        297,
        160
      ],
      [
        93,
        93
      ],
      [
        173,
        93
      ],
      [
        222,
        157
      ],
      [
        160,
        8
      ],
      [
        193,
        178
      ],
      [
        200,
        179
      ],
      [
        273,
        170
      ],
      [
        204,
        166
      ],
      [
        198,
        178
      ],
      [
        45,
        161
      ],
      [
        271,
        166
      ],
      [
        206,
        154
      ],
      [
        93,
        226
      ],
      [
        45,
        105
      ],
      [
        195,
        155
      ],
      [
        168,
        183
      ],
      [
        22,
        213
      ],
      [
        204,
        169
      ],
      [
        193,
        169
      ],
      [
        214,
        168
      ],
      [
        155,
        160
      ],
      [
        102,
        176
      ],
      [
        244,
        172
      ],
      [
        275,
        194
      ],
      [
        169,
        63
      ],
      [
        154,
        183
      ],
      [
        220,
        168
      ],
      [
        179,
        169
      ],
      [
        169,
        240
      ],
      [
        193,
        216
      ],
      [
        179,
        170
      ],
      [
        102,
        188
      ],
      [
        179,
        217
      ],
      [
        204,
        154
      ],
      [
        169,
        320
      ],
      [
        297,
        168
      ],
      [
        168,
        186
      ],
      [
        93,
        256
      ],
      [
        159,
        199
      ],
      [
        173,
        225
      ],
      [
        173,
        242
      ],
      [
        194,
        324
      ],
      [
        197,
        176
      ],
      [
        93,
        190
      ],
      [
        167,
        186
      ],
      [
        186,
        168
      ],
      [
        186,
        186
      ],
      [
        207,
        166
      ],
      [
        102,
        178
      ],
      [
        224,
        154
      ],
      [
        176,
        63
      ],
      [
        160,
        324
      ],
      [
        415,
        50
      ],
      [
        176,
        190
      ],
      [
        214,
        186
      ],
      [
        275,
        160
      ],
      [
        93,
        235
      ],
      [
        200,
        202
      ],
      [
        365,
        159
      ],
      [
        22,
        217
      ],
      [
        198,
        213
      ],
      [
        198,
        179
      ],
      [
        93,
        242
      ],
      [
        174,
        22
      ],
      [
        200,
        329
      ],
      [
        280,
        159
      ],
      [
        346,
        63
      ],
      [
        197,
        178
      ],
      [
        273,
        179
      ],
      [
        102,
        219
      ],
      [
        93,
        199
      ],
      [
        155,
        183
      ],
      [
        93,
        197
      ],
      [
        93,
        202
      ],
      [
        183,
        155
      ],
      [
        280,
        153
      ],
      [
        382,
        179
      ],
      [
        208,
        44
      ],
      [
        179,
        178
      ],
      [
        176,
        176
      ],
      [
        200,
        199
      ],
      [
        200,
        225
      ],
      [
        382,
        270
      ],
      [
        204,
        172
      ],
      [
        252,
        190
      ],
      [
        169,
        189
      ],
      [
        197,
        217
      ],
      [
        230,
        63
      ],
      [
        213,
        166
      ],
      [
        208,
        172
      ],
      [
        208,
        77
      ],
      [
        93,
        227
      ],
      [
        169,
        282
      ],
      [
        193,
        174
      ],
      [
        198,
        329
      ],
      [
        102,
        182
      ],
      [
        93,
        268
      ],
      [
        176,
        154
      ],
      [
        63,
        45
      ],
      [
        200,
        216
      ],
      [
        157,
        232
      ],
      [
        93,
        154
      ],
      [
        122,
        169
      ],
      [
        160,
        220
      ],
      [
        198,
        176
      ],
      [
        204,
        22
      ],
      [
        193,
        176
      ],
      [
        168,
        250
      ],
      [
        213,
        153
      ],
      [
        230,
        282
      ],
      [
        293,
        240
      ],
      [
        200,
        242
      ],
      [
        176,
        187
      ],
      [
        498,
        256
      ],
      [
        197,
        187
      ],
      [
        193,
        230
      ],
      [
        237,
        169
      ],
      [
        174,
        159
      ],
      [
        176,
        240
      ],
      [
        173,
        217
      ],
      [
        197,
        188
      ],
      [
        22,
        276
      ],
      [
        179,
        179
      ],
      [
        311,
        190
      ],
      [
        216,
        170
      ],
      [
        154,
        7
      ],
      [
        176,
        172
      ],
      [
        22,
        221
      ],
      [
        197,
        266
      ],
      [
        280,
        122
      ],
      [
        252,
        166
      ],
      [
        122,
        216
      ],
      [
        45,
        50
      ],
      [
        213,
        122
      ],
      [
        193,
        217
      ],
      [
        273,
        176
      ],
      [
        204,
        122
      ],
      [
        200,
        325
      ],
      [
        198,
        299
      ],
      [
        213,
        63
      ],
      [
        200,
        219
      ],
      [
        213,
        102
      ],
      [
        160,
        206
      ],
      [
        193,
        295
      ],
      [
        197,
        207
      ],
      [
        169,
        180
      ],
      [
        198,
        268
      ],
      [
        22,
        280
      ],
      [
        273,
        219
      ],
      [
        200,
        213
      ],
      [
        176,
        295
      ],
      [
        200,
        217
      ],
      [
        178,
        22
      ],
      [
        176,
        207
      ],
      [
        122,
        188
      ],
      [
        264,
        207
      ],
      [
        63,
        153
      ],
      [
        102,
        337
      ],
      [
        421,
        240
      ],
      [
        197,
        199
      ],
      [
        169,
        356
      ],
      [
        93,
        221
      ],
      [
        206,
        155
      ],
      [
        365,
        213
      ],
      [
        173,
        270
      ],
      [
        273,
        202
      ],
      [
        172,
        207
      ],
      [
        197,
        335
      ],
      [
        179,
        93
      ],
      [
        179,
        176
      ],
      [
        93,
        326
      ],
      [
        176,
        235
      ],
      [
        102,
        202
      ],
      [
        22,
        272
      ],
      [
        230,
        172
      ],
      [
        200,
        276
      ],
      [
        193,
        213
      ],
      [
        198,
        242
      ],
      [
        204,
        1
      ],
      [
        366,
        102
      ],
      [
        179,
        256
      ],
      [
        50,
        153
      ],
      [
        347,
        266
      ],
      [
        179,
        230
      ],
      [
        284,
        452
      ],
      [
        273,
        443
      ],
      [
        122,
        178
      ],
      [
        347,
        256
      ],
      [
        173,
        202
      ],
      [
        252,
        154
      ],
      [
        394,
        240
      ],
      [
        176,
        217
      ],
      [
        173,
        216
      ],
      [
        200,
        403
      ],
      [
        252,
        187
      ],
      [
        159,
        337
      ],
      [
        122,
        179
      ],
      [
        311,
        169
      ],
      [
        173,
        176
      ],
      [
        237,
        188
      ],
      [
        347,
        340
      ],
      [
        347,
        178
      ],
      [
        176,
        320
      ],
      [
        264,
        122
      ],
      [
        213,
        296
      ],
      [
        173,
        213
      ],
      [
        166,
        161
      ],
      [
        219,
        169
      ],
      [
        22,
        268
      ],
      [
        204,
        295
      ],
      [
        22,
        219
      ],
      [
        172,
        322
      ],
      [
        207,
        122
      ],
      [
        179,
        216
      ],
      [
        179,
        270
      ],
      [
        102,
        266
      ],
      [
        173,
        221
      ],
      [
        192,
        154
      ],
      [
        198,
        403
      ],
      [
        311,
        256
      ],
      [
        176,
        213
      ],
      [
        22,
        271
      ],
      [
        198,
        355
      ],
      [
        245,
        240
      ],
      [
        176,
        256
      ],
      [
        208,
        122
      ],
      [
        341,
        169
      ],
      [
        200,
        226
      ],
      [
        358,
        153
      ],
      [
        159,
        371
      ],
      [
        159,
        50
      ],
      [
        315,
        122
      ],
      [
        197,
        425
      ],
      [
        208,
        282
      ],
      [
        45,
        283
      ],
      [
        102,
        122
      ],
      [
        219,
        176
      ],
      [
        186,
        167
      ],
      [
        193,
        179
      ],
      [
        398,
        176
      ],
      [
        159,
        356
      ],
      [
        230,
        240
      ],
      [
        198,
        199
      ],
      [
        255,
        154
      ],
      [
        208,
        154
      ],
      [
        22,
        216
      ],
      [
        200,
        188
      ],
      [
        370,
        166
      ],
      [
        207,
        63
      ],
      [
        198,
        420
      ],
      [
        365,
        45
      ],
      [
        193,
        188
      ],
      [
        93,
        161
      ],
      [
        200,
        299
      ],
      [
        198,
        217
      ],
      [
        311,
        176
      ],
      [
        634,
        172
      ],
      [
        173,
        329
      ],
      [
        193,
        270
      ],
      [
        291,
        157
      ],
      [
        173,
        180
      ],
      [
        282,
        207
      ],
      [
        22,
        270
      ],
      [
        435,
        217
      ],
      [
        197,
        640
      ],
      [
        173,
        266
      ],
      [
        172,
        310
      ],
      [
        45,
        44
      ],
      [
        252,
        440
      ],
      [
        198,
        225
      ],
      [
        311,
        153
      ],
      [
        122,
        176
      ],
      [
        198,
        280
      ],
      [
        102,
        270
      ],
      [
        200,
        256
      ],
      [
        198,
        341
      ],
      [
        197,
        471
      ],
      [
        93,
        219
      ],
      [
        1,
        159
      ],
      [
        176,
        266
      ],
      [
        159,
        215
      ],
      [
        207,
        169
      ],
      [
        44,
        153
      ],
      [
        199,
        22
      ],
      [
        153,
        8
      ],
      [
        176,
        179
      ],
      [
        45,
        77
      ],
      [
        122,
        280
      ],
      [
        311,
        166
      ],
      [
        204,
        288
      ],
      [
        176,
        178
      ],
      [
        174,
        179
      ],
      [
        93,
        312
      ],
      [
        93,
        343
      ],
      [
        102,
        93
      ],
      [
        198,
        202
      ],
      [
        22,
        199
      ],
      [
        179,
        268
      ],
      [
        252,
        122
      ],
      [
        213,
        154
      ],
      [
        213,
        187
      ],
      [
        204,
        247
      ],
      [
        179,
        202
      ],
      [
        193,
        355
      ],
      [
        179,
        420
      ],
      [
        176,
        189
      ],
      [
        102,
        312
      ],
      [
        236,
        8
      ],
      [
        295,
        320
      ],
      [
        200,
        221
      ],
      [
        179,
        280
      ],
      [
        365,
        216
      ],
      [
        159,
        105
      ],
      [
        173,
        280
      ],
      [
        208,
        356
      ],
      [
        173,
        313
      ],
      [
        219,
        170
      ],
      [
        102,
        189
      ],
      [
        350,
        169
      ],
      [
        173,
        199
      ],
      [
        173,
        341
      ],
      [
        252,
        207
      ],
      [
        273,
        221
      ],
      [
        173,
        189
      ],
      [
        347,
        169
      ],
      [
        176,
        180
      ],
      [
        213,
        320
      ],
      [
        173,
        343
      ],
      [
        315,
        216
      ],
      [
        435,
        178
      ],
      [
        365,
        176
      ],
      [
        102,
        221
      ],
      [
        102,
        326
      ],
      [
        173,
        256
      ],
      [
        338,
        207
      ],
      [
        264,
        154
      ],
      [
        174,
        227
      ],
      [
        179,
        199
      ],
      [
        244,
        240
      ],
      [
        175,
        93
      ],
      [
        22,
        179
      ],
      [
        93,
        201
      ],
      [
        216,
        169
      ],
      [
        102,
        226
      ],
      [
        102,
        268
      ],
      [
        45,
        507
      ],
      [
        252,
        180
      ],
      [
        204,
        336
      ],
      [
        22,
        266
      ],
      [
        173,
        600
      ],
      [
        208,
        50
      ],
      [
        45,
        319
      ],
      [
        198,
        221
      ],
      [
        244,
        169
      ],
      [
        207,
        154
      ],
      [
        571,
        170
      ],
      [
        122,
        217
      ],
      [
        172,
        44
      ],
      [
        179,
        242
      ],
      [
        179,
        266
      ],
      [
        208,
        288
      ],
      [
        176,
        268
      ],
      [
        237,
        199
      ],
      [
        310,
        169
      ],
      [
        454,
        270
      ],
      [
        122,
        199
      ],
      [
        216,
        174
      ],
      [
        245,
        63
      ],
      [
        176,
        247
      ],
      [
        216,
        217
      ],
      [
        322,
        190
      ],
      [
        176,
        363
      ],
      [
        350,
        216
      ],
      [
        204,
        63
      ],
      [
        515,
        176
      ],
      [
        200,
        268
      ],
      [
        176,
        341
      ],
      [
        193,
        122
      ],
      [
        382,
        217
      ],
      [
        273,
        272
      ],
      [
        548,
        169
      ],
      [
        102,
        283
      ],
      [
        197,
        226
      ],
      [
        350,
        170
      ],
      [
        102,
        242
      ],
      [
        333,
        170
      ],
      [
        172,
        50
      ],
      [
        173,
        312
      ],
      [
        322,
        207
      ],
      [
        311,
        154
      ],
      [
        22,
        202
      ],
      [
        200,
        248
      ],
      [
        224,
        8
      ],
      [
        122,
        287
      ],
      [
        252,
        189
      ],
      [
        172,
        122
      ],
      [
        193,
        247
      ],
      [
        207,
        320
      ],
      [
        273,
        545
      ],
      [
        193,
        199
      ],
      [
        206,
        168
      ],
      [
        169,
        1
      ],
      [
        197,
        272
      ],
      [
        571,
        159
      ],
      [
        609,
        240
      ],
      [
        715,
        63
      ],
      [
        208,
        336
      ],
      [
        179,
        329
      ],
      [
        173,
        272
      ],
      [
        102,
        180
      ],
      [
        173,
        173
      ],
      [
        571,
        217
      ],
      [
        347,
        170
      ],
      [
        237,
        213
      ],
      [
        204,
        337
      ],
      [
        208,
        247
      ],
      [
        174,
        178
      ],
      [
        208,
        666
      ],
      [
        282,
        247
      ],
      [
        476,
        50
      ],
      [
        244,
        320
      ],
      [
        213,
        207
      ],
      [
        237,
        341
      ],
      [
        174,
        172
      ],
      [
        173,
        299
      ],
      [
        178,
        159
      ],
      [
        411,
        320
      ],
      [
        453,
        296
      ],
      [
        193,
        266
      ],
      [
        195,
        8
      ],
      [
        347,
        221
      ],
      [
        102,
        192
      ],
      [
        204,
        240
      ],
      [
        176,
        225
      ],
      [
        197,
        216
      ],
      [
        252,
        63
      ],
      [
        237,
        176
      ],
      [
        237,
        242
      ],
      [
        280,
        170
      ],
      [
        198,
        266
      ],
      [
        298,
        122
      ],
      [
        169,
        50
      ],
      [
        280,
        169
      ],
      [
        365,
        178
      ],
      [
        365,
        170
      ],
      [
        102,
        199
      ],
      [
        179,
        105
      ],
      [
        252,
        288
      ],
      [
        102,
        355
      ],
      [
        169,
        671
      ],
      [
        1,
        170
      ],
      [
        172,
        240
      ],
      [
        176,
        288
      ],
      [
        273,
        242
      ],
      [
        179,
        340
      ],
      [
        311,
        217
      ],
      [
        173,
        192
      ],
      [
        221,
        154
      ],
      [
        197,
        242
      ],
      [
        197,
        225
      ],
      [
        193,
        276
      ],
      [
        306,
        122
      ],
      [
        252,
        247
      ],
      [
        173,
        196
      ],
      [
        198,
        219
      ],
      [
        207,
        288
      ],
      [
        197,
        270
      ],
      [
        237,
        270
      ],
      [
        310,
        217
      ],
      [
        102,
        280
      ],
      [
        237,
        225
      ],
      [
        311,
        180
      ],
      [
        350,
        270
      ],
      [
        237,
        178
      ],
      [
        237,
        280
      ],
      [
        105,
        24
      ],
      [
        176,
        50
      ],
      [
        213,
        235
      ],
      [
        102,
        256
      ],
      [
        179,
        173
      ],
      [
        371,
        153
      ],
      [
        22,
        326
      ],
      [
        198,
        335
      ],
      [
        410,
        63
      ],
      [
        122,
        226
      ],
      [
        197,
        202
      ],
      [
        338,
        63
      ],
      [
        176,
        216
      ],
      [
        350,
        217
      ],
      [
        311,
        63
      ],
      [
        268,
        320
      ],
      [
        105,
        23
      ],
      [
        173,
        190
      ],
      [
        174,
        188
      ],
      [
        273,
        178
      ],
      [
        122,
        225
      ],
      [
        173,
        241
      ],
      [
        346,
        207
      ],
      [
        476,
        44
      ],
      [
        176,
        355
      ],
      [
        346,
        320
      ],
      [
        193,
        326
      ],
      [
        184,
        161
      ],
      [
        208,
        371
      ],
      [
        122,
        202
      ],
      [
        193,
        268
      ],
      [
        179,
        221
      ],
      [
        173,
        325
      ],
      [
        315,
        166
      ],
      [
        346,
        172
      ],
      [
        22,
        561
      ],
      [
        102,
        272
      ],
      [
        93,
        248
      ],
      [
        216,
        178
      ],
      [
        204,
        266
      ],
      [
        93,
        271
      ],
      [
        179,
        180
      ],
      [
        453,
        166
      ],
      [
        472,
        207
      ],
      [
        197,
        213
      ],
      [
        174,
        169
      ],
      [
        176,
        202
      ],
      [
        264,
        166
      ],
      [
        173,
        219
      ],
      [
        204,
        873
      ],
      [
        77,
        153
      ],
      [
        252,
        172
      ],
      [
        216,
        266
      ],
      [
        322,
        189
      ],
      [
        213,
        189
      ],
      [
        366,
        44
      ],
      [
        198,
        370
      ],
      [
        311,
        235
      ],
      [
        365,
        266
      ],
      [
        244,
        247
      ],
      [
        172,
        235
      ],
      [
        102,
        154
      ],
      [
        193,
        280
      ],
      [
        554,
        63
      ],
      [
        245,
        337
      ],
      [
        169,
        452
      ],
      [
        187,
        63
      ],
      [
        252,
        750
      ],
      [
        237,
        268
      ],
      [
        492,
        217
      ],
      [
        176,
        280
      ],
      [
        315,
        153
      ],
      [
        173,
        778
      ],
      [
        294,
        320
      ],
      [
        169,
        337
      ],
      [
        176,
        440
      ],
      [
        365,
        217
      ],
      [
        176,
        452
      ],
      [
        175,
        180
      ],
      [
        230,
        199
      ],
      [
        197,
        292
      ],
      [
        176,
        373
      ],
      [
        198,
        325
      ],
      [
        365,
        169
      ],
      [
        193,
        249
      ],
      [
        221,
        63
      ],
      [
        382,
        335
      ],
      [
        193,
        202
      ],
      [
        198,
        762
      ],
      [
        298,
        153
      ],
      [
        102,
        335
      ],
      [
        315,
        217
      ],
      [
        322,
        63
      ],
      [
        208,
        452
      ],
      [
        176,
        199
      ],
      [
        315,
        271
      ],
      [
        596,
        217
      ],
      [
        193,
        335
      ],
      [
        199,
        172
      ],
      [
        208,
        240
      ],
      [
        173,
        226
      ],
      [
        173,
        335
      ],
      [
        315,
        169
      ],
      [
        414,
        176
      ],
      [
        193,
        242
      ],
      [
        237,
        458
      ],
      [
        237,
        226
      ],
      [
        248,
        22
      ],
      [
        198,
        216
      ],
      [
        472,
        270
      ],
      [
        176,
        335
      ],
      [
        122,
        268
      ],
      [
        173,
        248
      ],
      [
        197,
        179
      ],
      [
        45,
        274
      ],
      [
        174,
        216
      ],
      [
        193,
        221
      ],
      [
        273,
        268
      ],
      [
        172,
        166
      ],
      [
        293,
        452
      ],
      [
        173,
        517
      ],
      [
        311,
        187
      ],
      [
        287,
        50
      ],
      [
        193,
        226
      ],
      [
        200,
        481
      ],
      [
        207,
        172
      ],
      [
        350,
        221
      ],
      [
        398,
        266
      ],
      [
        22,
        188
      ],
      [
        273,
        188
      ],
      [
        176,
        242
      ],
      [
        179,
        219
      ],
      [
        264,
        440
      ],
      [
        198,
        600
      ],
      [
        230,
        741
      ],
      [
        347,
        217
      ],
      [
        237,
        355
      ],
      [
        93,
        600
      ],
      [
        311,
        268
      ],
      [
        160,
        157
      ],
      [
        216,
        122
      ],
      [
        198,
        343
      ],
      [
        213,
        288
      ],
      [
        489,
        63
      ],
      [
        237,
        329
      ],
      [
        122,
        213
      ],
      [
        176,
        671
      ],
      [
        204,
        219
      ],
      [
        22,
        325
      ],
      [
        179,
        335
      ],
      [
        197,
        326
      ],
      [
        166,
        197
      ],
      [
        252,
        320
      ],
      [
        93,
        778
      ],
      [
        197,
        268
      ],
      [
        219,
        266
      ],
      [
        179,
        326
      ],
      [
        122,
        242
      ]
    ]
  }
}