{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 468,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 469,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 470,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 471,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 472,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 473,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 474,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -7.072557186786058
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.1534767124205665
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.1534767124205665
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.22815227592254
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.1393021891323905
      },
      {
        "glyphs": [
          "."
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -8.103095760533884
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.7075638872625767
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.3281556513817314
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -4.595026301676967
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -6.670182687709772
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -9.755332252058674
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -13.442716958429775
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -15.749627976230027
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "="
        ],
        "score": -2.9454025017909267
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -4.194730413800613
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -4.227181657650055
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -5.872091315720088
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.4983482722780366
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.343010843843302
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.332180687473462
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -3.4202166216663237
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.893789239953438
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.234830602343145
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.613088937278775
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -9.89861320103548
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.08920402433896
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -11.08055706511678
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "["
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -9.005704305926868
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.0640367890643923
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.485637214259878
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -5.675389674752866
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.024904248457528
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -20.181920521175066
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -6.08249153353756
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -8.129748530204273
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.363646228771046
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -8.637453743433706
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.47605393032146
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.381823371150631
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -10.499870340014265
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.723014339900761
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.823699038631146
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.94596905171566
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.01199635473603
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.022026332933805
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -11.217436332037366
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.22090284395886
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -11.310108690699291
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.338083979676535
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.339475971287218
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.562265742697438
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.56449306593055
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.58544527163346
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -11.598679915486262
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.607128220599542
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -11.631164885805656
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.649085522842181
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.872700427638225
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.877660483146382
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.887850526739168
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -11.914600698628863
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -11.918497188588109
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C"
        ],
        "score": -11.998541452043352
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.015431197143368
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.046705035923008
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.085932460917427
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.098615572228447
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.099468379605923
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.102296736701739
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.16151117093619
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.176791152441943
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.206077499961749
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.231702287730997
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.276868679041929
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.28197454301846
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.29707538823083
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.298521005782156
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -12.301613694278005
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.301769648485227
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.319820871673986
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.327843885553692
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.330394314728299
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.364512269419212
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.415924815838228
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.441748133878058
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.448159778713261
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C"
        ],
        "score": -12.458820159974778
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.502355008280126
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.533410775249543
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -12.546777579479636
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.600663990068458
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.61143829384096
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.658703803992932
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.66841704824277
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.6730219662272
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.77277873236142
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.780729923373148
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "#"
        ],
        "score": -12.80515960939142
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.812150055781773
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.812957880524827
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -12.816077920982181
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.836673772393326
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.859910738742217
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.865283431704206
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -12.865454385154958
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.908216834586119
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.00573035238357
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.016627724641694
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -13.050527529763137
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -13.068409695772033
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.07189249038851
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.088463420419348
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -13.110988022573553
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.113496196501542
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -13.117832561763684
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.17471832201836
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.186869752328189
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.199294340423346
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -13.22411741650135
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.294409984654923
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.303278727636084
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -13.355098441489346
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.372622585585525
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.421218984556717
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "#"
        ],
        "score": -13.463900922413064
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.466212281700432
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.492387635158483
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -13.504633678776955
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.508590294303996
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.540716505868971
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.558290661509155
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.647029734251205
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -13.701709779458003
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -13.72181154681454
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.732559934528446
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.764509093212272
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.786376756631775
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.83312656271131
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -13.935857759205746
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.940518222055285
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.97076254188094
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -13.9801491675662
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.021535723402225
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -14.026286452607842
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -14.028998131309727
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.085731044641996
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.11808478731232
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -14.122713140816352
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.157754258072714
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -14.160103710417122
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.164315342960442
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.171835164446811
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.184921231401136
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.191427296154956
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -14.204646332470144
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -14.265732052188742
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.2864699319859
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.299581770032578
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.30921783376252
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.312802592351696
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.314915455993871
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.35675624297966
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.414290562748853
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.424467118988353
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.428020160704339
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.43909712201588
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.448332259447488
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -14.454842541307046
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.471165939494421
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.471555555216685
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.478722650384864
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.5130592935726
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.543365394942189
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -14.57381235236755
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -14.586942562776969
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -14.61225846522264
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.686657971018022
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.71507522164666
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -14.720352962502458
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.777472326406176
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.78531121324129
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.792936514030576
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -14.80764451125588
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.820352698431407
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.842941627159815
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.845925626716415
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.849490730860786
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.87516253986875
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -14.878670940461577
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -14.883805180421657
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -14.90506050409982
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.911113780445426
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.922793652174956
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.986871852539045
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -15.01243854574132
      },
      {
