{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        153,
        153
      ],
      [
        45,
        45
      ],
      [
        22,
        102
      ],
      [
        159,
        153
      ],
      [
        71,
        150
      ],
      [
        148,
        45
      ],
      [
        159,
        162
      ],
      [
        160,
        160
      ],
      [
        102,
        45
      ],
      [
        93,
        45
      ],
      [
        22,
        45
      ],
      [
        154,
        153
      ],
      [
        160,
        45
      ],
      [
        8,
        153
      ],
      [
        45,
        153
      ],
      [
        164,
        23
      ],
      [
        164,
        24
      ],
      [
        174,
        163
      ],
      [
        175,
        163
      ],
      [
        159,
        159
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        160,
        93
      ],
      [
        93,
        153
      ],
      [
        45,
        169
      ],
      [
        102,
        160
      ],
      [
        179,
        153
      ],
      [
        148,
        154
      ],
      [
        8,
        150
      ],
      [
        102,
        169
      ],
      [
        186,
        163
      ],
      [
        102,
        153
      ],
      [
        7,
        150
      ],
      [
        166,
        166
      ],
      [
        153,
        154
      ],
      [
        45,
        167
      ],
      [
        148,
        93
      ],
      [
        148,
        102
      ],
      [
        160,
        153
      ],
      [
        166,
        45
      ],
      [
        196,
        187
      ],
      [
        195,
        191
      ],
      [
        154,
        159
      ],
      [
        45,
        1
      ],
      [
        157,
        153
      ],
      [
        22,
        160
      ],
      [
        45,
        168
      ],
      [
        93,
        160
      ],
      [
        154,
        154
      ],
      [
        171,
        93
      ],
      [
        153,
        170
      ],
      [
        155,
        153
      ],
      [
        160,
        167
      ],
      [
        168,
        153
      ],
      [
        45,
        122
      ],
      [
        22,
        93
      ],
      [
        202,
        93
      ],
      [
        148,
        13
      ],
      [
        216,
        163
      ],
      [
        167,
        153
      ],
      [
        174,
        150
      ],
      [
        160,
        184
      ],
      [
        22,
        122
      ],
      [
        175,
        150
      ],
      [
        160,
        168
      ],
      [
        45,
        154
      ],
      [
        8,
        154
      ],
      [
        154,
        170
      ],
      [
        45,
        204
      ],
      [
        93,
        169
      ],
      [
        148,
        127
      ],
      [
        160,
        102
      ],
      [
        160,
        190
      ],
      [
        229,
        150
      ],
      [
        162,
        170
      ],
      [
        159,
        170
      ],
      [
        122,
        45
      ],
      [
        166,
        160
      ],
      [
        159,
        154
      ],
      [
        93,
        122
      ],
      [
        178,
        154
      ],
      [
        122,
        153
      ],
      [
        45,
        22
      ],
      [
        171,
        153
      ],
      [
        193,
        154
      ],
      [
        171,
        168
      ],
      [
        93,
        1
      ],
      [
        162,
        157
      ],
      [
        170,
        170
      ],
      [
        213,
        153
      ],
      [
        192,
        192
      ],
      [
        171,
        102
      ],
      [
        180,
        153
      ],
      [
        166,
        93
      ],
      [
        181,
        160
      ],
      [
        159,
        201
      ],
      [
        160,
        154
      ],
      [
        160,
        122
      ],
      [
        153,
        203
      ],
      [
        102,
        22
      ],
      [
        22,
        168
      ],
      [
        162,
        155
      ],
      [
        154,
        162
      ],
      [
        148,
        153
      ],
      [
        184,
        184
      ],
      [
        45,
        161
      ],
      [
        153,
        157
      ],
      [
        166,
        171
      ],
      [
        93,
        171
      ],
      [
        154,
        155
      ],
      [
        154,
        210
      ],
      [
        170,
        154
      ],
      [
        184,
        102
      ],
      [
        93,
        197
      ],
      [
        186,
        191
      ],
      [
        160,
        1
      ],
      [
        179,
        160
      ],
      [
        193,
        159
      ],
      [
        3,
        12
      ],
      [
        154,
        178
      ],
      [
        45,
        214
      ],
      [
        13,
        150
      ],
      [
        245,
        173
      ],
      [
        262,
        187
      ],
      [
        122,
        160
      ],
      [
        180,
        169
      ],
      [
        195,
        71
      ],
      [
        167,
        102
      ],
      [
        164,
        71
      ],
      [
        22,
        182
      ],
      [
        179,
        105
      ],
      [
        102,
        171
      ],
      [
        102,
        221
      ],
      [
        160,
        169
      ],
      [
        93,
        93
      ],
      [
        148,
        38
      ],
      [
        159,
        203
      ],
      [
        183,
        153
      ],
      [
        164,
        187
      ],
      [
        180,
        160
      ],
      [
        22,
        171
      ],
      [
        93,
        181
      ],
      [
        169,
        153
      ],
      [
        148,
        71
      ],
      [
        162,
        154
      ],
      [
        102,
        181
      ],
      [
        102,
        105
      ],
      [
        294,
        150
      ],
      [
        148,
        50
      ],
      [
        45,
        50
      ],
      [
        171,
        190
      ],
      [
        148,
        94
      ],
      [
        102,
        166
      ],
      [
        202,
        173
      ],
      [
        258,
        153
      ],
      [
        181,
        153
      ],
      [
        213,
        45
      ],
      [
        63,
        153
      ],
      [
        285,
        191
      ],
      [
        310,
        191
      ],
      [
        195,
        187
      ],
      [
        7,
        280
      ],
      [
        192,
        45
      ],
      [
        194,
        153
      ],
      [
        93,
        168
      ],
      [
        192,
        166
      ],
      [
        205,
        153
      ],
      [
        201,
        154
      ],
      [
        22,
        206
      ],
      [
        122,
        173
      ],
      [
        166,
        102
      ],
      [
        179,
        181
      ],
      [
        171,
        154
      ],
      [
        93,
        166
      ],
      [
        157,
        162
      ],
      [
        22,
        212
      ],
      [
        14,
        150
      ],
      [
        171,
        167
      ],
      [
        102,
        122
      ],
      [
        155,
        154
      ],
      [
        192,
        160
      ],
      [
        50,
        153
      ],
      [
        302,
        163
      ],
      [
        93,
        22
      ],
      [
        274,
        274
      ],
      [
        171,
        122
      ],
      [
        277,
        11
      ],
      [
        63,
        45
      ],
      [
        166,
        153
      ],
      [
        1,
        93
      ],
      [
        148,
        122
      ],
      [
        93,
        288
      ],
      [
        307,
        187
      ],
      [
        166,
        168
      ],
      [
        45,
        44
      ],
      [
        148,
        105
      ],
      [
        193,
        162
      ],
      [
        201,
        157
      ],
      [
        192,
        171
      ],
      [
        180,
        122
      ],
      [
        160,
        235
      ],
      [
        241,
        181
      ],
      [
        228,
        153
      ],
      [
        202,
        160
      ],
      [
        209,
        154
      ],
      [
        241,
        171
      ],
      [
        153,
        210
      ],
      [
        159,
        210
      ],
      [
        261,
        154
      ],
      [
        207,
        154
      ],
      [
        93,
        208
      ],
      [
        214,
        93
      ],
      [
        184,
        167
      ],
      [
        204,
        169
      ],
      [
        263,
        263
      ],
      [
        274,
        93
      ],
      [
        93,
        102
      ],
      [
        159,
        207
      ],
      [
        208,
        169
      ],
      [
        102,
        102
      ],
      [
        148,
        144
      ],
      [
        213,
        160
      ],
      [
        379,
        150
      ],
      [
        148,
        79
      ],
      [
        171,
        182
      ],
      [
        102,
        93
      ],
      [
        245,
        160
      ],
      [
        214,
        102
      ],
      [
        207,
        207
      ],
      [
        166,
        190
      ],
      [
        192,
        198
      ],
      [
        45,
        63
      ],
      [
        102,
        38
      ],
      [
        164,
        163
      ],
      [
        382,
        150
      ],
      [
        148,
        80
      ],
      [
        166,
        180
      ],
      [
        193,
        237
      ],
      [
        201,
        170
      ],
      [
        206,
        168
      ],
      [
        302,
        187
      ],
      [
        202,
        45
      ],
      [
        307,
        150
      ],
      [
        71,
        187
      ],
      [
        22,
        166
      ],
      [
        179,
        171
      ],
      [
        148,
        112
      ],
      [
        160,
        240
      ],
      [
        13,
        191
      ],
      [
        169,
        93
      ],
      [
        277,
        12
      ],
      [
        166,
        167
      ],
      [
        193,
        170
      ],
      [
        44,
        153
      ],
      [
        192,
        236
      ],
      [
        354,
        191
      ],
      [
        184,
        153
      ],
      [
        287,
        280
      ],
      [
        188,
        153
      ],
      [
        256,
        160
      ],
      [
        160,
        204
      ],
      [
        13,
        187
      ],
      [
        160,
        212
      ],
      [
        184,
        168
      ],
      [
        394,
        191
      ],
      [
        192,
        266
      ],
      [
        342,
        153
      ],
      [
        22,
        153
      ],
      [
        171,
        169
      ],
      [
        14,
        187
      ],
      [
        167,
        167
      ],
      [
        102,
        250
      ],
      [
        285,
        407
      ],
      [
        170,
        207
      ],
      [
        7,
        335
      ],
      [
        196,
        150
      ],
      [
        287,
        428
      ],
      [
        71,
        191
      ],
      [
        184,
        190
      ],
      [
        160,
        50
      ],
      [
        287,
        187
      ],
      [
        258,
        105
      ],
      [
        204,
        204
      ],
      [
        287,
        420
      ],
      [
        343,
        343
      ],
      [
        249,
        160
      ],
      [
        45,
        105
      ],
      [
        102,
        208
      ],
      [
        227,
        204
      ],
      [
        183,
        93
      ],
      [
        155,
        162
      ],
      [
        148,
        77
      ],
      [
        179,
        220
      ],
      [
        206,
        102
      ],
      [
        249,
        45
      ],
      [
        180,
        181
      ],
      [
        209,
        170
      ],
      [
        229,
        71
      ],
      [
        241,
        182
      ],
      [
        207,
        170
      ],
      [
        154,
        157
      ],
      [
        287,
        335
      ],
      [
        181,
        122
      ],
      [
        148,
        44
      ],
      [
        93,
        242
      ],
      [
        230,
        105
      ],
      [
        180,
        171
      ],
      [
        157,
        159
      ],
      [
        221,
        221
      ],
      [
        153,
        155
      ],
      [
        349,
        191
      ],
      [
        206,
        190
      ],
      [
        193,
        207
      ],
      [
        227,
        169
      ],
      [
        227,
        154
      ],
      [
        164,
        150
      ],
      [
        153,
        8
      ],
      [
        170,
        203
      ],
      [
        262,
        150
      ],
      [
        171,
        206
      ],
      [
        171,
        348
      ],
      [
        213,
        173
      ],
      [
        166,
        154
      ],
      [
        241,
        166
      ],
      [
        241,
        153
      ],
      [
        148,
        83
      ],
      [
        227,
        167
      ],
      [
        226,
        154
      ],
      [
        22,
        198
      ],
      [
        148,
        12
      ],
      [
        1,
        173
      ],
      [
        245,
        45
      ],
      [
        202,
        181
      ],
      [
        241,
        168
      ],
      [
        262,
        402
      ],
      [
        462,
        187
      ],
      [
        179,
        223
      ],
      [
        154,
        203
      ],
      [
        484,
        191
      ],
      [
        166,
        122
      ],
      [
        277,
        13
      ],
      [
        227,
        190
      ],
      [
        166,
        173
      ],
      [
        155,
        170
      ],
      [
        93,
        361
      ],
      [
        168,
        161
      ],
      [
        179,
        230
      ],
      [
        181,
        169
      ],
      [
        198,
        168
      ],
      [
        169,
        169
      ],
      [
        93,
        182
      ],
      [
        179,
        122
      ],
      [
        206,
        154
      ],
      [
        14,
        191
      ],
      [
        148,
        129
      ]
    ]
  }
}