{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        45,
        45
      ],
      [
        153,
        153
      ],
      [
        45,
        23
      ],
      [
        45,
        24
      ],
      [
        161,
        71
      ],
      [
        22,
        102
      ],
      [
        162,
        71
      ],
      [
        159,
        159
      ],
      [
        102,
        45
      ],
      [
        22,
        45
      ],
      [
        160,
        153
      ],
      [
        45,
        168
      ],
      [
        45,
        102
      ],
      [
        166,
        166
      ],
      [
        159,
        45
      ],
      [
        93,
        45
      ],
      [
        160,
        169
      ],
      [
        45,
        167
      ],
      [
        45,
        153
      ],
      [
        171,
        153
      ],
      [
        22,
        159
      ],
      [
        155,
        153
      ],
      [
        166,
        45
      ],
      [
        8,
        153
      ],
      [
        154,
        153
      ],
      [
        45,
        93
      ],
      [
        172,
        172
      ],
      [
        102,
        153
      ],
      [
        160,
        160
      ],
      [
        154,
        71
      ],
      [
        102,
        159
      ],
      [
        102,
        168
      ],
      [
        159,
        93
      ],
      [
        159,
        153
      ],
      [
        166,
        159
      ],
      [
        93,
        153
      ],
      [
        166,
        173
      ],
      [
        159,
        168
      ],
      [
        22,
        93
      ],
      [
        22,
        173
      ],
      [
        93,
        168
      ],
      [
        45,
        179
      ],
      [
        45,
        174
      ],
      [
        102,
        8
      ],
      [
        93,
        7
      ],
      [
        172,
        45
      ],
      [
        173,
        93
      ],
      [
        167,
        102
      ],
      [
        45,
        164
      ],
      [
        45,
        1
      ],
      [
        45,
        122
      ],
      [
        172,
        181
      ],
      [
        172,
        173
      ],
      [
        159,
        102
      ],
      [
        171,
        105
      ],
      [
        159,
        167
      ],
      [
        185,
        45
      ],
      [
        185,
        181
      ],
      [
        172,
        166
      ],
      [
        93,
        159
      ],
      [
        172,
        195
      ],
      [
        153,
        154
      ],
      [
        172,
        193
      ],
      [
        160,
        180
      ],
      [
        172,
        159
      ],
      [
        153,
        180
      ],
      [
        122,
        45
      ],
      [
        159,
        174
      ],
      [
        22,
        153
      ],
      [
        153,
        183
      ],
      [
        185,
        173
      ],
      [
        167,
        153
      ],
      [
        45,
        154
      ],
      [
        169,
        183
      ],
      [
        185,
        159
      ],
      [
        174,
        153
      ],
      [
        159,
        1
      ],
      [
        154,
        154
      ],
      [
        159,
        170
      ],
      [
        198,
        198
      ],
      [
        102,
        227
      ],
      [
        159,
        189
      ],
      [
        160,
        183
      ],
      [
        102,
        122
      ],
      [
        3,
        12
      ],
      [
        160,
        154
      ],
      [
        157,
        153
      ],
      [
        159,
        171
      ],
      [
        208,
        45
      ],
      [
        22,
        174
      ],
      [
        93,
        192
      ],
      [
        170,
        153
      ],
      [
        173,
        174
      ],
      [
        166,
        93
      ],
      [
        22,
        122
      ],
      [
        169,
        155
      ],
      [
        159,
        186
      ],
      [
        173,
        153
      ],
      [
        102,
        105
      ],
      [
        93,
        173
      ],
      [
        167,
        168
      ],
      [
        169,
        157
      ],
      [
        208,
        93
      ],
      [
        102,
        102
      ],
      [
        168,
        102
      ],
      [
        243,
        11
      ],
      [
        185,
        193
      ],
      [
        22,
        166
      ],
      [
        185,
        166
      ],
      [
        187,
        154
      ],
      [
        154,
        7
      ],
      [
        189,
        93
      ],
      [
        189,
        102
      ],
      [
        153,
        245
      ],
      [
        183,
        183
      ],
      [
        154,
        160
      ],
      [
        93,
        23
      ],
      [
        189,
        153
      ],
      [
        235,
        45
      ],
      [
        93,
        24
      ],
      [
        208,
        159
      ],
      [
        179,
        153
      ],
      [
        171,
        159
      ],
      [
        244,
        160
      ],
      [
        154,
        169
      ],
      [
        94,
        7
      ],
      [
        122,
        122
      ],
      [
        154,
        183
      ],
      [
        168,
        153
      ],
      [
        154,
        155
      ],
      [
        209,
        225
      ],
      [
        45,
        197
      ],
      [
        155,
        7
      ],
      [
        155,
        160
      ],
      [
        185,
        195
      ],
      [
        8,
        154
      ],
      [
        93,
        122
      ],
      [
        22,
        204
      ],
      [
        154,
        180
      ],
      [
        22,
        194
      ],
      [
        159,
        179
      ],
      [
        183,
        154
      ],
      [
        209,
        45
      ],
      [
        159,
        154
      ],
      [
        179,
        168
      ],
      [
        209,
        122
      ],
      [
        198,
        22
      ],
      [
        153,
        157
      ],
      [
        209,
        153
      ],
      [
        93,
        166
      ],
      [
        171,
        191
      ],
      [
        209,
        159
      ],
      [
        93,
        1
      ],
      [
        45,
        198
      ],
      [
        166,
        153
      ],
      [
        45,
        22
      ],
      [
        159,
        122
      ],
      [
        184,
        153
      ],
      [
        159,
        164
      ],
      [
        153,
        8
      ],
      [
        243,
        12
      ],
      [
        173,
        238
      ],
      [
        184,
        159
      ],
      [
        102,
        22
      ],
      [
        201,
        153
      ],
      [
        155,
        169
      ],
      [
        159,
        225
      ],
      [
        171,
        122
      ],
      [
        45,
        50
      ],
      [
        170,
        102
      ],
      [
        176,
        153
      ],
      [
        93,
        191
      ],
      [
        166,
        177
      ],
      [
        102,
        173
      ],
      [
        155,
        154
      ],
      [
        184,
        168
      ],
      [
        188,
        7
      ],
      [
        278,
        7
      ],
      [
        166,
        174
      ],
      [
        200,
        93
      ],
      [
        173,
        167
      ],
      [
        238,
        22
      ],
      [
        191,
        159
      ],
      [
        275,
        7
      ],
      [
        173,
        199
      ],
      [
        154,
        187
      ],
      [
        122,
        153
      ],
      [
        93,
        205
      ],
      [
        179,
        93
      ],
      [
        235,
        177
      ],
      [
        93,
        227
      ],
      [
        122,
        225
      ],
      [
        189,
        168
      ],
      [
        166,
        102
      ],
      [
        235,
        159
      ],
      [
        168,
        93
      ],
      [
        167,
        93
      ],
      [
        102,
        253
      ],
      [
        171,
        233
      ],
      [
        174,
        164
      ],
      [
        170,
        93
      ],
      [
        200,
        168
      ],
      [
        153,
        155
      ],
      [
        305,
        193
      ],
      [
        200,
        153
      ],
      [
        122,
        159
      ],
      [
        220,
        154
      ],
      [
        93,
        197
      ],
      [
        311,
        177
      ],
      [
        71,
        7
      ],
      [
        45,
        227
      ],
      [
        197,
        102
      ],
      [
        189,
        171
      ],
      [
        274,
        157
      ],
      [
        197,
        93
      ],
      [
        208,
        177
      ],
      [
        179,
        179
      ],
      [
        171,
        226
      ],
      [
        169,
        154
      ],
      [
        166,
        167
      ],
      [
        102,
        7
      ],
      [
        208,
        277
      ],
      [
        22,
        181
      ],
      [
        179,
        167
      ],
      [
        159,
        178
      ],
      [
        191,
        168
      ],
      [
        193,
        238
      ],
      [
        220,
        244
      ],
      [
        1,
        45
      ],
      [
        122,
        7
      ],
      [
        93,
        212
      ],
      [
        189,
        189
      ],
      [
        168,
        167
      ],
      [
        236,
        183
      ],
      [
        220,
        160
      ],
      [
        184,
        122
      ],
      [
        208,
        235
      ],
      [
        93,
        93
      ],
      [
        190,
        153
      ],
      [
        93,
        181
      ],
      [
        191,
        153
      ],
      [
        45,
        8
      ],
      [
        1,
        93
      ],
      [
        160,
        245
      ],
      [
        167,
        167
      ],
      [
        105,
        24
      ],
      [
        122,
        23
      ],
      [
        122,
        24
      ],
      [
        236,
        236
      ],
      [
        102,
        167
      ],
      [
        197,
        159
      ],
      [
        171,
        173
      ],
      [
        45,
        44
      ],
      [
        50,
        153
      ],
      [
        22,
        195
      ],
      [
        185,
        172
      ],
      [
        122,
        226
      ],
      [
        167,
        164
      ],
      [
        198,
        93
      ],
      [
        93,
        193
      ],
      [
        105,
        23
      ],
      [
        235,
        235
      ],
      [
        322,
        105
      ],
      [
        102,
        233
      ],
      [
        45,
        266
      ],
      [
        93,
        368
      ],
      [
        320,
        340
      ],
      [
        171,
        205
      ],
      [
        160,
        8
      ],
      [
        311,
        45
      ],
      [
        248,
        179
      ],
      [
        93,
        256
      ],
      [
        166,
        192
      ],
      [
        208,
        173
      ],
      [
        179,
        186
      ],
      [
        218,
        171
      ],
      [
        304,
        159
      ],
      [
        183,
        8
      ],
      [
        13,
        71
      ],
      [
        172,
        296
      ],
      [
        201,
        93
      ],
      [
        155,
        183
      ],
      [
        385,
        305
      ],
      [
        45,
        7
      ],
      [
        93,
        102
      ],
      [
        243,
        13
      ],
      [
        195,
        153
      ],
      [
        166,
        186
      ],
      [
        204,
        22
      ],
      [
        347,
        22
      ],
      [
        1,
        159
      ],
      [
        238,
        198
      ],
      [
        228,
        183
      ],
      [
        181,
        174
      ],
      [
        102,
        166
      ],
      [
        173,
        154
      ],
      [
        166,
        168
      ],
      [
        170,
        168
      ],
      [
        200,
        174
      ],
      [
        226,
        153
      ],
      [
        308,
        174
      ],
      [
        200,
        179
      ],
      [
        102,
        93
      ],
      [
        218,
        154
      ],
      [
        218,
        122
      ],
      [
        218,
        174
      ],
      [
        199,
        253
      ],
      [
        193,
        340
      ],
      [
        283,
        154
      ],
      [
        228,
        154
      ],
      [
        235,
        171
      ],
      [
        405,
        7
      ],
      [
        406,
        7
      ],
      [
        45,
        71
      ],
      [
        93,
        174
      ],
      [
        208,
        192
      ],
      [
        281,
        154
      ],
      [
        179,
        102
      ],
      [
        208,
        191
      ],
      [
        167,
        174
      ],
      [
        172,
        362
      ],
      [
        159,
        285
      ],
      [
        154,
        244
      ],
      [
        153,
        292
      ],
      [
        172,
        153
      ],
      [
        184,
        192
      ],
      [
        50,
        8
      ],
      [
        198,
        296
      ],
      [
        179,
        248
      ],
      [
        209,
        173
      ],
      [
        93,
        252
      ],
      [
        170,
        167
      ],
      [
        235,
        93
      ],
      [
        220,
        169
      ],
      [
        193,
        486
      ],
      [
        320,
        450
      ],
      [
        173,
        122
      ],
      [
        181,
        93
      ],
      [
        193,
        305
      ],
      [
        494,
        266
      ],
      [
        179,
        199
      ],
      [
        122,
        177
      ],
      [
        195,
        22
      ],
      [
        197,
        192
      ],
      [
        315,
        159
      ],
      [
        166,
        238
      ],
      [
        208,
        166
      ],
      [
        170,
        199
      ],
      [
        176,
        102
      ],
      [
        7,
        13
      ],
      [
        45,
        298
      ],
      [
        189,
        174
      ],
      [
        441,
        181
      ],
      [
        172,
        192
      ],
      [
        71,
        8
      ]
    ]
  }
}