{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1023,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1024,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1025,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1026,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1027,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1028,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1029,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.906638782289217
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.590917559284033
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2416190200205364
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2416190200205364
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.366527375594794
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.702598696669572
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.330018475553281
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.5910776181765875
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.766623753127604
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.810252979507471
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.177159107222227
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.911483851178403
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.771092014501658
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.596830156393171
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.333380363358005
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.083428267770291
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.894633998009121
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.7369240490726
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.238525911984212
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -5.118394162602829
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -5.146383974248526
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.716063985212273
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -12.28827251668727
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -11.720469120412178
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.46113220067312
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.900137229998082
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -12.14872614321121
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.531520718505247
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -13.174215429368367
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.9700012834116425
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -14.718998830334229
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -16.436356327137403
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.15568735337899
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -13.304009494743111
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -17.025860122909553
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.417004954391572
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.7171457035876223
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.826833223999213
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -13.235748410016953
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -13.930541080628466
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.521210143751546
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.322574573361095
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -16.016596735286853
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -11.960090284907581
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -12.449539481429271
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -12.734983656432693
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -12.061428585676133
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.66411936734883
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -14.549972696226565
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -14.689497485552454
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.76547197197437
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -14.33264034663381
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.626535888566963
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -11.753304122781309
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.806103711824251
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.85618974216717
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -13.328654019987395
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -14.048353364252545
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -11.587598953878402
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.286080537780055
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.38806619639854
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -13.014204224281206
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -13.126688548166953
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -14.876490303940528
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.85618974216717
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.594933303985762
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -13.400175313082789
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -10.122454075465694
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -10.127522625027856
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.64488859811806
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -13.043645932196064
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -10.632968616412324
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.983505517950345
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -14.634517353020534
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.81020665548641
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.97669631963906
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -12.479813964387894
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -12.470375600919384
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.904389509879135
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.4105705333273413
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -9.160338009693366
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -13.767034018109957
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -13.771126652654466
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.61188679299103
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -12.10911720175344
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.571432100580434
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -16.290049872892066
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.840793943476381
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -13.658264354552047
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.118158497269789
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.814064261462114
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -12.792387278353198
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -12.022058817127775
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.350827939108076
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.788202454380286
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -14.327784713803757
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -10.8195042584838
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.050820566422324
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.726707622763275
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -11.897970529977192
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -13.102115644304613
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.059061980776823
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -13.041543596292676
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.439041645109743
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -12.382940475373735
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.388284801651672
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -12.706686395978942
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -14.189639096308687
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -10.95920538228013
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.285147912107753
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -7.692125562607536
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -14.053742086507786
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -10.964292857019043
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -13.373675632147885
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -13.961232034449823
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -13.039251348881796
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -15.360799477673996
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -12.692736788201994
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -15.489206680314666
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -11.78544141827453
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -13.90392694611402
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.194719858956637
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -12.270598713779094
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -11.316216914658595
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -11.10165932611584
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -16.09027336363996
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -9.964596112471932
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -14.834928322284355
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -11.88686939848224
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -11.934493056633075
      },
      {
        "glyphs": [
          "["
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.527489207655131
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -19.35396429484848
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.364292196520825
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.458854827975241
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8290944809747387
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.363237088963549
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.397158144113801
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -6.027819853889982
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -11.839223856449763
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.992114102807982
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.761415498469599
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.831740783024204
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -7.013009194055126
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -7.015958091475463
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.1036252858993585
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.757251558334303
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.228103919839809
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.422654912120409
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.565328820800467
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.58357281418772
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.70309039122308
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.73612137205549
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.841935546767184
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.890165110836872
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.954624295505871
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.108520972881172
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.128641841401524
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.196725018414318
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.38497076046391
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.438051727828238
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.447296153670237
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.458454335290806
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.552665756533816
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.55337244391321
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.570421476675339
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.73375589028513
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.755979012226346
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.85865935022577
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.92963420345624
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.97597154574313
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.17112020404716
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.173069589462477
      },
      {
        "glyphs": [
          "H",
          "2",
          "+"
        ],
        "score": -10.222656465318588
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.25927925799196
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.317363511597689
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.374448497884616
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.389422747390368
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.424641540247821
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.428505350250582
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.446777480573317
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.45176815669013
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.54043087578187
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.559996639781989
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.689587754155289
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.812777696426021
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.821622581186265
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -10.8419677003947
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.88474776584468
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.900089763228298
      },
      {
        "glyphs": [
          "Pt",
          "+"
        ],
        "score": -10.950025130505566
      },
      {
        "glyphs": [
          "Si",
          "H",
          "2"
        ],
        "score": -11.084885850032862
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.100480050443005
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.137515410987499
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.159626229431831
      },
      {
        "glyphs": [
          "Zr",
          "+"
        ],
        "score": -11.228505773880228
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.25941572883722
      },
      {
        "glyphs": [
          "Si",
          "H",
          "3"
        ],
        "score": -11.366818735718722
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.368113115183608
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.390490049920315
      },
      {
        "glyphs": [
          "Mg",
          "+"
        ],
        "score": -11.440366511001832
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.454715086255709
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.48144112100099
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.55705240807535
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.572518423934298
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.572931347002893
      },
      {
        "glyphs": [
          "Ca",
          "+"
        ],
        "score": -11.622984127733323
      },
      {
        "glyphs": [
          "Fe",
          "+"
        ],
        "score": -11.656068907952957
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.709440068063747
      },
      {
        "glyphs": [
          "Zn",
          "+"
        ],
        "score": -11.723763004888843
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.736043461517976
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.738237609510966
      },
      {
        "glyphs": [
          "Cu",
          "+"
        ],
        "score": -11.74572170889895
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.761771679464848
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.770291493246924
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.7838429942226
      },
      {
        "glyphs": [
          "Ti",
          "+"
        ],
        "score": -11.808652604084179
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.808986334720942
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.814924401780294
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.87400688589103
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.881645151189119
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.986993219222377
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.045594070614833
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.050701905401713
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.061071922213987
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -12.071870411199017
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.079631245973033
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.088342592581615
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.098129380693566
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.100856590242236
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.114555973361286
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.141918769748656
      },
      {
        "glyphs": [
          "Pd",
          "+"
        ],
        "score": -12.161447914607876
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.168048501403266
      },
      {
        "glyphs": [
          "Ir",
          "+"
        ],
        "score": -12.179160599050956
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.204740105267296
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.220692452996197
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.228000909797373
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.239298305942878
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.245237912088712
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.24823843369501
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.311893359704607
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.337533453011309
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.339457018536939
      },
      {
        "glyphs": [
          "Ni",
          "+"
        ],
        "score": -12.345384846174232
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.356074845937757
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.367192524597368
      },
      {
        "glyphs": [
          "Ru",
          "+"
        ],
        "score": -12.40269290897318
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.423252668975529
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.432566387588327
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.435594311336402
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.443113647108362
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.445139549261928
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.460381854461632
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.46064764264019
      },
      {
        "glyphs": [
          "Al",
          "+"
        ],
        "score": -12.461862841794094
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.467719602228183
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.519165231323143
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.535972317977429
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.544018094145697
      },
      {
        "glyphs": [
          "Co",
          "+"
        ],
        "score": -12.552738562989198
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.571918321303903
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.580677583056676
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.581272484039458
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.583695357734308
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.614599845817533
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.673290053281558
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.680820121303306
      },
      {
        "glyphs": [
          "Al",
          "H",
          "3"
        ],
        "score": -12.734664735406376
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.736479128898761
      },
      {
        "glyphs": [
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.745283790686587
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.782974571864685
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.784143828002033
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.788904356683085
      },
      {
        "glyphs": [
          "Au",
          "+"
        ],
        "score": -12.809890285174294
      },
      {
        "glyphs": [
          "Ba",
          "+"
        ],
        "score": -12.810162292557441
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.836675702688698
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.847392304977864
      },
      {
        "glyphs": [
          "N",
          "=",
          "N",
          "N"
        ],
        "score": -12.863366771589808
      },
      {
        "glyphs": [
          "1",
          "8",
          "F"
        ],
        "score": -12.875235387215113
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.875522886027166
      },
      {
        "glyphs": [
          "Sn",
          "+"
        ],
        "score": -12.885808248454353
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.937424093965161
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "N"
        ],
        "score": -12.939750226378038
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -12.939847941248122
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.969232165641966
      },
      {
        "glyphs": [
          "Mn",
          "+"
        ],
        "score": -12.987645651844806
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.994666626738107
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -13.030034038324533
      },
      {
        "glyphs": [
          "N",
          "=",
          "P"
        ],
        "score": -13.03336842718315
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N"
        ],
        "score": -13.034019144559206
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.044969566842573
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.046841300509682
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.054198528203578
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.062514924857256
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.081639671994203
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.089309225429917
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.091291072680885
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -13.117457599059914
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -13.123873122123852
      },
      {
        "glyphs": [
          "W",
          "+"
        ],
        "score": -13.133344142140801
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.135334845630908
      },
      {
        "glyphs": [
          "I",
          "I"
        ],
        "score": -13.160669254266097
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.164474530279051
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.166318819507463
      },
      {
        "glyphs": [
          "P",
          "P"
        ],
        "score": -13.167460118536908
      },
      {
        "glyphs": [
          "Hf",
          "+"
        ],
        "score": -13.168596501826643
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.189132864163124
      },
      {
        "glyphs": [
          "Cr",
          "+"
        ],
        "score": -13.235580925756643
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "P"
        ],
        "score": -13.249382892677131
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.250287668156842
      },
      {
        "glyphs": [
          "c",
          "n",
          "s",
          "n"
        ],
        "score": -13.264154174270464
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.281426143100445
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -13.285980983778177
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.286959829631432
      },
      {
        "glyphs": [
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C"
        ],
        "score": -13.298619932889086
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -13.306040744813625
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "o"
        ],
        "score": -13.319015885220535
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
