{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 515,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 520,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 521,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -7.092895226532889
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.167344926044951
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.167344926044951
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.242020489546924
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.153170402756775
      },
      {
        "glyphs": [
          "."
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -8.116963974158269
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.721432100886961
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.342023865006116
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -4.608894515301351
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -6.684050901334157
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -9.769200465683058
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -13.45658517205416
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -15.763496189854411
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "="
        ],
        "score": -2.960070598077163
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -9.370796552767032
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -9.45702053329719
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -5.885959529344472
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.6572499602864745
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.356879057467687
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.346048901097847
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -3.434084835290708
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.907657453577823
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.2507032478303977
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.627600649145961
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -9.912481414659865
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.114642838403915
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -11.094425278741165
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "["
        ],
        "score": -4.894538596148534
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -9.019572519551252
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -3.3081522077728245
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.0815978350793714
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.5000762062173223
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -5.72360364313573
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.038772462081912
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -20.3288005903971
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -4.214344279212543
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -4.24649391036931
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -6.087368435224308
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -8.114384490227854
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.376226023004245
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -8.647258069091025
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "c"
        ],
        "score": -9.077669326871819
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.404536077354786
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.386810323291938
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -10.43576402763425
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -10.602159192171484
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -10.735031302560936
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.830201142124903
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.919530411595824
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.011275879292604
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.021681821925023
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -11.149414419330181
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -11.294157356880236
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.29728473526892
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.32320725320404
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.338091956476749
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.369416624917163
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.427216260570043
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.48714916398758
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -11.57408760866044
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.5747394444031
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.579567047420792
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.580449346982792
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -11.611642084454173
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -11.638027810241235
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.743852278938517
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -11.751416678080805
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.805403155308204
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.807788681513584
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.84707952752294
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.851278277823438
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.88352424459821
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -11.928453019063348
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -11.934885180537531
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C"
        ],
        "score": -11.990659154573514
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.002803419402962
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.0295952833245
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.065561649646678
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -12.105180588095248
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.12307235795325
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.12884717514694
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.150652736188842
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.1538516007737
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.205777057425347
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.219378553756316
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.220871557793444
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.222535055106086
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.23293374905882
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.236864733895224
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.262537158321583
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.267476827218587
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.270063993055876
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.299469164990946
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -12.312199249897445
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -12.315530103565187
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.318020843856562
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C"
        ],
        "score": -12.318024211763987
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.329764693130231
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.36652434607813
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.37649116975273
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.401153883830382
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.426346544865858
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.462399330929461
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.53059046289389
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.55802873156673
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.571181444673574
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.582543968240646
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.601387171419272
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.625096294827019
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.626759553640719
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.630959803049556
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.642270347955789
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -12.659009830009971
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -12.660241742927049
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.674171325218172
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.732160707924054
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.732465173445114
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.768090106839145
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "#"
        ],
        "score": -12.79374538346847
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -12.79848404373526
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.821646565453557
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -12.828833983890561
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.848084446569338
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.865336003039632
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.903043979651477
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.914977731451826
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.924348755239459
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -12.945816804990354
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.947378160846572
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.953336256543093
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.982578909759656
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -13.008494885447202
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.014216241315802
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.052577510933297
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -13.056499024561978
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.090655531774637
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.103877234225642
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.12695417705551
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.16713042812173
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.180429887740324
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.196829981534748
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -13.202536361361213
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C"
        ],
        "score": -13.208036012887453
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.259227319594364
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.316324434123102
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.32277703213662
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.363733093005973
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -13.37327982004528
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.424433591429407
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.445974237792928
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.448025362262598
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "#"
        ],
        "score": -13.450740704899978
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -13.478183526388495
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.515595394948637
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.566966310524538
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.568481602694444
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -13.618083530358103
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -13.628674543951725
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.647873485726173
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.668782553070665
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -13.69631871095051
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.705687435903462
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.741208233842052
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.791840900603056
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -13.811724541024919
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -13.825738171227163
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -13.94189626501377
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.944221600275945
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -13.950049284873646
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -13.96191294913713
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.99120526382246
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.016450191537995
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.023319220617394
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -14.091271422333211
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.11552886930202
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.118063060459605
      },
      {
        "glyphs": [
          "N",
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -14.122690948357903
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.142196145408146
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.16951415150151
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.175639562415329
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.219071578572827
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.236611129072124
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.240584176718212
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -14.273050576877061
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "S"
        ],
        "score": -14.287901123276821
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.289907836207789
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -14.29902788547114
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.31857495110246
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.321348843521996
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.355240950399288
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.363803806710123
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.374321304855986
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.404116342807171
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.41215149555832
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.415382751386637
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.430187479726886
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "O",
          "N"
        ],
        "score": -14.445710396117558
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -14.46532645961131
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -14.47635821958324
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -14.49338886070682
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -14.518796629404882
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.535200013139363
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.549981494622022
      },
      {
        "glyphs": [
          "C",
