{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2051,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2052,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2053,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2054,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2055,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2056,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        153,
        153
      ],
      [
        45,
        45
      ],
      [
        22,
        102
      ],
      [
        159,
        153
      ],
      [
        159,
        162
      ],
      [
        160,
        160
      ],
      [
        102,
        45
      ],
      [
        93,
        45
      ],
      [
        22,
        45
      ],
      [
        154,
        153
      ],
      [
        160,
        45
      ],
      [
        8,
        153
      ],
      [
        45,
        153
      ],
      [
        45,
        23
      ],
      [
        45,
        24
      ],
      [
        172,
        71
      ],
      [
        173,
        71
      ],
      [
        159,
        159
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        160,
        93
      ],
      [
        93,
        153
      ],
      [
        45,
        167
      ],
      [
        102,
        160
      ],
      [
        177,
        153
      ],
      [
        102,
        167
      ],
      [
        154,
        71
      ],
      [
        102,
        153
      ],
      [
        164,
        164
      ],
      [
        153,
        154
      ],
      [
        45,
        165
      ],
      [
        160,
        153
      ],
      [
        164,
        45
      ],
      [
        102,
        8
      ],
      [
        93,
        7
      ],
      [
        154,
        159
      ],
      [
        45,
        1
      ],
      [
        157,
        153
      ],
      [
        22,
        160
      ],
      [
        45,
        166
      ],
      [
        93,
        160
      ],
      [
        154,
        154
      ],
      [
        169,
        93
      ],
      [
        153,
        168
      ],
      [
        155,
        153
      ],
      [
        160,
        165
      ],
      [
        166,
        153
      ],
      [
        45,
        122
      ],
      [
        22,
        93
      ],
      [
        195,
        93
      ],
      [
        13,
        71
      ],
      [
        165,
        153
      ],
      [
        160,
        182
      ],
      [
        22,
        122
      ],
      [
        160,
        166
      ],
      [
        45,
        154
      ],
      [
        8,
        154
      ],
      [
        154,
        168
      ],
      [
        45,
        197
      ],
      [
        93,
        167
      ],
      [
        160,
        102
      ],
      [
        160,
        186
      ],
      [
        162,
        168
      ],
      [
        159,
        168
      ],
      [
        122,
        45
      ],
      [
        164,
        160
      ],
      [
        159,
        154
      ],
      [
        93,
        122
      ],
      [
        176,
        154
      ],
      [
        122,
        153
      ],
      [
        45,
        22
      ],
      [
        169,
        153
      ],
      [
        188,
        154
      ],
      [
        169,
        166
      ],
      [
        93,
        1
      ],
      [
        162,
        157
      ],
      [
        168,
        168
      ],
      [
        206,
        153
      ],
      [
        187,
        187
      ],
      [
        169,
        102
      ],
      [
        178,
        153
      ],
      [
        164,
        93
      ],
      [
        179,
        160
      ],
      [
        159,
        194
      ],
      [
        160,
        154
      ],
      [
        160,
        122
      ],
      [
        153,
        196
      ],
      [
        102,
        22
      ],
      [
        22,
        166
      ],
      [
        162,
        155
      ],
      [
        154,
        162
      ],
      [
        182,
        182
      ],
      [
        45,
        161
      ],
      [
        153,
        157
      ],
      [
        164,
        169
      ],
      [
        45,
        71
      ],
      [
        93,
        169
      ],
      [
        154,
        155
      ],
      [
        153,
        8
      ],
      [
        154,
        203
      ],
      [
        168,
        154
      ],
      [
        182,
        102
      ],
      [
        93,
        190
      ],
      [
        154,
        7
      ],
      [
        160,
        1
      ],
      [
        177,
        160
      ],
      [
        188,
        159
      ],
      [
        3,
        12
      ],
      [
        154,
        176
      ],
      [
        45,
        207
      ],
      [
        233,
        171
      ],
      [
        93,
        71
      ],
      [
        122,
        160
      ],
      [
        178,
        167
      ],
      [
        165,
        102
      ],
      [
        22,
        180
      ],
      [
        177,
        105
      ],
      [
        102,
        169
      ],
      [
        102,
        212
      ],
      [
        160,
        167
      ],
      [
        93,
        93
      ],
      [
        159,
        196
      ],
      [
        181,
        153
      ],
      [
        45,
        8
      ],
      [
        178,
        160
      ],
      [
        22,
        169
      ],
      [
        93,
        179
      ],
      [
        167,
        153
      ],
      [
        162,
        154
      ],
      [
        102,
        179
      ],
      [
        102,
        105
      ],
      [
        45,
        50
      ],
      [
        169,
        186
      ],
      [
        102,
        164
      ],
      [
        195,
        171
      ],
      [
        246,
        153
      ],
      [
        179,
        153
      ],
      [
        206,
        45
      ],
      [
        63,
        153
      ],
      [
        270,
        7
      ],
      [
        94,
        7
      ],
      [
        93,
        8
      ],
      [
        7,
        13
      ],
      [
        187,
        45
      ],
      [
        189,
        153
      ],
      [
        93,
        166
      ],
      [
        187,
        164
      ],
      [
        198,
        153
      ],
      [
        194,
        154
      ],
      [
        22,
        199
      ],
      [
        122,
        171
      ],
      [
        164,
        102
      ],
      [
        177,
        179
      ],
      [
        169,
        154
      ],
      [
        93,
        164
      ],
      [
        157,
        162
      ],
      [
        22,
        205
      ],
      [
        169,
        165
      ],
      [
        71,
        8
      ],
      [
        102,
        122
      ],
      [
        155,
        154
      ],
      [
        187,
        160
      ],
      [
        71,
        71
      ],
      [
        50,
        153
      ],
      [
        93,
        22
      ],
      [
        254,
        13
      ],
      [
        263,
        263
      ],
      [
        169,
        122
      ],
      [
        266,
        11
      ],
      [
        63,
        45
      ],
      [
        164,
        153
      ],
      [
        1,
        93
      ],
      [
        93,
        274
      ],
      [
        50,
        8
      ],
      [
        164,
        166
      ],
      [
        45,
        44
      ],
      [
        188,
        162
      ],
      [
        194,
        157
      ],
      [
        254,
        14
      ],
      [
        187,
        169
      ],
      [
        178,
        122
      ],
      [
        160,
        223
      ],
      [
        229,
        179
      ],
      [
        218,
        153
      ],
      [
        195,
        160
      ],
      [
        202,
        154
      ],
      [
        229,
        169
      ],
      [
        153,
        203
      ],
      [
        159,
        203
      ],
      [
        249,
        154
      ],
      [
        200,
        154
      ],
      [
        93,
        201
      ],
      [
        207,
        93
      ],
      [
        182,
        165
      ],
      [
        197,
        167
      ],
      [
        250,
        250
      ],
      [
        263,
        93
      ],
      [
        93,
        102
      ],
      [
        159,
        200
      ],
      [
        127,
        71
      ],
      [
        201,
        167
      ],
      [
        102,
        102
      ],
      [
        206,
        160
      ],
      [
        169,
        180
      ],
      [
        102,
        93
      ],
      [
        233,
        160
      ],
      [
        207,
        102
      ],
      [
        200,
        200
      ],
      [
        164,
        186
      ],
      [
        187,
        191
      ],
      [
        45,
        63
      ],
      [
        102,
        38
      ],
      [
        164,
        178
      ],
      [
        188,
        225
      ],
      [
        194,
        168
      ],
      [
        199,
        166
      ],
      [
        195,
        45
      ],
      [
        22,
        164
      ],
      [
        177,
        169
      ],
      [
        160,
        228
      ],
      [
        167,
        93
      ],
      [
        266,
        12
      ],
      [
        164,
        165
      ],
      [
        188,
        168
      ],
      [
        44,
        153
      ],
      [
        187,
        224
      ],
      [
        105,
        7
      ],
      [
        13,
        7
      ],
      [
        182,
        153
      ],
      [
        184,
        153
      ],
      [
        244,
        160
      ],
      [
        160,
        197
      ],
      [
        160,
        205
      ],
      [
        182,
        166
      ],
      [
        80,
        7
      ],
      [
        187,
        253
      ],
      [
        323,
        153
      ],
      [
        22,
        153
      ],
      [
        169,
        167
      ],
      [
        165,
        165
      ],
      [
        102,
        238
      ],
      [
        270,
        386
      ],
      [
        168,
        200
      ],
      [
        7,
        14
      ],
      [
        337,
        8
      ],
      [
        182,
        186
      ],
      [
        160,
        50
      ],
      [
        254,
        8
      ],
      [
        246,
        105
      ],
      [
        197,
        197
      ],
      [
        324,
        8
      ],
      [
        325,
        325
      ],
      [
        237,
        160
      ],
      [
        45,
        105
      ],
      [
        102,
        201
      ],
      [
        217,
        197
      ],
      [
        181,
        93
      ],
      [
        155,
        162
      ],
      [
        177,
        211
      ],
      [
        199,
        102
      ],
      [
        237,
        45
      ],
      [
        178,
        179
      ],
      [
        202,
        168
      ],
      [
        229,
        180
      ],
      [
        200,
        168
      ],
      [
        154,
        157
      ],
      [
        179,
        122
      ],
      [
        93,
        230
      ],
      [
        219,
        105
      ],
      [
        178,
        169
      ],
      [
        157,
        159
      ],
      [
        212,
        212
      ],
      [
        153,
        155
      ],
      [
        122,
        7
      ],
      [
        199,
        186
      ],
      [
        188,
        200
      ],
      [
        217,
        167
      ],
      [
        217,
        154
      ],
      [
        168,
        196
      ],
      [
        169,
        199
      ],
      [
        169,
        330
      ],
      [
        206,
        171
      ],
      [
        164,
        154
      ],
      [
        229,
        164
      ],
      [
        229,
        153
      ],
      [
        217,
        165
      ],
      [
        216,
        154
      ],
      [
        22,
        191
      ],
      [
        1,
        171
      ],
      [
        233,
        45
      ],
      [
        195,
        179
      ],
      [
        229,
        166
      ],
      [
        153,
        317
      ],
      [
        154,
        8
      ],
      [
        44,
        8
      ],
      [
        177,
        213
      ],
      [
        154,
        196
      ],
      [
        71,
        7
      ],
      [
        83,
        7
      ],
      [
        164,
        122
      ],
      [
        266,
        13
      ],
      [
        217,
        186
      ],
      [
        164,
        171
      ],
      [
        155,
        168
      ],
      [
        93,
        342
      ],
      [
        166,
        161
      ],
      [
        177,
        219
      ],
      [
        179,
        167
      ],
      [
        191,
        166
      ],
      [
        167,
        167
      ],
      [
        93,
        180
      ],
      [
        177,
        122
      ],
      [
        199,
        154
      ],
      [
        77,
        8
      ],
      [
        38,
        8
      ],
      [
        252,
        188
      ],
      [
        217,
        166
      ],
      [
        93,
        207
      ],
      [
        14,
        7
      ],
      [
        199,
        122
      ],
      [
        22,
        179
      ],
      [
        160,
        161
      ],
      [
        169,
        205
      ],
      [
        237,
        169
      ],
      [
        256,
        168
      ],
      [
        177,
        243
      ],
      [
        206,
        169
      ],
      [
        160,
        284
      ],
      [
        229,
        190
      ],
      [
        196,
        168
      ],
      [
        14,
        71
      ],
      [
        207,
        165
      ],
      [
        177,
        220
      ],
      [
        93,
        191
      ],
      [
        93,
        161
      ],
      [
        122,
        8
      ],
      [
        169,
        182
      ],
      [
        270,
        477
      ],
      [
        184,
        102
      ],
      [
        122,
        169
      ],
      [
        199,
        165
      ],
      [
        177,
        204
      ],
      [
        178,
        219
      ],
      [
        177,
        93
      ],
      [
        112,
        301
      ],
      [
        222,
        154
      ],
      [
        207,
        166
      ],
      [
        102,
        197
      ],
      [
        358,
        13
      ],
      [
        207,
        179
      ],
      [
        102,
        187
      ],
      [
        255,
        154
      ],
      [
        424,
        168
      ],
      [
        268,
        166
      ],
      [
        164,
        179
      ],
      [
        102,
        191
      ],
      [
        102,
        224
      ],
      [
        237,
        191
      ],
      [
        237,
        164
      ],
      [
        204,
        153
      ],
      [
        164,
        190
      ],
      [
        266,
        14
      ],
      [
        165,
        161
      ],
      [
        45,
        77
      ],
      [
        185,
        7
      ],
      [
        178,
        190
      ],
      [
        93,
        197
      ],
      [
        102,
        165
      ],
      [
        164,
        183
      ],
      [
        7,
        15
      ],
      [
        102,
        317
      ],
      [
        218,
        161
      ],
      [
        263,
        171
      ],
      [
        12,
        14
      ],
      [
        207,
        169
      ],
      [
        182,
        154
      ],
      [
        122,
        122
      ],
      [
        184,
        161
      ],
      [
        207,
        122
      ],
      [
        93,
        218
      ],
      [
        195,
        169
      ],
      [
        177,
        201
      ],
      [
        202,
        157
      ],
      [
        263,
        160
      ],
      [
        354,
        354
      ],
      [
        159,
        319
      ],
      [
        154,
        194
      ],
      [
        199,
        250
      ],
      [
        168,
        194
      ],
      [
        160,
        44
      ],
      [
        195,
        219
      ],
      [
        207,
        190
      ],
      [
        285,
        153
      ],
      [
        410,
        410
      ],
      [
        192,
        13
      ],
      [
        358,
        14
      ],
      [
        102,
        7
      ],
      [
        430,
        430
      ],
      [
        182,
        167
      ],
      [
        93,
        105
      ],
      [
        164,
        220
      ],
      [
        169,
        228
      ],
      [
        102,
        230
      ],
      [
        93,
        232
      ],
      [
        89,
        301
      ],
      [
        122,
        179
      ],
      [
        162,
        200
      ],
      [
        93,
        165
      ],
      [
        376,
        167
      ],
      [
        159,
        8
      ],
      [
        278,
        153
      ],
      [
        93,
        247
      ],
      [
        93,
        224
      ],
      [
        177,
        232
      ],
      [
        105,
        456
      ],
      [
        197,
        284
      ],
      [
        177,
        164
      ],
      [
        255,
        165
      ],
      [
        206,
        179
      ],
      [
        211,
        250
      ],
      [
        195,
        220
      ],
      [
        50,
        45
      ],
      [
        45,
        212
      ],
      [
        182,
        122
      ],
      [
        195,
        213
      ],
      [
        252,
        159
      ],
      [
        160,
        105
      ],
      [
        164,
        177
      ],
      [
        122,
        167
      ],
      [
        22,
        190
      ],
      [
        93,
        240
      ],
      [
        164,
        189
      ],
      [
        219,
        179
      ],
      [
        270,
        8
      ],
      [
        164,
        180
      ],
      [
        237,
        224
      ],
      [
        122,
        23
      ],
      [
        178,
        22
      ],
      [
        166,
        167
      ],
      [
        122,
        24
      ],
      [
        46,
        301
      ],
      [
        266,
        15
      ],
      [
        3,
        13
      ],
      [
        276,
        186
      ],
      [
        93,
        154
      ],
      [
        194,
        155
      ],
      [
        93,
        238
      ],
      [
        189,
        186
      ],
      [
        102,
        232
      ],
      [
        169,
        50
      ],
      [
        165,
        167
      ],
      [
        157,
        225
      ],
      [
        176,
        8
      ],
      [
        187,
        153
      ],
      [
        147,
        301
      ],
      [
        160,
        63
      ],
      [
        181,
        122
      ],
      [
        164,
        213
      ],
      [
        169,
        223
      ],
      [
        102,
        218
      ],
      [
        201,
        122
      ],
      [
        122,
        360
      ],
      [
        218,
        93
      ],
      [
        216,
        157
      ],
      [
        200,
        196
      ],
      [
        122,
        93
      ],
      [
        268,
        93
      ],
      [
        237,
        253
      ],
      [
        199,
        447
      ],
      [
        165,
        93
      ],
      [
        157,
        168
      ],
      [
        206,
        223
      ],
      [
        237,
        187
      ],
      [
        164,
        201
      ],
      [
        260,
        169
      ],
      [
        233,
        169
      ],
      [
        207,
        201
      ],
      [
        169,
        161
      ],
      [
        276,
        165
      ],
      [
        45,
        38
      ],
      [
        202,
        155
      ],
      [
        217,
        102
      ],
      [
        177,
        190
      ],
      [
        146,
        301
      ],
      [
        195,
        164
      ],
      [
        102,
        305
      ],
      [
        168,
        203
      ],
      [
        468,
        468
      ],
      [
        255,
        182
      ],
      [
        233,
        190
      ],
      [
        219,
        169
      ],
      [
        155,
        159
      ],
      [
        159,
        216
      ],
      [
        187,
        186
      ],
      [
        166,
        93
      ],
      [
        102,
        71
      ],
      [
        188,
        203
      ],
      [
        93,
        212
      ],
      [
        164,
        204
      ],
      [
        268,
        154
      ],
      [
        187,
        93
      ],
      [
        122,
        244
      ],
      [
        199,
        182
      ],
      [
        178,
        164
      ],
      [
        50,
        290
      ],
      [
        191,
        154
      ],
      [
        157,
        154
      ],
      [
        177,
        218
      ],
      [
        260,
        179
      ],
      [
        1,
        160
      ],
      [
        207,
        164
      ],
      [
        219,
        122
      ],
      [
        155,
        202
      ],
      [
        237,
        302
      ],
      [
        177,
        166
      ],
      [
        179,
        179
      ],
      [
        263,
        45
      ],
      [
        284,
        284
      ],
      [
        266,
        16
      ],
      [
        187,
        165
      ],
      [
        184,
        93
      ],
      [
        195,
        238
      ],
      [
        255,
        186
      ],
      [
        64,
        301
      ],
      [
        284,
        167
      ],
      [
        276,
        330
      ],
      [
        15,
        7
      ],
      [
        71,
        14
      ],
      [
        181,
        165
      ],
      [
        270,
        685
      ],
      [
        225,
        155
      ],
      [
        182,
        330
      ],
      [
        199,
        228
      ],
      [
        50,
        402
      ],
      [
        206,
        178
      ],
      [
        178,
        201
      ],
      [
        122,
        213
      ],
      [
        177,
        295
      ],
      [
        166,
        330
      ],
      [
        253,
        186
      ],
      [
        56,
        301
      ],
      [
        164,
        230
      ],
      [
        63,
        8
      ],
      [
        164,
        219
      ],
      [
        268,
        180
      ],
      [
        102,
        166
      ],
      [
        219,
        232
      ],
      [
        417,
        166
      ],
      [
        1,
        45
      ],
      [
        167,
        166
      ],
      [
        102,
        240
      ],
      [
        226,
        153
      ],
      [
        288,
        153
      ],
      [
        167,
        161
      ],
      [
        178,
        93
      ],
      [
        77,
        153
      ],
      [
        157,
        216
      ],
      [
        22,
        105
      ],
      [
        207,
        180
      ],
      [
        79,
        402
      ],
      [
        168,
        8
      ],
      [
        264,
        205
      ],
      [
        168,
        319
      ],
      [
        199,
        309
      ],
      [
        189,
        161
      ],
      [
        308,
        122
      ],
      [
        122,
        396
      ],
      [
        181,
        167
      ],
      [
        250,
        165
      ],
      [
        102,
        154
      ],
      [
        105,
        24
      ],
      [
        556,
        556
      ],
      [
        63,
        63
      ],
      [
        211,
        186
      ],
      [
        164,
        167
      ],
      [
        211,
        102
      ],
      [
        276,
        154
      ],
      [
        105,
        23
      ],
      [
        165,
        186
      ],
      [
        108,
        301
      ],
      [
        71,
        13
      ],
      [
        255,
        122
      ],
      [
        218,
        212
      ],
      [
        122,
        164
      ],
      [
        211,
        165
      ],
      [
        285,
        122
      ],
      [
        178,
        166
      ],
      [
        122,
        223
      ],
      [
        199,
        260
      ],
      [
        177,
        291
      ],
      [
        207,
        218
      ],
      [
        122,
        326
      ],
      [
        252,
        200
      ],
      [
        199,
        223
      ],
      [
        189,
        165
      ],
      [
        247,
        167
      ],
      [
        292,
        165
      ],
      [
        204,
        154
      ],
      [
        229,
        191
      ],
      [
        244,
        171
      ],
      [
        195,
        243
      ],
      [
        250,
        102
      ],
      [
        102,
        456
      ],
      [
        178,
        204
      ],
      [
        189,
        102
      ],
      [
        266,
        17
      ],
      [
        276,
        122
      ],
      [
        102,
        253
      ],
      [
        105,
        153
      ],
      [
        50,
        171
      ],
      [
        177,
        241
      ],
      [
        169,
        63
      ],
      [
        160,
        353
      ],
      [
        105,
        8
      ],
      [
        22,
        241
      ],
      [
        169,
        44
      ],
      [
        169,
        197
      ],
      [
        211,
        166
      ],
      [
        93,
        210
      ],
      [
        167,
        165
      ],
      [
        179,
        169
      ],
      [
        177,
        312
      ],
      [
        164,
        182
      ],
      [
        216,
        155
      ],
      [
        237,
        320
      ],
      [
        167,
        122
      ],
      [
        620,
        102
      ],
      [
        187,
        171
      ],
      [
        292,
        220
      ],
      [
        305,
        153
      ],
      [
        136,
        528
      ],
      [
        354,
        250
      ],
      [
        155,
        194
      ],
      [
        178,
        213
      ],
      [
        552,
        552
      ],
      [
        195,
        204
      ],
      [
        102,
        320
      ],
      [
        99,
        301
      ],
      [
        93,
        187
      ],
      [
        102,
        237
      ],
      [
        229,
        199
      ],
      [
        292,
        102
      ],
      [
        167,
        102
      ],
      [
        313,
        153
      ],
      [
        164,
        228
      ],
      [
        22,
        201
      ],
      [
        93,
        182
      ],
      [
        229,
        295
      ],
      [
        272,
        153
      ],
      [
        167,
        223
      ],
      [
        292,
        186
      ],
      [
        169,
        250
      ],
      [
        162,
        8
      ],
      [
        147,
        528
      ],
      [
        169,
        271
      ],
      [
        167,
        218
      ],
      [
        233,
        201
      ],
      [
        164,
        239
      ],
      [
        270,
        13
      ],
      [
        122,
        228
      ],
      [
        182,
        50
      ],
      [
        164,
        218
      ],
      [
        532,
        153
      ],
      [
        181,
        166
      ],
      [
        182,
        63
      ],
      [
        44,
        45
      ],
      [
        93,
        351
      ],
      [
        360,
        360
      ],
      [
        224,
        154
      ],
      [
        292,
        204
      ],
      [
        169,
        210
      ],
      [
        165,
        154
      ],
      [
        198,
        161
      ],
      [
        102,
        63
      ],
      [
        187,
        229
      ],
      [
        431,
        188
      ],
      [
        45,
        7
      ],
      [
        237,
        338
      ],
      [
        199,
        330
      ],
      [
        211,
        154
      ],
      [
        187,
        190
      ],
      [
        167,
        180
      ],
      [
        3,
        14
      ],
      [
        207,
        105
      ],
      [
        187,
        189
      ],
      [
        12,
        19
      ],
      [
        255,
        180
      ],
      [
        181,
        218
      ],
      [
        191,
        122
      ],
      [
        244,
        169
      ],
      [
        189,
        93
      ],
      [
        22,
        224
      ],
      [
        165,
        182
      ],
      [
        179,
        190
      ],
      [
        305,
        165
      ],
      [
        32,
        402
      ],
      [
        187,
        220
      ],
      [
        206,
        244
      ],
      [
        353,
        93
      ],
      [
        157,
        7
      ],
      [
        305,
        186
      ],
      [
        266,
        18
      ],
      [
        197,
        182
      ],
      [
        817,
        8
      ],
      [
        238,
        105
      ],
      [
        259,
        157
      ],
      [
        105,
        45
      ],
      [
        160,
        207
      ],
      [
        93,
        253
      ],
      [
        238,
        169
      ],
      [
        532,
        324
      ],
      [
        122,
        219
      ],
      [
        187,
        240
      ],
      [
        77,
        7
      ],
      [
        207,
        182
      ],
      [
        166,
        166
      ],
      [
        237,
        305
      ],
      [
        219,
        93
      ],
      [
        250,
        352
      ],
      [
        182,
        228
      ],
      [
        32,
        686
      ],
      [
        253,
        165
      ],
      [
        646,
        646
      ],
      [
        122,
        190
      ],
      [
        177,
        38
      ],
      [
        177,
        244
      ],
      [
        207,
        210
      ],
      [
        292,
        183
      ],
      [
        313,
        166
      ],
      [
        308,
        102
      ],
      [
        244,
        122
      ],
      [
        177,
        102
      ],
      [
        292,
        153
      ],
      [
        235,
        154
      ],
      [
        229,
        105
      ],
      [
        169,
        1
      ],
      [
        217,
        379
      ],
      [
        187,
        179
      ],
      [
        164,
        232
      ],
      [
        93,
        226
      ],
      [
        164,
        50
      ],
      [
        211,
        182
      ],
      [
        313,
        213
      ],
      [
        55,
        7
      ],
      [
        160,
        22
      ],
      [
        844,
        63
      ],
      [
        199,
        167
      ],
      [
        195,
        191
      ],
      [
        187,
        204
      ],
      [
        39,
        301
      ],
      [
        93,
        284
      ],
      [
        164,
        226
      ],
      [
        217,
        122
      ],
      [
        532,
        45
      ],
      [
        165,
        105
      ],
      [
        178,
        197
      ],
      [
        105,
        105
      ],
      [
        219,
        164
      ],
      [
        206,
        213
      ],
      [
        250,
        260
      ],
      [
        122,
        181
      ],
      [
        115,
        7
      ],
      [
        184,
        180
      ],
      [
        654,
        477
      ],
      [
        543,
        543
      ],
      [
        187,
        166
      ],
      [
        169,
        105
      ],
      [
        181,
        102
      ],
      [
        263,
        169
      ],
      [
        102,
        384
      ],
      [
        207,
        230
      ],
      [
        268,
        102
      ],
      [
        237,
        237
      ],
      [
        165,
        63
      ],
      [
        182,
        223
      ],
      [
        231,
        157
      ],
      [
        93,
        223
      ],
      [
        209,
        71
      ],
      [
        219,
        201
      ],
      [
        178,
        220
      ],
      [
        153,
        1
      ],
      [
        53,
        301
      ],
      [
        313,
        154
      ],
      [
        181,
        154
      ],
      [
        197,
        166
      ],
      [
        56,
        7
      ],
      [
        229,
        224
      ],
      [
        122,
        166
      ],
      [
        200,
        162
      ],
      [
        12,
        16
      ],
      [
        102,
        77
      ],
      [
        102,
        338
      ],
      [
        164,
        330
      ],
      [
        217,
        228
      ],
      [
        266,
        19
      ],
      [
        360,
        102
      ],
      [
        206,
        271
      ],
      [
        197,
        286
      ],
      [
        102,
        302
      ],
      [
        250,
        186
      ],
      [
        233,
        179
      ],
      [
        250,
        166
      ],
      [
        237,
        204
      ],
      [
        313,
        178
      ],
      [
        217,
        182
      ],
      [
        233,
        178
      ],
      [
        155,
        7
      ],
      [
        122,
        220
      ],
      [
        229,
        230
      ],
      [
        102,
        50
      ],
      [
        93,
        199
      ],
      [
        323,
        105
      ],
      [
        160,
        77
      ],
      [
        122,
        180
      ],
      [
        31,
        7
      ],
      [
        308,
        166
      ],
      [
        187,
        178
      ],
      [
        260,
        105
      ],
      [
        177,
        362
      ],
      [
        272,
        161
      ],
      [
        211,
        288
      ],
      [
        122,
        201
      ],
      [
        237,
        368
      ],
      [
        268,
        218
      ],
      [
        22,
        302
      ],
      [
        654,
        386
      ],
      [
        77,
        77
      ],
      [
        178,
        230
      ],
      [
        187,
        102
      ],
      [
        182,
        210
      ],
      [
        182,
        44
      ],
      [
        546,
        166
      ],
      [
        197,
        165
      ],
      [
        182,
        447
      ],
      [
        50,
        160
      ],
      [
        197,
        102
      ],
      [
        37,
        7
      ],
      [
        44,
        171
      ],
      [
        188,
        196
      ],
      [
        313,
        179
      ],
      [
        408,
        197
      ],
      [
        229,
        201
      ],
      [
        206,
        93
      ],
      [
        93,
        310
      ],
      [
        229,
        253
      ],
      [
        164,
        105
      ],
      [
        178,
        232
      ],
      [
        273,
        105
      ],
      [
        187,
        182
      ],
      [
        164,
        44
      ],
      [
        431,
        168
      ],
      [
        229,
        205
      ],
      [
        206,
        219
      ],
      [
        256,
        159
      ],
      [
        311,
        122
      ],
      [
        247,
        330
      ],
      [
        64,
        402
      ],
      [
        121,
        301
      ],
      [
        122,
        208
      ],
      [
        164,
        197
      ],
      [
        204,
        161
      ],
      [
        102,
        411
      ],
      [
        188,
        665
      ],
      [
        255,
        330
      ],
      [
        182,
        1
      ],
      [
        142,
        301
      ],
      [
        177,
        230
      ],
      [
        229,
        316
      ],
      [
        211,
        392
      ],
      [
        136,
        301
      ],
      [
        201,
        169
      ],
      [
        164,
        199
      ],
      [
        246,
        180
      ],
      [
        211,
        354
      ],
      [
        22,
        230
      ],
      [
        165,
        330
      ],
      [
        184,
        274
      ],
      [
        279,
        93
      ],
      [
        266,
        20
      ],
      [
        164,
        223
      ],
      [
        165,
        166
      ],
      [
        345,
        167
      ],
      [
        229,
        240
      ],
      [
        3,
        15
      ],
      [
        292,
        154
      ],
      [
        166,
        102
      ],
      [
        177,
        165
      ],
      [
        271,
        223
      ],
      [
        730,
        730
      ],
      [
        833,
        302
      ],
      [
        187,
        316
      ],
      [
        292,
        179
      ],
      [
        255,
        250
      ],
      [
        197,
        186
      ],
      [
        305,
        204
      ],
      [
        821,
        71
      ],
      [
        93,
        50
      ],
      [
        168,
        256
      ],
      [
        246,
        169
      ],
      [
        165,
        50
      ],
      [
        211,
        260
      ],
      [
        178,
        243
      ],
      [
        417,
        165
      ],
      [
        237,
        179
      ],
      [
        276,
        180
      ],
      [
        178,
        244
      ],
      [
        181,
        223
      ],
      [
        207,
        191
      ],
      [
        578,
        392
      ],
      [
        206,
        122
      ],
      [
        206,
        164
      ],
      [
        263,
        220
      ],
      [
        219,
        166
      ],
      [
        217,
        353
      ],
      [
        288,
        122
      ],
      [
        305,
        166
      ],
      [
        177,
        191
      ],
      [
        12,
        15
      ],
      [
        263,
        243
      ],
      [
        105,
        71
      ],
      [
        164,
        161
      ],
      [
        247,
        93
      ],
      [
        465,
        164
      ],
      [
        167,
        22
      ],
      [
        187,
        183
      ],
      [
        313,
        177
      ],
      [
        233,
        220
      ],
      [
        164,
        289
      ],
      [
        237,
        165
      ],
      [
        211,
        153
      ],
      [
        102,
        241
      ],
      [
        199,
        352
      ],
      [
        199,
        276
      ],
      [
        90,
        301
      ],
      [
        179,
        22
      ],
      [
        199,
        50
      ],
      [
        179,
        213
      ],
      [
        102,
        186
      ],
      [
        177,
        187
      ],
      [
        292,
        219
      ],
      [
        160,
        38
      ],
      [
        167,
        212
      ],
      [
        207,
        154
      ],
      [
        292,
        166
      ],
      [
        195,
        531
      ],
      [
        105,
        161
      ],
      [
        184,
        247
      ],
      [
        179,
        93
      ],
      [
        237,
        394
      ],
      [
        184,
        166
      ],
      [
        177,
        238
      ],
      [
        195,
        201
      ],
      [
        263,
        179
      ],
      [
        195,
        190
      ],
      [
        601,
        11
      ],
      [
        197,
        247
      ],
      [
        169,
        447
      ],
      [
        417,
        250
      ],
      [
        292,
        178
      ],
      [
        431,
        159
      ],
      [
        195,
        325
      ],
      [
        255,
        228
      ],
      [
        313,
        219
      ],
      [
        237,
        384
      ],
      [
        310,
        232
      ],
      [
        207,
        342
      ],
      [
        201,
        179
      ],
      [
        122,
        63
      ],
      [
        178,
        161
      ],
      [
        164,
        205
      ],
      [
        187,
        154
      ],
      [
        217,
        207
      ],
      [
        535,
        535
      ],
      [
        247,
        247
      ],
      [
        254,
        7
      ],
      [
        233,
        198
      ],
      [
        238,
        122
      ],
      [
        23,
        7
      ],
      [
        93,
        1136
      ],
      [
        169,
        352
      ],
      [
        112,
        528
      ],
      [
        102,
        180
      ],
      [
        341,
        122
      ],
      [
        169,
        38
      ],
      [
        199,
        205
      ],
      [
        288,
        22
      ],
      [
        22,
        238
      ],
      [
        177,
        326
      ],
      [
        160,
        247
      ],
      [
        178,
        396
      ],
      [
        160,
        376
      ],
      [
        305,
        220
      ],
      [
        211,
        352
      ],
      [
        229,
        232
      ],
      [
        102,
        207
      ],
      [
        122,
        178
      ],
      [
        313,
        186
      ],
      [
        195,
        178
      ],
      [
        195,
        295
      ],
      [
        182,
        205
      ],
      [
        77,
        45
      ],
      [
        263,
        164
      ],
      [
        166,
        122
      ],
      [
        178,
        102
      ],
      [
        278,
        93
      ],
      [
        169,
        284
      ],
      [
        376,
        22
      ],
      [
        189,
        154
      ],
      [
        197,
        154
      ],
      [
        199,
        161
      ],
      [
        93,
        467
      ],
      [
        233,
        213
      ],
      [
        177,
        154
      ],
      [
        122,
        456
      ],
      [
        167,
        276
      ],
      [
        189,
        167
      ],
      [
        276,
        50
      ],
      [
        164,
        295
      ],
      [
        165,
        122
      ],
      [
        22,
        253
      ],
      [
        93,
        241
      ],
      [
        188,
        194
      ],
      [
        211,
        276
      ],
      [
        169,
        676
      ],
      [
        102,
        182
      ],
      [
        465,
        179
      ],
      [
        198,
        93
      ],
      [
        197,
        22
      ],
      [
        199,
        286
      ],
      [
        203,
        8
      ],
      [
        199,
        354
      ],
      [
        207,
        495
      ],
      [
        73,
        528
      ],
      [
        44,
        160
      ],
      [
        140,
        301
      ],
      [
        160,
        446
      ],
      [
        277,
        161
      ],
      [
        144,
        402
      ],
      [
        93,
        305
      ],
      [
        169,
        374
      ],
      [
        195,
        232
      ],
      [
        199,
        288
      ],
      [
        217,
        330
      ],
      [
        217,
        247
      ],
      [
        167,
        50
      ],
      [
        324,
        7
      ],
      [
        93,
        186
      ],
      [
        187,
        230
      ],
      [
        207,
        240
      ],
      [
        532,
        337
      ],
      [
        93,
        77
      ],
      [
        164,
        38
      ],
      [
        313,
        171
      ],
      [
        247,
        197
      ],
      [
        199,
        667
      ],
      [
        199,
        210
      ],
      [
        229,
        241
      ],
      [
        122,
        77
      ],
      [
        179,
        286
      ],
      [
        22,
        310
      ],
      [
        147,
        402
      ],
      [
        308,
        186
      ],
      [
        93,
        205
      ],
      [
        354,
        102
      ],
      [
        187,
        122
      ],
      [
        199,
        63
      ],
      [
        164,
        238
      ],
      [
        246,
        166
      ],
      [
        224,
        122
      ],
      [
        191,
        228
      ],
      [
        24,
        7
      ],
      [
        93,
        1229
      ],
      [
        601,
        12
      ],
      [
        219,
        312
      ],
      [
        1051,
        607
      ],
      [
        164,
        210
      ],
      [
        22,
        466
      ],
      [
        63,
