{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 2047,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2048,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2049,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2050,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2051,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2052,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2053,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.907515130932783
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.590856956007217
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.241558416743718
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.241558416743718
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.353903691571663
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.366489013165214
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.702538093392754
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.329957872276463
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.591017014899769
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.769029904280057
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.8101937622735775
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.177099041096813
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.911423655018851
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.771031408258509
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.59677219127256
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.33333168892325
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.083442433390498
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.894592622641527
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.736926261530499
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.2387105529822513
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -5.118333559326011
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -5.146323370971707
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.716003381935455
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -12.288211913410452
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -11.72040774979458
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.4610715973963
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.900076626721264
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -12.148664735908861
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.531460115228429
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -13.174154755921139
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.971063180973482
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -14.718938156882427
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -16.436295653667255
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.155626750102172
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -13.303948133541143
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -17.025799519632734
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.416962257115959
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.7172193317745936
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.826772550550789
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -13.235687806740136
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -13.930480407169629
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.521149540474728
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.322513970084277
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -16.01653613201004
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -11.960029611388327
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -12.449478807991644
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -12.734923053155875
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -12.062515206138519
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.664058764072013
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -14.549912092949747
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -14.689436882275636
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.76541136869755
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -14.332579673165974
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.626475282983254
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -11.753243449339475
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.806043108547433
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.856129138890353
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -13.334020364382319
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -14.048292690796627
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -11.587538238404383
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.286029108472803
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.388005593121722
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -13.014143550835588
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -13.12808589718438
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -14.87642970066371
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.856129138890353
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.595280973546467
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -13.410564425341224
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -10.122393402079535
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -10.127462021751038
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.644827994841243
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -13.043585328919244
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -10.632908013135506
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.983444914673527
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -14.634456749742085
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.810146052209593
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.97663564619065
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -12.479753290947643
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -12.470314927490637
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.904328906602316
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.4107591526621377
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -9.160277406416547
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -13.766973344645127
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -13.771066049377648
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.611826189714208
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -12.109056528312927
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.571371497303616
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -16.289989269615248
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.840840393971593
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -13.658203681098822
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.120806997490739
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.8140036581853
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -12.818015360893469
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -12.021998143686853
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.350767335831257
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.788141103949345
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -14.32772404030188
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -10.81944358504475
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.050759963145506
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.726647019486457
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -11.897909926700374
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -13.102055041027795
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.059001377500005
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -13.041482922848592
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.438981041832925
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -12.38691854368479
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.388951364804299
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -12.706625024821019
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -14.189578493031867
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -10.959144653898521
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.285087308830935
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -7.692064848865822
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -14.05894133651103
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -10.966175406779298
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -13.373615028871066
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -13.961171360970837
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -13.039190675446902
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -15.360738804150888
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -12.69444541183235
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -15.489146006770023
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -11.785380744833388
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -13.903866272636478
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.194659255679817
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -12.270538040346583
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -11.316156241279284
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -11.10159865272354
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -16.310994885788922
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -9.96453550919623
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -14.834867648798998
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -11.886808725039808
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -11.934937931975151
      },
      {
        "glyphs": [
          "["
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.527428604378313
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -20.349538612951353
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.771652826866113
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.4587963916928572
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8290386971646377
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.363208258848436
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.411594371491706
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -6.027799049828062
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -11.839163253172945
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.99688996033573
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.761707944680525
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.832503790167532
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -7.0135942620813445
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -7.0169068404230845
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.096901884805007
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.759388277445385
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.229480756740774
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.428447252517659
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.565272130059489
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.583926356116875
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.703922481924781
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.736858546885934
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.843167370047242
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.890109679614824
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.964549113392232
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.109292340566702
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.129735838990241
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.196672491303364
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.399997872373387
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.440185698663916
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.451970670925155
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.463090643564744
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.552991377028242
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.557054918286502
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.570355316883175
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.733701945420835
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.751830467960744
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.863850684938782
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.896181159131645
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.984419693433988
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.173015772590688
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.173038271028496
      },
      {
        "glyphs": [
          "H",
          "2",
          "+"
        ],
        "score": -10.223000842604248
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.252126236807657
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.305837337482313
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.381163510545788
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.389858420701165
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.425196912158375
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.431576642503137
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.452096827611651
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.45461894108596
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.543541032683445
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.56343250938257
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.700518926968375
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.812719332606965
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.830750239667537
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -10.84722910992261
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.885537981296636
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.900030644219681
      },
      {
        "glyphs": [
          "Pt",
          "+"
        ],
        "score": -10.949964607173126
      },
      {
        "glyphs": [
          "Si",
          "H",
          "2"
        ],
        "score": -11.084827178104948
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.10042184886931
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.141152452114794
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.165249828044757
      },
      {
        "glyphs": [
          "Zr",
          "+"
        ],
        "score": -11.22873679650987
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.280214973386792
      },
      {
        "glyphs": [
          "Si",
          "H",
          "3"
        ],
        "score": -11.366759396054483
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.367948918010224
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.394298396000616
      },
      {
        "glyphs": [
          "Mg",
          "+"
        ],
        "score": -11.440305913279543
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.461088225151451
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.488205284095013
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.564034128563964
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.574901263826161
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.580706138776577
      },
      {
        "glyphs": [
          "Ca",
          "+"
        ],
        "score": -11.622923532201868
      },
      {
        "glyphs": [
          "Fe",
          "+"
        ],
        "score": -11.656008368339847
      },
      {
        "glyphs": [
          "Zn",
          "+"
        ],
        "score": -11.723702461217774
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.734148390263009
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.738100064942367
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.739464604880478
      },
      {
        "glyphs": [
          "Cu",
          "+"
        ],
        "score": -11.745985188828021
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.761471746427702
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.777426679167347
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.803722220346222
      },
      {
        "glyphs": [
          "Ti",
          "+"
        ],
        "score": -11.808592072619337
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.808930599226928
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.814868695473955
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.879056355682257
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.891872821022531
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.98817434758684
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.047408355388193
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.06620997893983
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.079573970848193
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.080847969940738
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.088778974620444
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -12.092558495457745
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.10060874506052
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.106904537898483
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.135915617024315
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.144533206792014
      },
      {
        "glyphs": [
          "Pd",
          "+"
        ],
        "score": -12.161387391989706
      },
      {
        "glyphs": [
          "Ir",
          "+"
        ],
        "score": -12.179100544041395
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.184687382478087
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.225012302662535
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.237702497090874
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.23870788208496
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.240920151282813
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.245184821242514
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.24818349007239
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.312594978643503
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.341155030394244
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.342566896897942
      },
      {
        "glyphs": [
          "Ni",
          "+"
        ],
        "score": -12.345324331760668
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.356022629423443
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.366986095786809
      },
      {
        "glyphs": [
          "Ru",
          "+"
        ],
        "score": -12.402625313486396
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.431603525531298
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.436209634603015
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.44487822011479
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.460594017340535
      },
      {
        "glyphs": [
          "Al",
          "+"
        ],
        "score": -12.461802387463832
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.469093075522538
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.47739522398663
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.49269826006246
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.511342976457193
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.524517967341158
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.543708689632197
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.54858373804589
      },
      {
        "glyphs": [
          "Co",
          "+"
        ],
        "score": -12.553497710716847
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.58567611279401
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.590523136506972
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.59503218922308
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.635460767058936
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.639988654222138
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.648637687725394
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.671463527815533
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.682409007535135
      },
      {
        "glyphs": [
          "Al",
          "H",
          "3"
        ],
        "score": -12.73451590755948
      },
      {
        "glyphs": [
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.745227410817307
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.762215632509944
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.782926774270393
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.809643517655116
      },
      {
        "glyphs": [
          "Au",
          "+"
        ],
        "score": -12.809829730642427
      },
      {
        "glyphs": [
          "Ba",
          "+"
        ],
        "score": -12.81010169968426
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.813374926744771
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.83661383281687
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.858520443432374
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.87252764225603
      },
      {
        "glyphs": [
          "N",
          "=",
          "N",
          "N"
        ],
        "score": -12.87334661597842
      },
      {
        "glyphs": [
          "1",
          "8",
          "F"
        ],
        "score": -12.875183602413362
      },
      {
        "glyphs": [
          "Sn",
          "+"
        ],
        "score": -12.885725001194032
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.936277924709252
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "N"
        ],
        "score": -12.952213552383753
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.976468528758486
      },
      {
        "glyphs": [
          "Mn",
          "+"
        ],
        "score": -12.987585165157464
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -12.988117325906297
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -13.016681034277104
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -13.048854144724286
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.056276541917986
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N"
        ],
        "score": -13.057905433858684
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.062255747380474
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.06980717435484
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.072808050197137
      },
      {
        "glyphs": [
          "N",
          "=",
          "P"
        ],
        "score": -13.07647386529148
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.099381577402013
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -13.118044812092158
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.125467590397047
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.12599325599599
      },
      {
        "glyphs": [
          "W",
          "+"
        ],
        "score": -13.133284073629705
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.141889211124836
      },
      {
        "glyphs": [
          "O",
          "=",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -13.148007988637662
      },
      {
        "glyphs": [
          "I",
          "I"
        ],
        "score": -13.160510342971603
      },
      {
        "glyphs": [
          "Hf",
          "+"
        ],
        "score": -13.168535980433212
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -13.189443632219218
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -13.201756960774562
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.216722929936267
      },
      {
        "glyphs": [
          "Cr",
          "+"
        ],
        "score": -13.235520476461168
      },
      {
        "glyphs": [
          "P",
          "P"
        ],
        "score": -13.237193783576796
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "P"
        ],
        "score": -13.26380782259242
      },
      {
        "glyphs": [
          "c",
          "n",
          "s",
          "n"
        ],
        "score": -13.264114157078634
      },
      {
        "glyphs": [
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C"
        ],
        "score": -13.29919449830035
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.30598596800557
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -13.30875599731594
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.315200009647718
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "o"
        ],
        "score": -13.318971418753264
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -13.330859334471914
      },
      {
        "glyphs": [
          "=",
          "N",
