{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 511,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 512,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 513,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -10.813287484477405
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -12.200208677118148
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.215395422228047
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.215395422228047
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -7.268135649819822
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -6.1067427520462765
      },
      {
        "glyphs": [
          "."
        ],
        "score": -9.03557836365273
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -4.51288464971395
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -9.540251806225852
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -3.255645580498353
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.413897499293622
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.873075150304036
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.547446716014555
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.335631701568948
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.039658225356158
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -6.754176560561529
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.605025523240023
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.563434693361486
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.0545479457594595
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -3.292816964377403
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -3.3900349636311535
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -16.717173583102156
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -14.835724622415903
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -12.680613866543425
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -16.13384024976882
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -12.261819511589067
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -17.217173583102152
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -15.767173583102155
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -7.698091352646143
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.279894292590928
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.504780695216636
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -16.717173583102156
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -7.034474946402147
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -14.186916448853257
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -16.132927186031576
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -15.287480190035417
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -9.853613767286781
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -13.676125381103331
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -15.767173583102155
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -15.38820532908236
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -2.83667648084937
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -14.66868326932629
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -16.13384024976882
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -10.23896666216825
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -16.717108698479194
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -12.530985202117883
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -15.499316440195948
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -17.21717351548369
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.93792772496376
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -16.383092070177934
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -15.767173583102155
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -4.234760753728077
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -9.894305966921259
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -16.38313349395597
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.320182103298288
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -10.008045371997596
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -16.38384024976882
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -16.38384024976882
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -16.717173583102152
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -6.988494309082517
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -15.93384024976882
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -13.128369193783245
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -11.08959203888673
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -16.717173583102156
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -16.716384587401006
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -15.93384024976882
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -16.38384024976882
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -16.13384024976882
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.214834908847394
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -14.526360332832116
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -16.13384024976882
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.217173583102156
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -15.498604377443979
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.217173583102156
      },
      {
        "glyphs": [
          "["
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -5.362390533412508
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -18.24611855825031
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -2.84834688275202
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -5.688638605443954
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -8.073285407438568
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -17.21717352469083
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -8.885828906283917
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -15.624316440205051
      },
      {
        "glyphs": [
          "c",
          "c",
          "c"
        ],
        "score": -5.013983434013152
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -5.617613431896739
      },
      {
        "glyphs": [
          "o",
          "c"
        ],
        "score": -6.545606888634939
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -6.952246771729538
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.301839179722405
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.329067470307317
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -7.531421053633592
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.921794619714166
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.000473492715836
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -8.164603352443411
      },
      {
        "glyphs": [
          "C",
          "#",
          "C"
        ],
        "score": -8.177908527062014
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.308182604417139
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.376614235439085
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.464255608187395
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.559616771299247
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "c"
        ],
        "score": -8.56511915276282
      },
      {
        "glyphs": [
          "c",
          "n",
          "c"
        ],
        "score": -8.63841575969924
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.705187346366198
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.890929420836034
      },
      {
        "glyphs": [
          "c",
          "o",
          "c"
        ],
        "score": -8.939312963640347
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -9.029881841987368
      },
      {
        "glyphs": [
          "%",
          "1"
        ],
        "score": -9.032080542508817
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.08934383896956
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "o"
        ],
        "score": -9.20751588065474
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "n"
        ],
        "score": -9.376573914229139
      },
      {
        "glyphs": [
          "n",
          "n"
        ],
        "score": -9.415136830027013
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "s"
        ],
        "score": -9.509458669216597
      },
      {
        "glyphs": [
          "c",
          "s",
          "c"
        ],
        "score": -9.595648896870964
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "c"
        ],
        "score": -9.616278942007389
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -9.735493420531668
      },
      {
        "glyphs": [
          "N",
          "S"
        ],
        "score": -9.9417927143346
      },
      {
        "glyphs": [
          "n",
          "o"
        ],
        "score": -9.957980150930554
      },
      {
        "glyphs": [
          "n",
          "n",
          "c"
        ],
        "score": -9.972068976412281
      },
      {
        "glyphs": [
          "n",
          "c",
          "n"
        ],
        "score": -9.980843831108457
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "c"
        ],
        "score": -10.145707432111355
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -10.163674360831138
      },
      {
        "glyphs": [
          "c",
          "c",
          "n"
        ],
        "score": -10.191502482349176
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -10.299524960939902
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -10.401497895355915
      },
      {
        "glyphs": [
          "S",
          "S"
        ],
        "score": -10.512511044571097
      },
      {
        "glyphs": [
          "C",
          "S",
          "S"
        ],
        "score": -10.522317460767141
      },
      {
        "glyphs": [
          "o",
          "n"
        ],
        "score": -10.66056792661308
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.743045253583734
      },
      {
        "glyphs": [
          "o",
          "c",
          "c",
          "c"
        ],
        "score": -10.752700964057777
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.792695391446177
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.800421644888036
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.838901026964498
      },
      {
        "glyphs": [
          "S",
          "S",
          "C"
        ],
        "score": -10.94579933568074
      },
      {
        "glyphs": [
          "c",
          "c",
          "s"
        ],
        "score": -10.989499178854642
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.07879894369597
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -11.095412161987245
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.118319050296893
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.237089922986915
      },
      {
        "glyphs": [
          "c",
          "n",
          "n"
        ],
        "score": -11.245974306019072
      },
      {
        "glyphs": [
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -11.291612007613864
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -11.343363985669809
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "c"
        ],
        "score": -11.35347729768187
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -11.357700115987654
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.362047417932457
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.523989980976037
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.534049108815097
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -11.56709528655602
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -11.59810144632845
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "="
        ],
        "score": -11.627168970351411
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.640044780235709
      },
      {
        "glyphs": [
          "o",
          "n",
          "c"
        ],
        "score": -11.683710719793071
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.74579974825798
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -11.769602481617834
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.77373489499347
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.83523480081536
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -11.927282121263232
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -11.989748017844711
      },
      {
        "glyphs": [
          "c",
          "c",
          "s",
          "c"
        ],
        "score": -11.999598547394818
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.056077890928865
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.202126482220251
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "n"
        ],
        "score": -12.223063331991517
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.303523478398716
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.536588670824782
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -12.567124892837402
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "o"
        ],
        "score": -12.57703332625416
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.629097126301914
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.664803759714935
      },
      {
        "glyphs": [
          "Fe",
          "+"
        ],
        "score": -12.69501067477971
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "N",
          "="
        ],
        "score": -12.753082869893145
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "n"
        ],
        "score": -12.793338292873575
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.797592505469348
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.800872057170611
      },
      {
        "glyphs": [
          "S",
          "S",
          "S"
        ],
        "score": -12.84822396083219
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "N",
          "C"
        ],
        "score": -12.851361112049382
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.868042529775607
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.87087280880699
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "N"
        ],
        "score": -12.89548308523278
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.89865197682353
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.906852127212613
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.95191514490092
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -12.952959801239942
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.957923433279811
      },
      {
        "glyphs": [
          "S",
          "S",
          "S",
          "S"
        ],
        "score": -13.11456026069904
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.1297101872703
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -13.136518748485097
      },
      {
        "glyphs": [
          "c",
          "n",
          "n",
          "n"
        ],
        "score": -13.168551645445476
      },
      {
        "glyphs": [
          "c",
          "c",
          "n",
          "o"
        ],
        "score": -13.17088738904786
      },
      {
        "glyphs": [
          "s",
          "n",
          "n"
        ],
        "score": -13.278264886248849
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S"
        ],
        "score": -13.29072216567694
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -13.32886953162602
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.335175146421893
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -13.388616802670352
      },
      {
        "glyphs": [
          "Mg",
          "+"
        ],
        "score": -13.428243118092883
      },
      {
        "glyphs": [
          "N",
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.458984776279241
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.47695148489476
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -13.481194214047484
      },
      {
        "glyphs": [
          "o",
          "c",
          "n",
          "c"
        ],
        "score": -13.489263275364891
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.52794799359452
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.554512317756362
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -13.559834136303113
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.570736677117264
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -13.608291762262372
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -13.629815842942214
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.641374359601262
      },
      {
        "glyphs": [
          "s",
          "n",
          "c"
        ],
        "score": -13.653927918140198
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -13.669049980263761
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S",
          "S",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.690807609851237
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -13.701698427735765
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "S",
          "C"
        ],
        "score": -13.708892545322781
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.714646268630853
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -13.747427751309647
      },
      {
        "glyphs": [
          "s",
          "s",
          "c"
        ],
        "score": -13.751690547187055
      },
      {
        "glyphs": [
          "n",
          "s",
          "c"
        ],
        "score": -13.775571178444315
      },
      {
        "glyphs": [
          "o",
          "n",
          "c",
          "c"
        ],
        "score": -13.791344938469294
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -13.792176626752287
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -13.80734908990923
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.847333118606675
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -13.868229364211695
      },
      {
        "glyphs": [
          "n",
          "n",
          "s"
        ],
        "score": -13.88945384403857
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -13.901066809017749
      },
      {
        "glyphs": [
          "S",
          "=",
          "C",
          "=",
          "N"
        ],
        "score": -13.944287455171995
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "c"
        ],
        "score": -13.972941511691209
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "=",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.03214032629332
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -14.060286909815195
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -14.062501092328334
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.098332706950517
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -14.108362323795475
      },
      {
        "glyphs": [
          "S",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.127515169750211
      },
      {
        "glyphs": [
          "c",
          "c",
          "o",
          "n"
        ],
        "score": -14.131599455061622
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -14.146835580784945
      },
      {
        "glyphs": [
          "s",
          "c",
          "n"
        ],
        "score": -14.206009749066906
      },
      {
        "glyphs": [
          "Ni",
          "+"
        ],
        "score": -14.22226812040135
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -14.224934205501802
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.276004100915403
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.288759097564352
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -14.325198230897808
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -14.341795161481242
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -14.353643284251309
      },
      {
        "glyphs": [
          "o",
          "n",
          "n",
          "c"
        ],
        "score": -14.362100175921274
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -14.39883392983312
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -14.407206123786448
      },
      {
        "glyphs": [
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -14.450034451755377
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -14.45750305570053
      },
      {
        "glyphs": [
          "Zn",
          "+"
        ],
        "score": -14.483140008634672
      },
      {
        "glyphs": [
          "Co",
          "+"
        ],
        "score": -14.483839994177256
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.486671193397186
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.49274482140223
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.504691223790878
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -14.528047344495665
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -14.572006011773103
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -14.619772016187145
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -14.630064081534371
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "#",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -14.632593686241616
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
