{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 255,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 256,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 257,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 258,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 259,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 260,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 261,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.87107790112239
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.557684445377598
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.208385906114099
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.208385906114099
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.320731180942044
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.28098996342305
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.819246463593295
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.296785361646844
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.55784450427015
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.725829413961792
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.776867457154893
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.1631126666782485
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8800848464140323
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.736968780131058
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.563221714427822
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.3000488036736595
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.050055038367388
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.854176532708406
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.699444944858127
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.2004097863450696
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -11.318037937168588
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -11.346399513105288
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.682830871305836
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -12.255039402780834
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -19.317865034239325
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.427899086766683
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.866904116091645
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -18.651729567509285
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -15.49828760459881
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -12.249127261230283
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.929044087054244
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -12.638621799251489
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -14.15100704923401
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.122454239472553
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -12.63875365579157
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -16.992627009003115
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.3837363552943405
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.755385039990017
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -13.79405758077797
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -13.202515296110516
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -13.35437069296417
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.48797702984511
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.290628821952417
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -15.983363621380418
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -18.330874946372642
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -12.040821057816498
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -12.701750542526252
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -12.016104524419413
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.630886253442394
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -14.516739582320128
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -14.656264371646017
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.73223885806793
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -13.711334665009879
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.593041189196679
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -18.330879202824235
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.772870597917814
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.822956628260734
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -12.9310396149535
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -13.2158115031288
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -18.966704225857107
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.471088491980552
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.354833082492103
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -12.361993408863691
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -12.781377869261846
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -14.843257190034091
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.822956628260734
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.54842566603644
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -12.828075326849024
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.707284226867646
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -18.96670426976561
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.611655484211624
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -13.010412818289625
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -18.185183702683002
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.950272404043908
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -14.53589558698021
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.776973541579974
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -13.944690622737388
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -19.31787034947112
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -12.225211543219364
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.871156395972697
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.372647963431021
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -19.31787044108548
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -13.450260945934716
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -13.737893538748029
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.57865367908459
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -11.493888115122372
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.538198986673997
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -16.25681675898563
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.827011240235784
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -13.066857213257098
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.085060045851776
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.78083114755568
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -12.561753544341746
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.54909104792291
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.31759482520164
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -15.25441682770273
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -14.03425489318579
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -18.501478795804157
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.017587452515887
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.693474508856838
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -18.89527553954504
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -13.068882530398175
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.025828866870386
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -12.645368749032029
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.405808531203306
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -11.655068657672693
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.3489532221886265
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -12.391520716300153
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -14.15640598240225
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -18.29241780825058
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.251914798201316
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -18.456023837099114
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -14.020508972601348
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -18.70728522488286
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -13.340442518241451
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -13.659511544376405
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -12.89905635534127
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -14.112281178766686
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -12.525780599043193
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -14.915114709983694
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -19.317870253754435
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -13.641378681476155
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -15.1614867450502
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -19.317870352539646
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -19.217870174882417
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -16.05704024973352
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -17.60879346800144
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -14.185703163824211
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -18.370879207259993
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.08834209985992
      },
      {
        "glyphs": [
          "["
        ],
        "score": -5.857478076978648
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.494256093748694
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -3.8981552324604962
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.035853188640065
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.6646547218894696
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8943702894993883
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.3249584986533876
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.041183718297573
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.983138273132296
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -20.31351338928672
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -4.587784380453041
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -5.087930093431922
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -5.11596037737511
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.896219699852182
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.2520487796348885
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -6.654724934974128
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.702670348701103
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.764340758505108
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -6.903350981665703
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -6.929358508782771
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.03148752061691
      },
      {
        "glyphs": [
          "[",
          "2",
          "H"
        ],
        "score": -7.183115150918514
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.630269657241598
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -7.631310497587108
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.157232455432727
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.335500580190278
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.521466611827286
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.555847078687648
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.633470474680955
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.6422282607443
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.6994512698481
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.853704057548848
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.861303389457376
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.037111247137215
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.06887384703324
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.12714436247209
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.142063218259228
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.197622940649905
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.200040117299466
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.278842938538148
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.299453633024957
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.372141753909755
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.439415806252363
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.458217568661816
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.505263979846173
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.532879573253402
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "2"
        ],
        "score": -9.579381881273283
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.682880818619447
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.689163159782847
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "3"
        ],
        "score": -9.694081143622473
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.808781645106778
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.8853395561626
      },
      {
        "glyphs": [
          "[",
          "Y"
        ],
        "score": -9.931522678164617
      },
      {
        "glyphs": [
          "[",
          "Ir"
        ],
        "score": -9.969046438584426
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -10.094434870176183
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.09749717010203
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.133435608493887
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.134026291891244
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.16676442844016
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -10.167566082406179
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.212700720352508
      },
      {
        "glyphs": [
          "[",
          "N",
          "H",
          "2"
        ],
        "score": -10.221128730685654
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.255509656799351
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.256129895674444
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -10.334817107853903
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.389598949267294
      },
      {
        "glyphs": [
          "[",
          "Li"
        ],
        "score": -10.600251980391283
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.628915053656833
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.685824250412995
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -10.733705989574439
      },
      {
        "glyphs": [
          "[",
          "Sn"
        ],
        "score": -10.756925380121698
      },
      {
        "glyphs": [
          "[",
          "Pt"
        ],
        "score": -10.786491962841989
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -10.814940810249777
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.826168135247546
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.863967572833456
      },
      {
        "glyphs": [
          "[",
          "Se"
        ],
        "score": -10.897698332346504
      },
      {
        "glyphs": [
          "[",
          "Pt",
          "+"
        ],
        "score": -10.917060386828568
      },
      {
        "glyphs": [
          "[",
          "W"
        ],
        "score": -10.945478188381864
      },
      {
        "glyphs": [
          "[",
          "Al"
        ],
        "score": -10.954589806552768
      },
      {
        "glyphs": [
          "[",
          "S",
          "-"
        ],
        "score": -10.957517923568014
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.062384263973472
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.145543524261457
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.159652291341628
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.170536056695976
      },
      {
        "glyphs": [
          "[",
          "V"
        ],
        "score": -11.185660298982837
      },
      {
        "glyphs": [
          "[",
          "Zr",
          "+"
        ],
        "score": -11.19568971563712
      },
      {
        "glyphs": [
          "[",
          "P",
          "H"
        ],
        "score": -11.284428664253705
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.3177031301103
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -11.369334188246329
      },
      {
        "glyphs": [
          "[",
          "Mg",
          "+"
        ],
        "score": -11.40703630351571
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.419473814813545
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.427414993775574
      },
      {
        "glyphs": [
          "[",
          "Ge"
        ],
        "score": -11.472300905694977
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.486683827222667
      },
      {
        "glyphs": [
          "[",
          "Ca",
          "+"
        ],
        "score": -11.589700532184654
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.62176335387294
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -11.623594861366831
      },
      {
        "glyphs": [
          "[",
          "Zn",
          "+"
        ],
        "score": -11.691016294965511
      },
      {
        "glyphs": [
          "[",
          "Cu",
          "+"
        ],
        "score": -11.712038153634637
      },
      {
        "glyphs": [
          "[",
          "Fe"
        ],
        "score": -11.720606855304133
      },
      {
        "glyphs": [
          "[",
          "Ti"
        ],
        "score": -11.752600787887948
      },
      {
        "glyphs": [
          "[",
          "se"
        ],
        "score": -11.805990742569529
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -12.192360480046565
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -12.214372309451333
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.269451960987668
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.796393856578222
      },
      {
        "glyphs": [
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C",
          "=",
          "C"
        ],
        "score": -13.260717107322352
      }
    ]
  }
}