{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        45,
        45
      ],
      [
        148,
        45
      ],
      [
        71,
        150
      ],
      [
        153,
        153
      ],
      [
        160,
        23
      ],
      [
        160,
        24
      ],
      [
        163,
        161
      ],
      [
        22,
        102
      ],
      [
        164,
        161
      ],
      [
        159,
        159
      ],
      [
        102,
        45
      ],
      [
        22,
        45
      ],
      [
        162,
        153
      ],
      [
        45,
        170
      ],
      [
        45,
        102
      ],
      [
        168,
        168
      ],
      [
        163,
        150
      ],
      [
        164,
        150
      ],
      [
        159,
        45
      ],
      [
        93,
        45
      ],
      [
        162,
        171
      ],
      [
        45,
        169
      ],
      [
        45,
        153
      ],
      [
        173,
        153
      ],
      [
        22,
        159
      ],
      [
        155,
        153
      ],
      [
        168,
        45
      ],
      [
        8,
        153
      ],
      [
        154,
        153
      ],
      [
        45,
        93
      ],
      [
        174,
        174
      ],
      [
        102,
        153
      ],
      [
        162,
        162
      ],
      [
        148,
        154
      ],
      [
        192,
        161
      ],
      [
        102,
        159
      ],
      [
        102,
        170
      ],
      [
        159,
        93
      ],
      [
        159,
        153
      ],
      [
        168,
        159
      ],
      [
        93,
        153
      ],
      [
        7,
        150
      ],
      [
        168,
        177
      ],
      [
        159,
        170
      ],
      [
        22,
        93
      ],
      [
        22,
        177
      ],
      [
        148,
        93
      ],
      [
        93,
        170
      ],
      [
        8,
        150
      ],
      [
        45,
        183
      ],
      [
        148,
        102
      ],
      [
        45,
        178
      ],
      [
        209,
        207
      ],
      [
        205,
        200
      ],
      [
        174,
        45
      ],
      [
        177,
        93
      ],
      [
        169,
        102
      ],
      [
        45,
        166
      ],
      [
        45,
        1
      ],
      [
        45,
        122
      ],
      [
        174,
        185
      ],
      [
        174,
        177
      ],
      [
        159,
        102
      ],
      [
        173,
        105
      ],
      [
        159,
        169
      ],
      [
        189,
        45
      ],
      [
        189,
        185
      ],
      [
        174,
        168
      ],
      [
        93,
        159
      ],
      [
        174,
        201
      ],
      [
        153,
        154
      ],
      [
        174,
        198
      ],
      [
        162,
        184
      ],
      [
        174,
        159
      ],
      [
        153,
        184
      ],
      [
        122,
        45
      ],
      [
        159,
        178
      ],
      [
        22,
        153
      ],
      [
        153,
        187
      ],
      [
        189,
        177
      ],
      [
        169,
        153
      ],
      [
        45,
        154
      ],
      [
        171,
        187
      ],
      [
        189,
        159
      ],
      [
        178,
        153
      ],
      [
        159,
        1
      ],
      [
        154,
        154
      ],
      [
        159,
        172
      ],
      [
        204,
        204
      ],
      [
        102,
        236
      ],
      [
        159,
        194
      ],
      [
        162,
        187
      ],
      [
        102,
        122
      ],
      [
        3,
        12
      ],
      [
        162,
        154
      ],
      [
        157,
        153
      ],
      [
        159,
        173
      ],
      [
        217,
        45
      ],
      [
        22,
        178
      ],
      [
        93,
        197
      ],
      [
        172,
        153
      ],
      [
        177,
        178
      ],
      [
        168,
        93
      ],
      [
        22,
        122
      ],
      [
        171,
        155
      ],
      [
        159,
        190
      ],
      [
        177,
        153
      ],
      [
        102,
        105
      ],
      [
        93,
        177
      ],
      [
        169,
        170
      ],
      [
        171,
        157
      ],
      [
        217,
        93
      ],
      [
        102,
        102
      ],
      [
        170,
        102
      ],
      [
        252,
        11
      ],
      [
        189,
        198
      ],
      [
        22,
        168
      ],
      [
        189,
        168
      ],
      [
        191,
        154
      ],
      [
        192,
        200
      ],
      [
        194,
        93
      ],
      [
        194,
        102
      ],
      [
        153,
        254
      ],
      [
        187,
        187
      ],
      [
        154,
        162
      ],
      [
        205,
        23
      ],
      [
        194,
        153
      ],
      [
        244,
        45
      ],
      [
        205,
        24
      ],
      [
        217,
        159
      ],
      [
        183,
        153
      ],
      [
        173,
        159
      ],
      [
        253,
        162
      ],
      [
        154,
        171
      ],
      [
        148,
        94
      ],
      [
        293,
        200
      ],
      [
        122,
        122
      ],
      [
        154,
        187
      ],
      [
        170,
        153
      ],
      [
        154,
        155
      ],
      [
        218,
        234
      ],
      [
        45,
        203
      ],
      [
        148,
        155
      ],
      [
        301,
        200
      ],
      [
        155,
        162
      ],
      [
        189,
        201
      ],
      [
        8,
        154
      ],
      [
        93,
        122
      ],
      [
        22,
        213
      ],
      [
        154,
        184
      ],
      [
        22,
        199
      ],
      [
        159,
        183
      ],
      [
        187,
        154
      ],
      [
        218,
        45
      ],
      [
        159,
        154
      ],
      [
        71,
        200
      ],
      [
        183,
        170
      ],
      [
        148,
        122
      ],
      [
        218,
        122
      ],
      [
        204,
        22
      ],
      [
        284,
        150
      ],
      [
        153,
        157
      ],
      [
        218,
        153
      ],
      [
        93,
        168
      ],
      [
        173,
        196
      ],
      [
        218,
        159
      ],
      [
        93,
        1
      ],
      [
        45,
        204
      ],
      [
        168,
        153
      ],
      [
        45,
        22
      ],
      [
        159,
        122
      ],
      [
        287,
        150
      ],
      [
        188,
        153
      ],
      [
        159,
        166
      ],
      [
        252,
        12
      ],
      [
        177,
        247
      ],
      [
        188,
        159
      ],
      [
        102,
        22
      ],
      [
        210,
        153
      ],
      [
        153,
        8
      ],
      [
        155,
        171
      ],
      [
        159,
        234
      ],
      [
        173,
        122
      ],
      [
        45,
        50
      ],
      [
        172,
        102
      ],
      [
        180,
        153
      ],
      [
        93,
        196
      ],
      [
        168,
        181
      ],
      [
        102,
        177
      ],
      [
        155,
        154
      ],
      [
        148,
        105
      ],
      [
        188,
        170
      ],
      [
        192,
        314
      ],
      [
        287,
        200
      ],
      [
        168,
        178
      ],
      [
        208,
        93
      ],
      [
        177,
        169
      ],
      [
        247,
        22
      ],
      [
        196,
        159
      ],
      [
        284,
        200
      ],
      [
        177,
        206
      ],
      [
        154,
        191
      ],
      [
        122,
        153
      ],
      [
        93,
        214
      ],
      [
        183,
        93
      ],
      [
        244,
        181
      ],
      [
        93,
        236
      ],
      [
        122,
        234
      ],
      [
        194,
        170
      ],
      [
        168,
        102
      ],
      [
        244,
        159
      ],
      [
        170,
        93
      ],
      [
        169,
        93
      ],
      [
        102,
        262
      ],
      [
        173,
        242
      ],
      [
        178,
        166
      ],
      [
        172,
        93
      ],
      [
        208,
        170
      ],
      [
        153,
        155
      ],
      [
        318,
        198
      ],
      [
        208,
        153
      ],
      [
        122,
        159
      ],
      [
        229,
        154
      ],
      [
        93,
        203
      ],
      [
        325,
        181
      ],
      [
        45,
        236
      ],
      [
        203,
        102
      ],
      [
        194,
        173
      ],
      [
        283,
        157
      ],
      [
        148,
        127
      ],
      [
        203,
        93
      ],
      [
        388,
        150
      ],
      [
        217,
        181
      ],
      [
        183,
        183
      ],
      [
        173,
        235
      ],
      [
        171,
        154
      ],
      [
        168,
        169
      ],
      [
        209,
        200
      ],
      [
        217,
        286
      ],
      [
        22,
        185
      ],
      [
        183,
        169
      ],
      [
        159,
        182
      ],
      [
        196,
        170
      ],
      [
        198,
        247
      ],
      [
        229,
        253
      ],
      [
        1,
        45
      ],
      [
        316,
        200
      ],
      [
        93,
        221
      ],
      [
        194,
        194
      ],
      [
        170,
        169
      ],
      [
        245,
        187
      ],
      [
        229,
        162
      ],
      [
        188,
        122
      ],
      [
        217,
        244
      ],
      [
        93,
        93
      ],
      [
        195,
        153
      ],
      [
        93,
        185
      ],
      [
        24,
        150
      ],
      [
        196,
        153
      ],
      [
        160,
        207
      ],
      [
        1,
        93
      ],
      [
        162,
        254
      ],
      [
        169,
        169
      ],
      [
        349,
        416
      ],
      [
        316,
        23
      ],
      [
        245,
        245
      ],
      [
        102,
        169
      ],
      [
        203,
        159
      ],
      [
        173,
        177
      ],
      [
        45,
        44
      ],
      [
        50,
        153
      ],
      [
        22,
        201
      ],
      [
        189,
        174
      ],
      [
        122,
        235
      ],
      [
        169,
        166
      ],
      [
        316,
        24
      ],
      [
        204,
        93
      ],
      [
        93,
        198
      ],
      [
        349,
        23
      ],
      [
        244,
        244
      ],
      [
        336,
        105
      ],
      [
        102,
        242
      ],
      [
        437,
        150
      ],
      [
        45,
        275
      ],
      [
        205,
        314
      ],
      [
        334,
        356
      ],
      [
        173,
        214
      ],
      [
        162,
        8
      ],
      [
        325,
        45
      ],
      [
        148,
        13
      ],
      [
        257,
        183
      ],
      [
        13,
        150
      ],
      [
        93,
        265
      ],
      [
        168,
        197
      ],
      [
        217,
        177
      ],
      [
        183,
        190
      ],
      [
        227,
        173
      ],
      [
        317,
        159
      ],
      [
        187,
        8
      ],
      [
        174,
        307
      ],
      [
        210,
        93
      ],
      [
        448,
        161
      ],
      [
        155,
        187
      ],
      [
        402,
        318
      ],
      [
        160,
        200
      ],
      [
        93,
        102
      ],
      [
        252,
        13
      ],
      [
        201,
        153
      ],
      [
        168,
        190
      ],
      [
        213,
        22
      ],
      [
        363,
        22
      ],
      [
        1,
        159
      ],
      [
        247,
        204
      ],
      [
        237,
        187
      ],
      [
        185,
        178
      ],
      [
        102,
        168
      ],
      [
        177,
        154
      ],
      [
        168,
        170
      ],
      [
        172,
        170
      ],
      [
        208,
        178
      ],
      [
        235,
        153
      ],
      [
        322,
        178
      ],
      [
        148,
        50
      ],
      [
        208,
        183
      ],
      [
        102,
        93
      ],
      [
        227,
        154
      ],
      [
        227,
        122
      ],
      [
        227,
        178
      ],
      [
        206,
        262
      ],
      [
        198,
        356
      ],
      [
        292,
        154
      ],
      [
        237,
        154
      ],
      [
        244,
        173
      ],
      [
        423,
        200
      ],
      [
        434,
        200
      ],
      [
        160,
        150
      ],
      [
        93,
        178
      ],
      [
        217,
        197
      ],
      [
        290,
        154
      ],
      [
        183,
        102
      ],
      [
        217,
        196
      ],
      [
        169,
        178
      ],
      [
        174,
        378
      ],
      [
        159,
        295
      ],
      [
        154,
        253
      ],
      [
        153,
        303
      ],
      [
        174,
        153
      ],
      [
        188,
        197
      ],
      [
        204,
        307
      ],
      [
        481,
        207
      ],
      [
        183,
        257
      ],
      [
        218,
        177
      ],
      [
        93,
        261
      ],
      [
        148,
        153
      ],
      [
        172,
        169
      ]
    ]
  }
}