{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1026,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1027,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1028,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1029,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1030,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1031,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        45,
        45
      ],
      [
        153,
        153
      ],
      [
        45,
        23
      ],
      [
        45,
        24
      ],
      [
        161,
        71
      ],
      [
        22,
        102
      ],
      [
        162,
        71
      ],
      [
        159,
        159
      ],
      [
        102,
        45
      ],
      [
        22,
        45
      ],
      [
        160,
        153
      ],
      [
        45,
        168
      ],
      [
        45,
        102
      ],
      [
        166,
        166
      ],
      [
        159,
        45
      ],
      [
        93,
        45
      ],
      [
        160,
        169
      ],
      [
        45,
        167
      ],
      [
        45,
        153
      ],
      [
        171,
        153
      ],
      [
        22,
        159
      ],
      [
        155,
        153
      ],
      [
        166,
        45
      ],
      [
        8,
        153
      ],
      [
        154,
        153
      ],
      [
        45,
        93
      ],
      [
        172,
        172
      ],
      [
        102,
        153
      ],
      [
        160,
        160
      ],
      [
        154,
        71
      ],
      [
        102,
        159
      ],
      [
        102,
        168
      ],
      [
        159,
        93
      ],
      [
        159,
        153
      ],
      [
        166,
        159
      ],
      [
        93,
        153
      ],
      [
        166,
        173
      ],
      [
        159,
        168
      ],
      [
        22,
        93
      ],
      [
        22,
        173
      ],
      [
        93,
        168
      ],
      [
        45,
        179
      ],
      [
        45,
        174
      ],
      [
        102,
        8
      ],
      [
        93,
        7
      ],
      [
        172,
        45
      ],
      [
        173,
        93
      ],
      [
        167,
        102
      ],
      [
        45,
        164
      ],
      [
        45,
        1
      ],
      [
        45,
        122
      ],
      [
        172,
        181
      ],
      [
        172,
        173
      ],
      [
        159,
        102
      ],
      [
        171,
        105
      ],
      [
        159,
        167
      ],
      [
        185,
        45
      ],
      [
        185,
        181
      ],
      [
        172,
        166
      ],
      [
        93,
        159
      ],
      [
        172,
        195
      ],
      [
        153,
        154
      ],
      [
        172,
        193
      ],
      [
        160,
        180
      ],
      [
        172,
        159
      ],
      [
        153,
        180
      ],
      [
        122,
        45
      ],
      [
        159,
        174
      ],
      [
        22,
        153
      ],
      [
        153,
        183
      ],
      [
        185,
        173
      ],
      [
        167,
        153
      ],
      [
        45,
        154
      ],
      [
        169,
        183
      ],
      [
        185,
        159
      ],
      [
        174,
        153
      ],
      [
        159,
        1
      ],
      [
        154,
        154
      ],
      [
        159,
        170
      ],
      [
        198,
        198
      ],
      [
        102,
        227
      ],
      [
        159,
        189
      ],
      [
        160,
        183
      ],
      [
        102,
        122
      ],
      [
        3,
        12
      ],
      [
        160,
        154
      ],
      [
        157,
        153
      ],
      [
        159,
        171
      ],
      [
        208,
        45
      ],
      [
        22,
        174
      ],
      [
        93,
        192
      ],
      [
        170,
        153
      ],
      [
        173,
        174
      ],
      [
        166,
        93
      ],
      [
        22,
        122
      ],
      [
        169,
        155
      ],
      [
        159,
        186
      ],
      [
        173,
        153
      ],
      [
        102,
        105
      ],
      [
        93,
        173
      ],
      [
        167,
        168
      ],
      [
        169,
        157
      ],
      [
        208,
        93
      ],
      [
        102,
        102
      ],
      [
        168,
        102
      ],
      [
        243,
        11
      ],
      [
        185,
        193
      ],
      [
        22,
        166
      ],
      [
        185,
        166
      ],
      [
        187,
        154
      ],
      [
        154,
        7
      ],
      [
        189,
        93
      ],
      [
        189,
        102
      ],
      [
        153,
        245
      ],
      [
        183,
        183
      ],
      [
        154,
        160
      ],
      [
        93,
        23
      ],
      [
        189,
        153
      ],
      [
        235,
        45
      ],
      [
        93,
        24
      ],
      [
        208,
        159
      ],
      [
        179,
        153
      ],
      [
        171,
        159
      ],
      [
        244,
        160
      ],
      [
        154,
        169
      ],
      [
        94,
        7
      ],
      [
        122,
        122
      ],
      [
        154,
        183
      ],
      [
        168,
        153
      ],
      [
        154,
        155
      ],
      [
        209,
        225
      ],
      [
        45,
        197
      ],
      [
        155,
        7
      ],
      [
        155,
        160
      ],
      [
        185,
        195
      ],
      [
        8,
        154
      ],
      [
        93,
        122
      ],
      [
        22,
        204
      ],
      [
        154,
        180
      ],
      [
        22,
        194
      ],
      [
        159,
        179
      ],
      [
        183,
        154
      ],
      [
        209,
        45
      ],
      [
        159,
        154
      ],
      [
        179,
        168
      ],
      [
        209,
        122
      ],
      [
        198,
        22
      ],
      [
        153,
        157
      ],
      [
        209,
        153
      ],
      [
        93,
        166
      ],
      [
        171,
        191
      ],
      [
        209,
        159
      ],
      [
        93,
        1
      ],
      [
        45,
        198
      ],
      [
        166,
        153
      ],
      [
        45,
        22
      ],
      [
        159,
        122
      ],
      [
        184,
        153
      ],
      [
        159,
        164
      ],
      [
        153,
        8
      ],
      [
        243,
        12
      ],
      [
        173,
        238
      ],
      [
        184,
        159
      ],
      [
        102,
        22
      ],
      [
        201,
        153
      ],
      [
        155,
        169
      ],
      [
        159,
        225
      ],
      [
        171,
        122
      ],
      [
        45,
        50
      ],
      [
        170,
        102
      ],
      [
        176,
        153
      ],
      [
        93,
        191
      ],
      [
        166,
        177
      ],
      [
        102,
        173
      ],
      [
        155,
        154
      ],
      [
        184,
        168
      ],
      [
        188,
        7
      ],
      [
        278,
        7
      ],
      [
        166,
        174
      ],
      [
        200,
        93
      ],
      [
        173,
        167
      ],
      [
        238,
        22
      ],
      [
        191,
        159
      ],
      [
        275,
        7
      ],
      [
        173,
        199
      ],
      [
        154,
        187
      ],
      [
        122,
        153
      ],
      [
        93,
        205
      ],
      [
        179,
        93
      ],
      [
        235,
        177
      ],
      [
        93,
        227
      ],
      [
        122,
        225
      ],
      [
        189,
        168
      ],
      [
        166,
        102
      ],
      [
        235,
        159
      ],
      [
        168,
        93
      ],
      [
        167,
        93
      ],
      [
        102,
        253
      ],
      [
        171,
        233
      ],
      [
        174,
        164
      ],
      [
        170,
        93
      ],
      [
        200,
        168
      ],
      [
        153,
        155
      ],
      [
        305,
        193
      ],
      [
        200,
        153
      ],
      [
        122,
        159
      ],
      [
        220,
        154
      ],
      [
        93,
        197
      ],
      [
        311,
        177
      ],
      [
        71,
        7
      ],
      [
        45,
        227
      ],
      [
        197,
        102
      ],
      [
        189,
        171
      ],
      [
        274,
        157
      ],
      [
        197,
        93
      ],
      [
        208,
        177
      ],
      [
        179,
        179
      ],
      [
        171,
        226
      ],
      [
        169,
        154
      ],
      [
        166,
        167
      ],
      [
        102,
        7
      ],
      [
        208,
        277
      ],
      [
        22,
        181
      ],
      [
        179,
        167
      ],
      [
        159,
        178
      ],
      [
        191,
        168
      ],
      [
        193,
        238
      ],
      [
        220,
        244
      ],
      [
        1,
        45
      ],
      [
        122,
        7
      ],
      [
        93,
        212
      ],
      [
        189,
        189
      ],
      [
        168,
        167
      ],
      [
        236,
        183
      ],
      [
        220,
        160
      ],
      [
        184,
        122
      ],
      [
        208,
        235
      ],
      [
        93,
        93
      ],
      [
        190,
        153
      ],
      [
        93,
        181
      ],
      [
        191,
        153
      ],
      [
        45,
        8
      ],
      [
        1,
        93
      ],
      [
        160,
        245
      ],
      [
        167,
        167
      ],
      [
        105,
        24
      ],
      [
        122,
        23
      ],
      [
        122,
        24
      ],
      [
        236,
        236
      ],
      [
        102,
        167
      ],
      [
        197,
        159
      ],
      [
        171,
        173
      ],
      [
        45,
        44
      ],
      [
        50,
        153
      ],
      [
        22,
        195
      ],
      [
        185,
        172
      ],
      [
        122,
        226
      ],
      [
        167,
        164
      ],
      [
        198,
        93
      ],
      [
        93,
        193
      ],
      [
        105,
        23
      ],
      [
        235,
        235
      ],
      [
        322,
        105
      ],
      [
        102,
        233
      ],
      [
        45,
        266
      ],
      [
        93,
        368
      ],
      [
        320,
        340
      ],
      [
        171,
        205
      ],
      [
        160,
        8
      ],
      [
        311,
        45
      ],
      [
        248,
        179
      ],
      [
        93,
        256
      ],
      [
        166,
        192
      ],
      [
        208,
        173
      ],
      [
        179,
        186
      ],
      [
        218,
        171
      ],
      [
        304,
        159
      ],
      [
        183,
        8
      ],
      [
        13,
        71
      ],
      [
        172,
        296
      ],
      [
        201,
        93
      ],
      [
        155,
        183
      ],
      [
        385,
        305
      ],
      [
        45,
        7
      ],
      [
        93,
        102
      ],
      [
        243,
        13
      ],
      [
        195,
        153
      ],
      [
        166,
        186
      ],
      [
        204,
        22
      ],
      [
        347,
        22
      ],
      [
        1,
        159
      ],
      [
        238,
        198
      ],
      [
        228,
        183
      ],
      [
        181,
        174
      ],
      [
        102,
        166
      ],
      [
        173,
        154
      ],
      [
        166,
        168
      ],
      [
        170,
        168
      ],
      [
        200,
        174
      ],
      [
        226,
        153
      ],
      [
        308,
        174
      ],
      [
        200,
        179
      ],
      [
        102,
        93
      ],
      [
        218,
        154
      ],
      [
        218,
        122
      ],
      [
        218,
        174
      ],
      [
        199,
        253
      ],
      [
        193,
        340
      ],
      [
        283,
        154
      ],
      [
        228,
        154
      ],
      [
        235,
        171
      ],
      [
        405,
        7
      ],
      [
        406,
        7
      ],
      [
        45,
        71
      ],
      [
        93,
        174
      ],
      [
        208,
        192
      ],
      [
        281,
        154
      ],
      [
        179,
        102
      ],
      [
        208,
        191
      ],
      [
        167,
        174
      ],
      [
        172,
        362
      ],
      [
        159,
        285
      ],
      [
        154,
        244
      ],
      [
        153,
        292
      ],
      [
        172,
        153
      ],
      [
        184,
        192
      ],
      [
        50,
        8
      ],
      [
        198,
        296
      ],
      [
        179,
        248
      ],
      [
        209,
        173
      ],
      [
        93,
        252
      ],
      [
        170,
        167
      ],
      [
        235,
        93
      ],
      [
        220,
        169
      ],
      [
        193,
        486
      ],
      [
        320,
        450
      ],
      [
        173,
        122
      ],
      [
        181,
        93
      ],
      [
        193,
        305
      ],
      [
        494,
        266
      ],
      [
        179,
        199
      ],
      [
        122,
        177
      ],
      [
        195,
        22
      ],
      [
        197,
        192
      ],
      [
        315,
        159
      ],
      [
        166,
        238
      ],
      [
        208,
        166
      ],
      [
        170,
        199
      ],
      [
        176,
        102
      ],
      [
        7,
        13
      ],
      [
        45,
        298
      ],
      [
        189,
        174
      ],
      [
        441,
        181
      ],
      [
        172,
        192
      ],
      [
        71,
        8
      ],
      [
        320,
        296
      ],
      [
        235,
        277
      ],
      [
        93,
        8
      ],
      [
        102,
        179
      ],
      [
        223,
        413
      ],
      [
        208,
        171
      ],
      [
        171,
        214
      ],
      [
        311,
        159
      ],
      [
        354,
        179
      ],
      [
        77,
        8
      ],
      [
        314,
        181
      ],
      [
        122,
        168
      ],
      [
        320,
        305
      ],
      [
        184,
        212
      ],
      [
        184,
        171
      ],
      [
        93,
        164
      ],
      [
        200,
        167
      ],
      [
        208,
        353
      ],
      [
        526,
        172
      ],
      [
        314,
        193
      ],
      [
        425,
        195
      ],
      [
        212,
        105
      ],
      [
        501,
        211
      ],
      [
        166,
        171
      ],
      [
        168,
        199
      ],
      [
        200,
        102
      ],
      [
        208,
        226
      ],
      [
        166,
        178
      ],
      [
        315,
        225
      ],
      [
        159,
        50
      ],
      [
        166,
        191
      ],
      [
        189,
        122
      ],
      [
        200,
        186
      ],
      [
        173,
        179
      ],
      [
        1,
        235
      ],
      [
        189,
        167
      ],
      [
        243,
        14
      ],
      [
        45,
        105
      ],
      [
        199,
        153
      ],
      [
        236,
        154
      ],
      [
        425,
        181
      ],
      [
        466,
        172
      ],
      [
        171,
        251
      ],
      [
        218,
        178
      ],
      [
        171,
        192
      ],
      [
        197,
        173
      ],
      [
        7,
        14
      ],
      [
        154,
        8
      ],
      [
        172,
        413
      ],
      [
        174,
        93
      ],
      [
        44,
        153
      ],
      [
        160,
        236
      ],
      [
        223,
        296
      ],
      [
        172,
        102
      ],
      [
        173,
        401
      ],
      [
        193,
        102
      ],
      [
        3,
        13
      ],
      [
        204,
        296
      ],
      [
        184,
        191
      ],
      [
        185,
        204
      ],
      [
        1,
        277
      ],
      [
        93,
        22
      ],
      [
        171,
        93
      ],
      [
        171,
        353
      ],
      [
        209,
        184
      ],
      [
        102,
        205
      ],
      [
        171,
        255
      ],
      [
        218,
        225
      ],
      [
        340,
        193
      ],
      [
        168,
        168
      ],
      [
        197,
        189
      ],
      [
        320,
        362
      ],
      [
        172,
        177
      ],
      [
        238,
        266
      ],
      [
        228,
        155
      ],
      [
        80,
        7
      ],
      [
        173,
        164
      ],
      [
        385,
        587
      ],
      [
        45,
        248
      ],
      [
        456,
        44
      ],
      [
        102,
        181
      ],
      [
        102,
        186
      ],
      [
        153,
        513
      ],
      [
        217,
        153
      ],
      [
        346,
        252
      ],
      [
        93,
        298
      ],
      [
        102,
        199
      ],
      [
        180,
        8
      ],
      [
        390,
        390
      ],
      [
        159,
        197
      ],
      [
        174,
        285
      ],
      [
        209,
        177
      ],
      [
        173,
        194
      ],
      [
        93,
        214
      ],
      [
        172,
        167
      ],
      [
        174,
        174
      ],
      [
        258,
        154
      ],
      [
        154,
        241
      ],
      [
        466,
        193
      ],
      [
        441,
        195
      ],
      [
        93,
        178
      ],
      [
        181,
        296
      ],
      [
        173,
        387
      ],
      [
        272,
        8
      ],
      [
        93,
        303
      ],
      [
        248,
        199
      ],
      [
        102,
        256
      ],
      [
        405,
        368
      ],
      [
        196,
        153
      ],
      [
        205,
        93
      ],
      [
        93,
        179
      ],
      [
        212,
        205
      ],
      [
        504,
        296
      ],
      [
        102,
        185
      ],
      [
        166,
        176
      ],
      [
        497,
        211
      ],
      [
        195,
        296
      ],
      [
        171,
        246
      ],
      [
        406,
        368
      ],
      [
        189,
        186
      ],
      [
        208,
        181
      ],
      [
        185,
        223
      ],
      [
        220,
        236
      ],
      [
        167,
        449
      ],
      [
        176,
        22
      ],
      [
        248,
        22
      ],
      [
        248,
        248
      ],
      [
        187,
        8
      ],
      [
        198,
        197
      ],
      [
        420,
        277
      ],
      [
        93,
        170
      ],
      [
        217,
        296
      ],
      [
        398,
        174
      ],
      [
        1,
        177
      ],
      [
        235,
        173
      ],
      [
        304,
        177
      ],
      [
        44,
        8
      ],
      [
        102,
        172
      ],
      [
        22,
        234
      ],
      [
        167,
        350
      ],
      [
        193,
        167
      ],
      [
        285,
        285
      ],
      [
        93,
        194
      ],
      [
        258,
        167
      ],
      [
        398,
        93
      ],
      [
        497,
        210
      ],
      [
        166,
        154
      ],
      [
        190,
        93
      ],
      [
        219,
        153
      ],
      [
        221,
        168
      ],
      [
        221,
        296
      ],
      [
        193,
        171
      ],
      [
        197,
        166
      ],
      [
        447,
        219
      ],
      [
        211,
        153
      ],
      [
        102,
        154
      ],
      [
        167,
        179
      ],
      [
        102,
        251
      ],
      [
        185,
        217
      ],
      [
        197,
        170
      ],
      [
        314,
        221
      ],
      [
        472,
        13
      ],
      [
        285,
        122
      ],
      [
        340,
        181
      ],
      [
        157,
        169
      ],
      [
        172,
        186
      ],
      [
        197,
        174
      ],
      [
        45,
        77
      ],
      [
        159,
        381
      ],
      [
        198,
        153
      ],
      [
        218,
        186
      ],
      [
        93,
        199
      ],
      [
        315,
        153
      ],
      [
        64,
        560
      ],
      [
        204,
        677
      ],
      [
        208,
        255
      ],
      [
        93,
        154
      ],
      [
        309,
        153
      ],
      [
        504,
        362
      ],
      [
        181,
        194
      ],
      [
        191,
        178
      ],
      [
        193,
        186
      ],
      [
        200,
        154
      ],
      [
        244,
        155
      ],
      [
        22,
        193
      ],
      [
        183,
        236
      ],
      [
        208,
        195
      ],
      [
        166,
        287
      ],
      [
        189,
        387
      ],
      [
        409,
        22
      ],
      [
        217,
        177
      ],
      [
        330,
        168
      ],
      [
        447,
        210
      ],
      [
        168,
        259
      ],
      [
        176,
        164
      ],
      [
        181,
        154
      ],
      [
        212,
        122
      ],
      [
        93,
        251
      ],
      [
        159,
        198
      ],
      [
        45,
        296
      ],
      [
        166,
        199
      ],
      [
        193,
        174
      ],
      [
        195,
        167
      ],
      [
        197,
        194
      ],
      [
        170,
        174
      ],
      [
        184,
        93
      ],
      [
        184,
        173
      ],
      [
        285,
        316
      ],
      [
        447,
        211
      ],
      [
        12,
        14
      ],
      [
        166,
        194
      ],
      [
        172,
        176
      ],
      [
        223,
        362
      ],
      [
        285,
        173
      ],
      [
        166,
        387
      ],
      [
        173,
        449
      ],
      [
        220,
        183
      ],
      [
        105,
        71
      ],
      [
        171,
        212
      ],
      [
        195,
        582
      ],
      [
        395,
        212
      ],
      [
        167,
        154
      ],
      [
        171,
        154
      ],
      [
        183,
        245
      ],
      [
        200,
        375
      ],
      [
        179,
        303
      ],
      [
        185,
        185
      ],
      [
        205,
        159
      ],
      [
        258,
        164
      ],
      [
        314,
        172
      ],
      [
        93,
        513
      ],
      [
        235,
        192
      ],
      [
        243,
        15
      ],
      [
        171,
        199
      ],
      [
        167,
        22
      ],
      [
        172,
        212
      ],
      [
        183,
        274
      ],
      [
        185,
        211
      ],
      [
        197,
        199
      ],
      [
        197,
        226
      ],
      [
        304,
        383
      ],
      [
        197,
        191
      ],
      [
        395,
        166
      ],
      [
        285,
        159
      ],
      [
        166,
        122
      ],
      [
        172,
        171
      ],
      [
        173,
        234
      ],
      [
        200,
        194
      ],
      [
        220,
        8
      ],
      [
        304,
        316
      ],
      [
        185,
        214
      ],
      [
        166,
        1
      ],
      [
        180,
        183
      ],
      [
        181,
        582
      ],
      [
        189,
        401
      ],
      [
        201,
        174
      ],
      [
        217,
        362
      ],
      [
        308,
        102
      ],
      [
        214,
        153
      ],
      [
        220,
        180
      ],
      [
        155,
        274
      ],
      [
        167,
        1
      ],
      [
        170,
        259
      ],
      [
        184,
        178
      ],
      [
        185,
        167
      ],
      [
        159,
        22
      ],
      [
        193,
        168
      ],
      [
        89,
        508
      ],
      [
        93,
        248
      ],
      [
        183,
        180
      ],
      [
        184,
        226
      ],
      [
        185,
        221
      ],
      [
        102,
        71
      ],
      [
        102,
        337
      ],
      [
        184,
        256
      ],
      [
        172,
        214
      ],
      [
        172,
        450
      ],
      [
        181,
        387
      ],
      [
        193,
        179
      ],
      [
        314,
        195
      ],
      [
        122,
        212
      ],
      [
        172,
        196
      ],
      [
        236,
        160
      ],
      [
        93,
        167
      ],
      [
        205,
        205
      ],
      [
        168,
        174
      ],
      [
        189,
        199
      ],
      [
        290,
        93
      ],
      [
        314,
        223
      ],
      [
        395,
        277
      ],
      [
        50,
        45
      ],
      [
        169,
        8
      ],
      [
        171,
        102
      ],
      [
        304,
        171
      ],
      [
        102,
        204
      ],
      [
        154,
        157
      ],
      [
        252,
        122
      ],
      [
        395,
        173
      ],
      [
        489,
        251
      ],
      [
        775,
        192
      ],
      [
        195,
        93
      ],
      [
        238,
        238
      ],
      [
        332,
        387
      ],
      [
        93,
        105
      ],
      [
        93,
        171
      ],
      [
        122,
        173
      ],
      [
        217,
        167
      ],
      [
        102,
        223
      ],
      [
        122,
        71
      ],
      [
        173,
        647
      ],
      [
        174,
        350
      ],
      [
        191,
        122
      ],
      [
        217,
        102
      ],
      [
        299,
        179
      ],
      [
        46,
        508
      ],
      [
        102,
        193
      ],
      [
        166,
        574
      ],
      [
        189,
        271
      ],
      [
        235,
        353
      ],
      [
        285,
        226
      ],
      [
        306,
        236
      ],
      [
        472,
        14
      ],
      [
        93,
        196
      ],
      [
        102,
        298
      ],
      [
        308,
        199
      ],
      [
        604,
        193
      ],
      [
        3,
        14
      ],
      [
        102,
        195
      ],
      [
        153,
        22
      ],
      [
        171,
        166
      ],
      [
        184,
        255
      ],
      [
        197,
        315
      ],
      [
        330,
        153
      ],
      [
        166,
        548
      ],
      [
        171,
        185
      ],
      [
        172,
        174
      ],
      [
        187,
        160
      ],
      [
        201,
        164
      ],
      [
        285,
        193
      ],
      [
        185,
        102
      ],
      [
        208,
        196
      ],
      [
        288,
        183
      ],
      [
        208,
        212
      ],
      [
        218,
        833
      ],
      [
        170,
        154
      ],
      [
        184,
        341
      ],
      [
        189,
        154
      ],
      [
        197,
        167
      ],
      [
        217,
        174
      ],
      [
        314,
        217
      ],
      [
        385,
        362
      ],
      [
        122,
        315
      ],
      [
        159,
        105
      ],
      [
        179,
        174
      ],
      [
        304,
        225
      ],
      [
        157,
        157
      ],
      [
        172,
        381
      ],
      [
        173,
        1
      ],
      [
        181,
        1
      ],
      [
        197,
        242
      ],
      [
        199,
        93
      ],
      [
        217,
        171
      ],
      [
        217,
        192
      ],
      [
        218,
        164
      ],
      [
        243,
        16
      ],
      [
        179,
        154
      ],
      [
        184,
        166
      ],
      [
        184,
        227
      ],
      [
        197,
        205
      ],
      [
        159,
        266
      ],
      [
        299,
        168
      ],
      [
        425,
        193
      ],
      [
        12,
        15
      ],
      [
        157,
        228
      ],
      [
        235,
        178
      ],
      [
        480,
        177
      ],
      [
        105,
        7
      ],
      [
        154,
        245
      ],
      [
        184,
        205
      ],
      [
        185,
        210
      ],
      [
        200,
        345
      ],
      [
        221,
        167
      ],
      [
        241,
        8
      ],
      [
        285,
        153
      ],
      [
        38,
        8
      ],
      [
        157,
        160
      ],
      [
        166,
        345
      ],
      [
        176,
        194
      ],
      [
        198,
        179
      ],
      [
        252,
        205
      ],
      [
        208,
        204
      ],
      [
        285,
        177
      ],
      [
        375,
        179
      ],
      [
        809,
        183
      ],
      [
        102,
        217
      ],
      [
        122,
        191
      ],
      [
        122,
        261
      ],
      [
        171,
        240
      ],
      [
        172,
        191
      ],
      [
        184,
        214
      ],
      [
        236,
        245
      ],
      [
        395,
        181
      ],
      [
        447,
        172
      ],
      [
        583,
        583
      ],
      [
        172,
        164
      ],
      [
        179,
        170
      ],
      [
        189,
        287
      ],
      [
        243,
        19
      ],
      [
        332,
        401
      ],
      [
        489,
        173
      ],
      [
        168,
        194
      ],
      [
        193,
        387
      ],
      [
        197,
        122
      ],
      [
        219,
        167
      ],
      [
        235,
        191
      ],
      [
        352,
        251
      ],
      [
        395,
        352
      ],
      [
        426,
        159
      ],
      [
        93,
        250
      ],
      [
        102,
        221
      ],
      [
        170,
        122
      ],
      [
        179,
        198
      ],
      [
        193,
        1
      ],
      [
        195,
        50
      ],
      [
        200,
        285
      ],
      [
        208,
        399
      ],
      [
        217,
        93
      ],
      [
        221,
        171
      ],
      [
        306,
        220
      ],
      [
        361,
        183
      ],
      [
        447,
        215
      ],
      [
        598,
        205
      ],
      [
        638,
        219
      ],
      [
        869,
        427
      ],
      [
        102,
        252
      ],
      [
        102,
        352
      ],
      [
        173,
        225
      ],
      [
        638,
        215
      ],
      [
        93,
        198
      ],
      [
        102,
        219
      ],
      [
        193,
        178
      ],
      [
        200,
        198
      ],
      [
        214,
        174
      ],
      [
        308,
        177
      ],
      [
        314,
        211
      ],
      [
        410,
        154
      ],
      [
        501,
        795
      ],
      [
        525,
        197
      ],
      [
        8,
        13
      ],
      [
        64,
        508
      ],
      [
        71,
        13
      ],
      [
        160,
        333
      ],
      [
        190,
        154
      ],
      [
        191,
        191
      ],
      [
        199,
        164
      ],
      [
        221,
        102
      ],
      [
        223,
        171
      ],
      [
        235,
        184
      ],
      [
        235,
        212
      ],
      [
        50,
        560
      ],
      [
        166,
        179
      ],
      [
        176,
        168
      ],
      [
        179,
        194
      ],
      [
        195,
        449
      ],
      [
        200,
        164
      ],
      [
        200,
        263
      ],
      [
        420,
        420
      ],
      [
        44,
        45
      ],
      [
        159,
        373
      ],
      [
        166,
        105
      ],
      [
        173,
        22
      ],
      [
        179,
        22
      ],
      [
        189,
        44
      ],
      [
        200,
        303
      ],
      [
        218,
        345
      ],
      [
        221,
        179
      ],
      [
        235,
        348
      ],
      [
        246,
        122
      ],
      [
        602,
        602
      ],
      [
        638,
        438
      ],
      [
        159,
        206
      ],
      [
        181,
        449
      ],
      [
        185,
        177
      ],
      [
        240,
        93
      ],
      [
        243,
        17
      ],
      [
        283,
        8
      ],
      [
        285,
        181
      ],
      [
        390,
        186
      ],
      [
        77,
        153
      ],
      [
        99,
        508
      ],
      [
        122,
        262
      ],
      [
        166,
        164
      ],
      [
        173,
        373
      ],
      [
        189,
        50
      ],
      [
        200,
        1
      ],
      [
        273,
        8
      ],
      [
        279,
        345
      ],
      [
        395,
        353
      ],
      [
        168,
        50
      ],
      [
        176,
        93
      ],
      [
        181,
        179
      ],
      [
        189,
        1
      ],
      [
        208,
        348
      ],
      [
        243,
        18
      ],
      [
        243,
        20
      ],
      [
        311,
        192
      ],
      [
        548,
        299
      ],
      [
        12,
        12
      ],
      [
        102,
        38
      ],
      [
        102,
        373
      ],
      [
        122,
        495
      ],
      [
        159,
        44
      ]
    ]
  }
}