{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 2047,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2048,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2049,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2050,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2051,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2052,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2053,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "Unigram",
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": [
      {
        "glyphs": [
          "#"
        ],
        "score": -8.880563965052295
      },
      {
        "glyphs": [
          "$"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "%"
        ],
        "score": -8.555646835730636
      },
      {
        "glyphs": [
          "("
        ],
        "score": -2.2063482964671373
      },
      {
        "glyphs": [
          ")"
        ],
        "score": -2.2063482964671373
      },
      {
        "glyphs": [
          "*"
        ],
        "score": -19.318693571295082
      },
      {
        "glyphs": [
          "+"
        ],
        "score": -6.316458078979199
      },
      {
        "glyphs": [
          "-"
        ],
        "score": -4.8178976732389
      },
      {
        "glyphs": [
          "."
        ],
        "score": -5.294747751999882
      },
      {
        "glyphs": [
          "/"
        ],
        "score": -5.555806894623188
      },
      {
        "glyphs": [
          "0"
        ],
        "score": -12.732620827146262
      },
      {
        "glyphs": [
          "1"
        ],
        "score": -2.77508895513375
      },
      {
        "glyphs": [
          "2"
        ],
        "score": -3.161321218975516
      },
      {
        "glyphs": [
          "3"
        ],
        "score": -3.8792601925400554
      },
      {
        "glyphs": [
          "4"
        ],
        "score": -4.735859203511495
      },
      {
        "glyphs": [
          "5"
        ],
        "score": -5.561935963898016
      },
      {
        "glyphs": [
          "6"
        ],
        "score": -6.298159642340577
      },
      {
        "glyphs": [
          "7"
        ],
        "score": -7.048293993924133
      },
      {
        "glyphs": [
          "8"
        ],
        "score": -7.861023620827778
      },
      {
        "glyphs": [
          "9"
        ],
        "score": -8.701815700731746
      },
      {
        "glyphs": [
          ":"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "="
        ],
        "score": -3.20430094876782
      },
      {
        "glyphs": [
          "@"
        ],
        "score": -11.375479517957979
      },
      {
        "glyphs": [
          "@@"
        ],
        "score": -11.403680829763383
      },
      {
        "glyphs": [
          "@AL"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "@OH"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "@SP"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "@TB"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "@TH"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Ac"
        ],
        "score": -12.680793261658874
      },
      {
        "glyphs": [
          "Ag"
        ],
        "score": -18.547194877110265
      },
      {
        "glyphs": [
          "Al"
        ],
        "score": -19.315967617368866
      },
      {
        "glyphs": [
          "Am"
        ],
        "score": -16.42586147711972
      },
      {
        "glyphs": [
          "Ar"
        ],
        "score": -12.864866506444683
      },
      {
        "glyphs": [
          "As"
        ],
        "score": -18.64982653336177
      },
      {
        "glyphs": [
          "At"
        ],
        "score": -16.711782827783097
      },
      {
        "glyphs": [
          "Au"
        ],
        "score": -19.125057599258714
      },
      {
        "glyphs": [
          "B"
        ],
        "score": -7.940166301067457
      },
      {
        "glyphs": [
          "Ba"
        ],
        "score": -18.59719360492662
      },
      {
        "glyphs": [
          "Be"
        ],
        "score": -21.14496942871627
      },
      {
        "glyphs": [
          "Bh"
        ],
        "score": -18.12041662982559
      },
      {
        "glyphs": [
          "Bi"
        ],
        "score": -18.89337209822938
      },
      {
        "glyphs": [
          "Bk"
        ],
        "score": -16.990589399356153
      },
      {
        "glyphs": [
          "Br"
        ],
        "score": -6.3817549698176474
      },
      {
        "glyphs": [
          "C"
        ],
        "score": -1.7579426801217863
      },
      {
        "glyphs": [
          "Ca"
        ],
        "score": -19.315966811728146
      },
      {
        "glyphs": [
          "Cd"
        ],
        "score": -18.826705548095273
      },
      {
        "glyphs": [
          "Ce"
        ],
        "score": -19.215966506534752
      },
      {
        "glyphs": [
          "Cf"
        ],
        "score": -16.485939420198147
      },
      {
        "glyphs": [
          "Cl"
        ],
        "score": -5.2886864944550815
      },
      {
        "glyphs": [
          "Cm"
        ],
        "score": -15.981326011733456
      },
      {
        "glyphs": [
          "Cn"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Co"
        ],
        "score": -18.96480115488365
      },
      {
        "glyphs": [
          "Cr"
        ],
        "score": -19.041724289127263
      },
      {
        "glyphs": [
          "Cs"
        ],
        "score": -18.826705673472055
      },
      {
        "glyphs": [
          "Cu"
        ],
        "score": -18.76420566361968
      },
      {
        "glyphs": [
          "Db"
        ],
        "score": -17.628848643795433
      },
      {
        "glyphs": [
          "Ds"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Dy"
        ],
        "score": -18.70538103869634
      },
      {
        "glyphs": [
          "Er"
        ],
        "score": -18.96479988065556
      },
      {
        "glyphs": [
          "Es"
        ],
        "score": -16.73020124842097
      },
      {
        "glyphs": [
          "Eu"
        ],
        "score": -18.6498256822317
      },
      {
        "glyphs": [
          "F"
        ],
        "score": -4.591287536575802
      },
      {
        "glyphs": [
          "Fe"
        ],
        "score": -18.764205728314135
      },
      {
        "glyphs": [
          "Fl"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Fm"
        ],
        "score": -14.770832988270852
      },
      {
        "glyphs": [
          "Fr"
        ],
        "score": -17.820919018613772
      },
      {
        "glyphs": [
          "Ga"
        ],
        "score": -19.315967027570515
      },
      {
        "glyphs": [
          "Gd"
        ],
        "score": -18.547194280207258
      },
      {
        "glyphs": [
          "Ge"
        ],
        "score": -18.964801190487268
      },
      {
        "glyphs": [
          "H"
        ],
        "score": -4.474611391112244
      },
      {
        "glyphs": [
          "He"
        ],
        "score": -16.35279547284514
      },
      {
        "glyphs": [
          "Hf"
        ],
        "score": -19.125057643660337
      },
      {
        "glyphs": [
          "Hg"
        ],
        "score": -18.547194714619398
      },
      {
        "glyphs": [
          "Ho"
        ],
        "score": -19.12505622929796
      },
      {
        "glyphs": [
          "Hs"
        ],
        "score": -17.820919018613772
      },
      {
        "glyphs": [
          "I"
        ],
        "score": -7.567083548914814
      },
      {
        "glyphs": [
          "In"
        ],
        "score": -18.454120089640213
      },
      {
        "glyphs": [
          "Ir"
        ],
        "score": -18.705382220702916
      },
      {
        "glyphs": [
          "K"
        ],
        "score": -18.964801239287578
      },
      {
        "glyphs": [
          "Kr"
        ],
        "score": -17.609617874564663
      },
      {
        "glyphs": [
          "La"
        ],
        "score": -18.76420554838819
      },
      {
        "glyphs": [
          "Li"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Lr"
        ],
        "score": -15.948234794396946
      },
      {
        "glyphs": [
          "Lu"
        ],
        "score": -18.826704564624112
      },
      {
        "glyphs": [
          "Lv"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Mc"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Md"
        ],
        "score": -17.774935931933012
      },
      {
        "glyphs": [
          "Mg"
        ],
        "score": -19.552078580270464
      },
      {
        "glyphs": [
          "Mn"
        ],
        "score": -19.315967235880578
      },
      {
        "glyphs": [
          "Mo"
        ],
        "score": -18.64982649288049
      },
      {
        "glyphs": [
          "Mt"
        ],
        "score": -17.869118786325735
      },
      {
        "glyphs": [
          "N"
        ],
        "score": -3.37793544904061
      },
      {
        "glyphs": [
          "Na"
        ],
        "score": -19.315967379192752
      },
      {
        "glyphs": [
          "Nb"
        ],
        "score": -19.125057357047286
      },
      {
        "glyphs": [
          "Nd"
        ],
        "score": -18.964800710031557
      },
      {
        "glyphs": [
          "Ne"
        ],
        "score": -16.576616069437627
      },
      {
        "glyphs": [
          "Nh"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Ni"
        ],
        "score": -19.125057795061803
      },
      {
        "glyphs": [
          "No"
        ],
        "score": -15.536161377027035
      },
      {
        "glyphs": [
          "Np"
        ],
        "score": -19.427071790605396
      },
      {
        "glyphs": [
          "O"
        ],
        "score": -2.8287650732591736
      },
      {
        "glyphs": [
          "Og"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Os"
        ],
        "score": -18.705381749149105
      },
      {
        "glyphs": [
          "P"
        ],
        "score": -8.184515700186337
      },
      {
        "glyphs": [
          "Pa"
        ],
        "score": -16.77879353790872
      },
      {
        "glyphs": [
          "Pb"
        ],
        "score": -18.328976724848722
      },
      {
        "glyphs": [
          "Pd"
        ],
        "score": -18.54719635495634
      },
      {
        "glyphs": [
          "Pm"
        ],
        "score": -16.315557215554676
      },
      {
        "glyphs": [
          "Po"
        ],
        "score": -19.215962948816724
      },
      {
        "glyphs": [
          "Pr"
        ],
        "score": -18.764204856925502
      },
      {
        "glyphs": [
          "Pt"
        ],
        "score": -18.70538220640371
      },
      {
        "glyphs": [
          "Pu"
        ],
        "score": -16.015549842868925
      },
      {
        "glyphs": [
          "Ra"
        ],
        "score": -16.691436899209876
      },
      {
        "glyphs": [
          "Rb"
        ],
        "score": -18.893372516358536
      },
      {
        "glyphs": [
          "Re"
        ],
        "score": -17.706970316394404
      },
      {
        "glyphs": [
          "Rf"
        ],
        "score": -13.023791257223424
      },
      {
        "glyphs": [
          "Rg"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "Rh"
        ],
        "score": -18.454121099566933
      },
      {
        "glyphs": [
          "Rn"
        ],
        "score": -17.403770921556344
      },
      {
        "glyphs": [
          "Ru"
        ],
        "score": -18.499575792161995
      },
      {
        "glyphs": [
          "S"
        ],
        "score": -5.3678311557676786
      },
      {
        "glyphs": [
          "Sb"
        ],
        "score": -18.597194841112103
      },
      {
        "glyphs": [
          "Sc"
        ],
        "score": -19.427077980050527
      },
      {
        "glyphs": [
          "Se"
        ],
        "score": -18.290514798204274
      },
      {
        "glyphs": [
          "Sg"
        ],
        "score": -16.249877188554354
      },
      {
        "glyphs": [
          "Si"
        ],
        "score": -18.893372550725037
      },
      {
        "glyphs": [
          "Sm"
        ],
        "score": -18.826705124620332
      },
      {
        "glyphs": [
          "Sn"
        ],
        "score": -19.315967350372166
      },
      {
        "glyphs": [
          "Sr"
        ],
        "score": -18.25347823351032
      },
      {
        "glyphs": [
          "Ta"
        ],
        "score": -19.125057235649646
      },
      {
        "glyphs": [
          "Tb"
        ],
        "score": -18.764205549546755
      },
      {
        "glyphs": [
          "Tc"
        ],
        "score": -18.89336987099225
      },
      {
        "glyphs": [
          "Te"
        ],
        "score": -18.70538202107274
      },
      {
        "glyphs": [
          "Th"
        ],
        "score": -18.826704742806786
      },
      {
        "glyphs": [
          "Ti"
        ],
        "score": -19.315967310346615
      },
      {
        "glyphs": [
          "Tl"
        ],
        "score": -18.64982599904622
      },
      {
        "glyphs": [
          "Tm"
        ],
        "score": -18.8933702991715
      },
      {
        "glyphs": [
          "Ts"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "U"
        ],
        "score": -19.315967264020408
      },
      {
        "glyphs": [
          "V"
        ],
        "score": -20.311609946632043
      },
      {
        "glyphs": [
          "W"
        ],
        "score": -19.215967121080332
      },
      {
        "glyphs": [
          "Xe"
        ],
        "score": -18.70537467512579
      },
      {
        "glyphs": [
          "Y"
        ],
        "score": -18.705383917755167
      },
      {
        "glyphs": [
          "Yb"
        ],
        "score": -19.12505631048566
      },
      {
        "glyphs": [
          "Zn"
        ],
        "score": -18.764205681132047
      },
      {
        "glyphs": [
          "Zr"
        ],
        "score": -18.893372513030894
      },
      {
        "glyphs": [
          "["
        ],
        "score": -5.905755375435252
      },
      {
        "glyphs": [
          "\\"
        ],
        "score": -6.492218484101732
      },
      {
        "glyphs": [
          "]"
        ],
        "score": -3.8961176228135344
      },
      {
        "glyphs": [
          "as"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "b"
        ],
        "score": -14.955327446823166
      },
      {
        "glyphs": [
          "c"
        ],
        "score": -1.6628084404050583
      },
      {
        "glyphs": [
          "n"
        ],
        "score": -3.8966436633751087
      },
      {
        "glyphs": [
          "o"
        ],
        "score": -6.329332727038352
      },
      {
        "glyphs": [
          "p"
        ],
        "score": -12.395049798457478
      },
      {
        "glyphs": [
          "s"
        ],
        "score": -5.994271835173766
      },
      {
        "glyphs": [
          "se"
        ],
        "score": -22.145135677092306
      },
      {
        "glyphs": [
          "c",
          "c",
          "c",
          "c",
          "c"
        ],
        "score": -4.585919876653023
      },
      {
        "glyphs": [
          "[",
          "C",
          "@"
        ],
        "score": -5.08589238210849
      },
      {
        "glyphs": [
          "[",
          "C",
          "@@"
        ],
        "score": -5.113922666224958
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -5.908616039700632
      },
      {
        "glyphs": [
          "[",
          "n",
          "H"
        ],
        "score": -6.2499923834557976
      },
      {
        "glyphs": [
          "[",
          "O",
          "-"
        ],
        "score": -6.6526350194464445
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -6.718749581039605
      },
      {
        "glyphs": [
          "C",
          "#"
        ],
        "score": -6.7987963778276175
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -6.945530163379734
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -6.954201586720343
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -7.045606893146955
      },
      {
        "glyphs": [
          "[",
          "2",
          "H"
        ],
        "score": -7.180985571839582
      },
      {
        "glyphs": [
          "[",
          "Si"
        ],
        "score": -7.69224695762969
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -7.701768188802028
      },
      {
        "glyphs": [
          "N",
          "#",
          "C"
        ],
        "score": -8.19443881801789
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.400857619166079
      },
      {
        "glyphs": [
          "n",
          "o",
          "c"
        ],
        "score": -8.51920609874603
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.55231971538376
      },
      {
        "glyphs": [
          "C",
          "O",
          "P"
        ],
        "score": -8.66280900922486
      },
      {
        "glyphs": [
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -8.69055809362286
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -8.804301089710595
      },
      {
        "glyphs": [
          "O",
          "=",
          "S"
        ],
        "score": -8.857400126896573
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -8.885954867127397
      },
      {
        "glyphs": [
          "O",
          "P"
        ],
        "score": -9.070588982350118
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -9.090483366184028
      },
      {
        "glyphs": [
          "[",
          "Na"
        ],
        "score": -9.125106747775382
      },
      {
        "glyphs": [
          "n",
          "n",
          "n"
        ],
        "score": -9.143432690375612
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.360626329428094
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -9.376767015946673
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -9.393549762210082
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.418928444327582
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C"
        ],
        "score": -9.487550759493464
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "N"
        ],
        "score": -9.51286051031018
      },
      {
        "glyphs": [
          "1",
          "0"
        ],
        "score": -9.53558202394797
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "2"
        ],
        "score": -9.577289781232462
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "s"
        ],
        "score": -9.680511837842127
      },
      {
        "glyphs": [
          "[",
          "C",
          "H",
          "3"
        ],
        "score": -9.691928727612874
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -9.704926152619722
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.711036151624953
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -9.83298980569652
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.83369553118824
      },
      {
        "glyphs": [
          "[",
          "Y"
        ],
        "score": -9.929484164911251
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -9.941395424993352
      },
      {
        "glyphs": [
          "[",
          "Ir"
        ],
        "score": -10.0872812221905
      },
      {
        "glyphs": [
          "[",
          "K"
        ],
        "score": -10.092397241654977
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -10.126981808093394
      },
      {
        "glyphs": [
          "n",
          "n",
          "n",
          "n"
        ],
        "score": -10.13071521107084
      },
      {
        "glyphs": [
          "c",
          "n",
          "c",
          "c",
          "n"
        ],
        "score": -10.16468094874813
      },
      {
        "glyphs": [
          "n",
          "c",
          "c",
          "n",
          "c"
        ],
        "score": -10.16548258077193
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.19517866786032
      },
      {
        "glyphs": [
          "[",
          "N",
          "H",
          "2"
        ],
        "score": -10.221147021281341
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -10.24901072047971
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "n"
        ],
        "score": -10.332461830733456
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -10.336653188894418
      },
      {
        "glyphs": [
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -10.359138733200142
      },
      {
        "glyphs": [
          "O",
          "=",
          "P"
        ],
        "score": -10.388836023473683
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -10.395023748427139
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N"
        ],
        "score": -10.43094177301413
      },
      {
        "glyphs": [
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -10.522206665828326
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.5411559330568
      },
      {
        "glyphs": [
          "[",
          "Li"
        ],
        "score": -10.59821294507736
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -10.603713049533853
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "O"
        ],
        "score": -10.673267524223094
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "=",
          "C",
          "C"
        ],
        "score": -10.76160339593811
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "C",
          "C"
        ],
        "score": -10.772468870459448
      },
      {
        "glyphs": [
          "[",
          "Pt"
        ],
        "score": -10.784519147523088
      },
      {
        "glyphs": [
          "H",
          "3",
          "+"
        ],
        "score": -10.823999198615049
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -10.845540366203732
      },
      {
        "glyphs": [
          "n",
          "o",
          "n",
          "c"
        ],
        "score": -10.861865189745672
      },
      {
        "glyphs": [
          "C",
          "C",
          "=",
          "C",
          "C",
          "C"
        ],
        "score": -10.909766835440667
      },
      {
        "glyphs": [
          "[",
          "Pt",
          "+"
        ],
        "score": -10.914948624772416
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H"
        ],
        "score": -10.946963860301235
      },
      {
        "glyphs": [
          "[",
          "S",
          "-"
        ],
        "score": -10.955065820356946
      },
      {
        "glyphs": [
          "[",
          "Sn"
        ],
        "score": -10.977632432264254
      },
      {
        "glyphs": [
          "[",
          "Se"
        ],
        "score": -10.987799976108866
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C"
        ],
        "score": -11.01940561618075
      },
      {
        "glyphs": [
          "n",
          "s",
          "n",
          "c"
        ],
        "score": -11.060172511465414
      },
      {
        "glyphs": [
          "[",
          "W"
        ],
        "score": -11.066603245234525
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "2"
        ],
        "score": -11.094143569660492
      },
      {
        "glyphs": [
          "C",
          "=",
          "N",
          "N",
          "C"
        ],
        "score": -11.104386902595776
      },
      {
        "glyphs": [
          "[",
          "Zr",
          "+"
        ],
        "score": -11.193619984606753
      },
      {
        "glyphs": [
          "C",
          "S",
          "S",
          "C"
        ],
        "score": -11.242642575943094
      },
      {
        "glyphs": [
          "[",
          "V"
        ],
        "score": -11.28099432369784
      },
      {
        "glyphs": [
          "[",
          "P",
          "H"
        ],
        "score": -11.301379813613703
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "N"
        ],
        "score": -11.356058887236374
      },
      {
        "glyphs": [
          "[",
          "Si",
          "H",
          "3"
        ],
        "score": -11.360420027789505
      },
      {
        "glyphs": [
          "[",
          "Mg",
          "+"
        ],
        "score": -11.405140777676074
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "C"
        ],
        "score": -11.4351135111194
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -11.453660533602111
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.456250665958395
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.456769637954931
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.522193410752427
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.523703321254793
      },
      {
        "glyphs": [
          "C",
          "S",
          "C",
          "C",
          "N"
        ],
        "score": -11.53664717359008
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "S"
        ],
        "score": -11.553398747450624
      },
      {
        "glyphs": [
          "[",
          "Ge"
        ],
        "score": -11.587017006045548
      },
      {
        "glyphs": [
          "[",
          "Ca",
          "+"
        ],
        "score": -11.587861157178901
      },
      {
        "glyphs": [
          "[",
          "Fe",
          "+"
        ],
        "score": -11.62149817512346
      },
      {
        "glyphs": [
          "=",
          "C",
          "C",
          "C",
          "=",
          "C"
        ],
        "score": -11.683960957142137
      },
      {
        "glyphs": [
          "[",
          "Zn",
          "+"
        ],
        "score": -11.688923407980113
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -11.697087090519142
      },
      {
        "glyphs": [
          "[",
          "Cu",
          "+"
        ],
        "score": -11.711311561874062
      },
      {
        "glyphs": [
          "[",
          "Fe"
        ],
        "score": -11.7186328691267
      },
      {
        "glyphs": [
          "[",
          "Al"
        ],
        "score": -11.723880266204118
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.724096547204049
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -11.739262931072053
      },
      {
        "glyphs": [
          "[",
          "Ti"
        ],
        "score": -11.750628198675765
      },
      {
        "glyphs": [
          "C",
          "O",
          "N",
          "=",
          "C"
        ],
        "score": -11.75891128903891
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "s"
        ],
        "score": -11.76349220948281
      },
      {
        "glyphs": [
          "n",
          "n",
          "s",
          "c"
        ],
        "score": -11.769390149585343
      },
      {
        "glyphs": [
          "[",
          "Ti",
          "+"
        ],
        "score": -11.77347133423375
      },
      {
        "glyphs": [
          "[",
          "se"
        ],
        "score": -11.803953132900356
      },
      {
        "glyphs": [
          "[",
          "Zn"
        ],
        "score": -11.852597969991251
      },
      {
        "glyphs": [
          "[",
          "Rb"
        ],
        "score": -11.86361479273675
      },
      {
        "glyphs": [
          "=",
          "N",
          "N",
          "=",
          "C"
        ],
        "score": -11.87993657736606
      },
      {
        "glyphs": [
          "[",
          "Zr"
        ],
        "score": -11.900527411667863
      },
      {
        "glyphs": [
          "[",
          "Co"
        ],
        "score": -11.925641452511218
      },
      {
        "glyphs": [
          "[",
          "Cl",
          "+"
        ],
        "score": -11.942807623765018
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -11.943354200202487
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -11.947269094029599
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -11.956722064215509
      },
      {
        "glyphs": [
          "[",
          "Pd"
        ],
        "score": -11.988083787184475
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.026235102668572
      },
      {
        "glyphs": [
          "[",
          "Cu"
        ],
        "score": -12.02817026951185
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.028210881710592
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "C",
          "C"
        ],
        "score": -12.049468753827616
      },
      {
        "glyphs": [
          "N",
          "=",
          "C",
          "=",
          "S"
        ],
        "score": -12.055217949467432
      },
      {
        "glyphs": [
          "H",
          "4",
          "+"
        ],
        "score": -12.059929104152596
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "=",
          "C"
        ],
        "score": -12.059992820339122
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.074592194033066
      },
      {
        "glyphs": [
          "[",
          "Ni"
        ],
        "score": -12.074663701811641
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.106240782540286
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O"
        ],
        "score": -12.116685370866515
      },
      {
        "glyphs": [
          "[",
          "As"
        ],
        "score": -12.117152677056563
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "#"
        ],
        "score": -12.122494271817132
      },
      {
        "glyphs": [
          "[",
          "Pd",
          "+"
        ],
        "score": -12.12635508699219
      },
      {
        "glyphs": [
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#"
        ],
        "score": -12.126484070653326
      },
      {
        "glyphs": [
          "[",
          "Ir",
          "+"
        ],
        "score": -12.144578648890892
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.158166075128696
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.168737418982783
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "C",
          "S"
        ],
        "score": -12.183759830108606
      },
      {
        "glyphs": [
          "[",
          "P",
          "@@"
        ],
        "score": -12.190322488829953
      },
      {
        "glyphs": [
          "s",
          "n",
          "n",
          "c"
        ],
        "score": -12.194197001535455
      },
      {
        "glyphs": [
          "n",
          "c",
          "o",
          "n"
        ],
        "score": -12.201641668924191
      },
      {
        "glyphs": [
          "S",
          "C",
          "C",
          "C",
          "S"
        ],
        "score": -12.204627378278339
      },
      {
        "glyphs": [
          "[",
          "P",
          "@"
        ],
        "score": -12.212334298239856
      },
      {
        "glyphs": [
          "[",
          "U"
        ],
        "score": -12.235861037148062
      },
      {
        "glyphs": [
          "[",
          "Ag"
        ],
        "score": -12.254895323363026
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.270148526143991
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.277020645240247
      },
      {
        "glyphs": [
          "c",
          "s",
          "n",
          "n"
        ],
        "score": -12.303201465247898
      },
      {
        "glyphs": [
          "[",
          "Ni",
          "+"
        ],
        "score": -12.310224000493255
      },
      {
        "glyphs": [
          "=",
          "N",
          "C",
          "C",
          "S"
        ],
        "score": -12.316205037321584
      },
      {
        "glyphs": [
          "N",
          "#",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.3326064789313
      },
      {
        "glyphs": [
          "[",
          "P",
          "-"
        ],
        "score": -12.337447427846305
      },
      {
        "glyphs": [
          "[",
          "Ru"
        ],
        "score": -12.354314492742265
      },
      {
        "glyphs": [
          "[",
          "Ru",
          "+"
        ],
        "score": -12.367701484731466
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "O",
          "C",
          "C"
        ],
        "score": -12.373244973431685
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.40396870917816
      },
      {
        "glyphs": [
          "n",
          "n",
          "c",
          "o"
        ],
        "score": -12.411389023858154
      },
      {
        "glyphs": [
          "[",
          "Cr"
        ],
        "score": -12.415347880287852
      },
      {
        "glyphs": [
          "C",
          "C",
          "S",
          "S"
        ],
        "score": -12.41675191333484
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.419631018451996
      },
      {
        "glyphs": [
          "[",
          "Al",
          "+"
        ],
        "score": -12.426740725283885
      },
      {
        "glyphs": [
          "[",
          "Mo"
        ],
        "score": -12.437075551323444
      },
      {
        "glyphs": [
          "[",
          "Mn"
        ],
        "score": -12.44554825807583
      },
      {
        "glyphs": [
          "C",
          "=",
          "C",
          "N",
          "=",
          "C"
        ],
        "score": -12.454356916582956
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "N",
          "S"
        ],
        "score": -12.456078885851543
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.479866177078177
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.479932531491007
      },
      {
        "glyphs": [
          "S",
          "O",
          "O",
          "O"
        ],
        "score": -12.515752058957714
      },
      {
        "glyphs": [
          "[",
          "Co",
          "+"
        ],
        "score": -12.519030463249411
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.538187623971925
      },
      {
        "glyphs": [
          "[",
          "I",
          "+"
        ],
        "score": -12.551440282613521
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.579838625979457
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.58344340425523
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O"
        ],
        "score": -12.60522269334719
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "#",
          "C"
        ],
        "score": -12.607744493383079
      },
      {
        "glyphs": [
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C",
          "#",
          "C",
          "C"
        ],
        "score": -12.630420842768942
      },
      {
        "glyphs": [
          "[",
          "Te"
        ],
        "score": -12.66419795596016
      },
      {
        "glyphs": [
          "[",
          "Sb"
        ],
        "score": -12.67635893775645
      },
      {
        "glyphs": [
          "[",
          "1",
          "3",
          "C",
          "H",
          "2"
        ],
        "score": -12.68375338587214
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N"
        ],
        "score": -12.68461232101837
      },
      {
        "glyphs": [
          "[",
          "Al",
          "H",
          "3"
        ],
        "score": -12.699764608025205
      },
      {
        "glyphs": [
          "[",
          "Cs"
        ],
        "score": -12.70196845454168
      },
      {
        "glyphs": [
          "n",
          "c",
          "n",
          "s"
        ],
        "score": -12.72085079024852
      },
      {
        "glyphs": [
          "N",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "N"
        ],
        "score": -12.742523398876362
      },
      {
        "glyphs": [
          "C",
          "O",
          "C",
          "C",
          "S"
        ],
        "score": -12.748155043256633
      },
      {
        "glyphs": [
          "[",
          "1",
          "8",
          "F"
        ],
        "score": -12.757907626320478
      },
      {
        "glyphs": [
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.769699795154834
      },
      {
        "glyphs": [
          "=",
          "N",
          "P"
        ],
        "score": -12.773407529253884
      },
      {
        "glyphs": [
          "[",
          "Au",
          "+"
        ],
        "score": -12.774828235916376
      },
      {
        "glyphs": [
          "[",
          "Ba",
          "+"
        ],
        "score": -12.774899192297953
      },
      {
        "glyphs": [
          "[",
          "Pb"
        ],
        "score": -12.789672174296738
      },
      {
        "glyphs": [
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S",
          "=",
          "S"
        ],
        "score": -12.801632002577316
      },
      {
        "glyphs": [
          "O",
          "C",
          "C",
          "C",
          "C",
          "C",
          "C",
          "O",
          "C"
        ],
        "score": -12.805158073355063
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "O",
          "C",
          "C",
          "N",
          "C"
        ],
        "score": -12.812673974801553
      },
      {
        "glyphs": [
          "C",
          "C",
          "O",
