{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 514,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 515,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 516,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 517,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 518,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 519,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Replace",
        "pattern": {
          "String": "++"
        },
        "content": "+2"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "--"
        },
        "content": "-2"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "\\.|%\\d{2}|[\\(\\)]|[/\\\\]|\\[.*?]|\\d"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "unk_token": "[UNK]",
    "tokenize": {
      "outer": "Br?|Cl?|F|I|N|O|P|S|b|c|n|o|p|s|\\*|[\\.\\-=\\#\\$:/\\\\]|\\d|%|\\(|\\)|\\[.*?]",
      "inner": "(\\d+)?(A[c|g|l|m|r|s|t|u]|B[a|e|h|i|k|r]?|C[a|d|e|f|l|m|n|o|r|s|u]?|D[b|s|y]|E[r|s|u]|F[e|l|m|r]?|G[a|d|e]|H[e|f|g|o|s]?|I[n|r]?|Kr?|L[a|i|r|u|v]|M[c|d|g|n|o|t]|N[a|b|d|e|h|i|o|p]?|O[g|s]?|P[a|b|d|m|o|r|t|u]?|R[a|b|e|f|g|h|n|u]|S[b|c|e|g|i|m|n|r]?|T[a|b|c|e|h|i|l|m|s]|U|V|W|Xe|Yb?|Z[n|r]|as|b|c|n|o|p|se?|\\*)(?:(@(?:@|AL|OH|SP|T[B|H])?)(\\d{1,2})?)?(?:(H)(\\d)?)?(?:([+-]{1,2})(\\d{0,2}))?(?:(:)(\\d+))?"
    },
    "vocab": {
      "#": 1,
      "$": 2,
      "%": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "=": 22,
      "@": 23,
      "@@": 24,
      "@AL": 25,
      "@OH": 26,
      "@SP": 27,
      "@TB": 28,
      "@TH": 29,
      "Ac": 30,
      "Ag": 31,
      "Al": 32,
      "Am": 33,
      "Ar": 34,
      "As": 35,
      "At": 36,
      "Au": 37,
      "B": 38,
      "Ba": 39,
      "Be": 40,
      "Bh": 41,
      "Bi": 42,
      "Bk": 43,
      "Br": 44,
      "C": 45,
      "Ca": 46,
      "Cd": 47,
      "Ce": 48,
      "Cf": 49,
      "Cl": 50,
      "Cm": 51,
      "Cn": 52,
      "Co": 53,
      "Cr": 54,
      "Cs": 55,
      "Cu": 56,
      "Db": 57,
      "Ds": 58,
      "Dy": 59,
      "Er": 60,
      "Es": 61,
      "Eu": 62,
      "F": 63,
      "Fe": 64,
      "Fl": 65,
      "Fm": 66,
      "Fr": 67,
      "Ga": 68,
      "Gd": 69,
      "Ge": 70,
      "H": 71,
      "He": 72,
      "Hf": 73,
      "Hg": 74,
      "Ho": 75,
      "Hs": 76,
      "I": 77,
      "In": 78,
      "Ir": 79,
      "K": 80,
      "Kr": 81,
      "La": 82,
      "Li": 83,
      "Lr": 84,
      "Lu": 85,
      "Lv": 86,
      "Mc": 87,
      "Md": 88,
      "Mg": 89,
      "Mn": 90,
      "Mo": 91,
      "Mt": 92,
      "N": 93,
      "Na": 94,
      "Nb": 95,
      "Nd": 96,
      "Ne": 97,
      "Nh": 98,
      "Ni": 99,
      "No": 100,
      "Np": 101,
      "O": 102,
      "Og": 103,
      "Os": 104,
      "P": 105,
      "Pa": 106,
      "Pb": 107,
      "Pd": 108,
      "Pm": 109,
      "Po": 110,
      "Pr": 111,
      "Pt": 112,
      "Pu": 113,
      "Ra": 114,
      "Rb": 115,
      "Re": 116,
      "Rf": 117,
      "Rg": 118,
      "Rh": 119,
      "Rn": 120,
      "Ru": 121,
      "S": 122,
      "Sb": 123,
      "Sc": 124,
      "Se": 125,
      "Sg": 126,
      "Si": 127,
      "Sm": 128,
      "Sn": 129,
      "Sr": 130,
      "Ta": 131,
      "Tb": 132,
      "Tc": 133,
      "Te": 134,
      "Th": 135,
      "Ti": 136,
      "Tl": 137,
      "Tm": 138,
      "Ts": 139,
      "U": 140,
      "V": 141,
      "W": 142,
      "Xe": 143,
      "Y": 144,
      "Yb": 145,
      "Zn": 146,
      "Zr": 147,
      "[": 148,
      "[UNK]": 0,
      "\\": 149,
      "]": 150,
      "as": 151,
      "b": 152,
      "c": 153,
      "n": 154,
      "o": 155,
      "p": 156,
      "s": 157,
      "se": 158
    },
    "merges": [
      [
        153,
        153
      ],
      [
        45,
        45
      ],
      [
        22,
        102
      ],
      [
        159,
        153
      ],
      [
        159,
        162
      ],
      [
        160,
        160
      ],
      [
        102,
        45
      ],
      [
        93,
        45
      ],
      [
        22,
        45
      ],
      [
        154,
        153
      ],
      [
        160,
        45
      ],
      [
        8,
        153
      ],
      [
        45,
        153
      ],
      [
        45,
        23
      ],
      [
        45,
        24
      ],
      [
        172,
        71
      ],
      [
        173,
        71
      ],
      [
        159,
        159
      ],
      [
        45,
        102
      ],
      [
        45,
        93
      ],
      [
        160,
        93
      ],
      [
        93,
        153
      ],
      [
        45,
        167
      ],
      [
        102,
        160
      ],
      [
        177,
        153
      ],
      [
        102,
        167
      ],
      [
        154,
        71
      ],
      [
        102,
        153
      ],
      [
        164,
        164
      ],
      [
        153,
        154
      ],
      [
        45,
        165
      ],
      [
        160,
        153
      ],
      [
        164,
        45
      ],
      [
        102,
        8
      ],
      [
        93,
        7
      ],
      [
        154,
        159
      ],
      [
        45,
        1
      ],
      [
        157,
        153
      ],
      [
        22,
        160
      ],
      [
        45,
        166
      ],
      [
        93,
        160
      ],
      [
        154,
        154
      ],
      [
        169,
        93
      ],
      [
        153,
        168
      ],
      [
        155,
        153
      ],
      [
        160,
        165
      ],
      [
        166,
        153
      ],
      [
        45,
        122
      ],
      [
        22,
        93
      ],
      [
        195,
        93
      ],
      [
        13,
        71
      ],
      [
        165,
        153
      ],
      [
        160,
        182
      ],
      [
        22,
        122
      ],
      [
        160,
        166
      ],
      [
        45,
        154
      ],
      [
        8,
        154
      ],
      [
        154,
        168
      ],
      [
        45,
        197
      ],
      [
        93,
        167
      ],
      [
        160,
        102
      ],
      [
        160,
        186
      ],
      [
        162,
        168
      ],
      [
        159,
        168
      ],
      [
        122,
        45
      ],
      [
        164,
        160
      ],
      [
        159,
        154
      ],
      [
        93,
        122
      ],
      [
        176,
        154
      ],
      [
        122,
        153
      ],
      [
        45,
        22
      ],
      [
        169,
        153
      ],
      [
        188,
        154
      ],
      [
        169,
        166
      ],
      [
        93,
        1
      ],
      [
        162,
        157
      ],
      [
        168,
        168
      ],
      [
        206,
        153
      ],
      [
        187,
        187
      ],
      [
        169,
        102
      ],
      [
        178,
        153
      ],
      [
        164,
        93
      ],
      [
        179,
        160
      ],
      [
        159,
        194
      ],
      [
        160,
        154
      ],
      [
        160,
        122
      ],
      [
        153,
        196
      ],
      [
        102,
        22
      ],
      [
        22,
        166
      ],
      [
        162,
        155
      ],
      [
        154,
        162
      ],
      [
        182,
        182
      ],
      [
        45,
        161
      ],
      [
        153,
        157
      ],
      [
        164,
        169
      ],
      [
        45,
        71
      ],
      [
        93,
        169
      ],
      [
        154,
        155
      ],
      [
        153,
        8
      ],
      [
        154,
        203
      ],
      [
        168,
        154
      ],
      [
        182,
        102
      ],
      [
        93,
        190
      ],
      [
        154,
        7
      ],
      [
        160,
        1
      ],
      [
        177,
        160
      ],
      [
        188,
        159
      ],
      [
        3,
        12
      ],
      [
        154,
        176
      ],
      [
        45,
        207
      ],
      [
        233,
        171
      ],
      [
        93,
        71
      ],
      [
        122,
        160
      ],
      [
        178,
        167
      ],
      [
        165,
        102
      ],
      [
        22,
        180
      ],
      [
        177,
        105
      ],
      [
        102,
        169
      ],
      [
        102,
        212
      ],
      [
        160,
        167
      ],
      [
        93,
        93
      ],
      [
        159,
        196
      ],
      [
        181,
        153
      ],
      [
        45,
        8
      ],
      [
        178,
        160
      ],
      [
        22,
        169
      ],
      [
        93,
        179
      ],
      [
        167,
        153
      ],
      [
        162,
        154
      ],
      [
        102,
        179
      ],
      [
        102,
        105
      ],
      [
        45,
        50
      ],
      [
        169,
        186
      ],
      [
        102,
        164
      ],
      [
        195,
        171
      ],
      [
        246,
        153
      ],
      [
        179,
        153
      ],
      [
        206,
        45
      ],
      [
        63,
        153
      ],
      [
        270,
        7
      ],
      [
        94,
        7
      ],
      [
        93,
        8
      ],
      [
        7,
        13
      ],
      [
        187,
        45
      ],
      [
        189,
        153
      ],
      [
        93,
        166
      ],
      [
        187,
        164
      ],
      [
        198,
        153
      ],
      [
        194,
        154
      ],
      [
        22,
        199
      ],
      [
        122,
        171
      ],
      [
        164,
        102
      ],
      [
        177,
        179
      ],
      [
        169,
        154
      ],
      [
        93,
        164
      ],
      [
        157,
        162
      ],
      [
        22,
        205
      ],
      [
        169,
        165
      ],
      [
        71,
        8
      ],
      [
        102,
        122
      ],
      [
        155,
        154
      ],
      [
        187,
        160
      ],
      [
        71,
        71
      ],
      [
        50,
        153
      ],
      [
        93,
        22
      ],
      [
        254,
        13
      ],
      [
        263,
        263
      ],
      [
        169,
        122
      ],
      [
        266,
        11
      ],
      [
        63,
        45
      ],
      [
        164,
        153
      ],
      [
        1,
        93
      ],
      [
        93,
        274
      ],
      [
        50,
        8
      ],
      [
        164,
        166
      ],
      [
        45,
        44
      ],
      [
        188,
        162
      ],
      [
        194,
        157
      ],
      [
        254,
        14
      ],
      [
        187,
        169
      ],
      [
        178,
        122
      ],
      [
        160,
        223
      ],
      [
        229,
        179
      ],
      [
        218,
        153
      ],
      [
        195,
        160
      ],
      [
        202,
        154
      ],
      [
        229,
        169
      ],
      [
        153,
        203
      ],
      [
        159,
        203
      ],
      [
        249,
        154
      ],
      [
        200,
        154
      ],
      [
        93,
        201
      ],
      [
        207,
        93
      ],
      [
        182,
        165
      ],
      [
        197,
        167
      ],
      [
        250,
        250
      ],
      [
        263,
        93
      ],
      [
        93,
        102
      ],
      [
        159,
        200
      ],
      [
        127,
        71
      ],
      [
        201,
        167
      ],
      [
        102,
        102
      ],
      [
        206,
        160
      ],
      [
        169,
        180
      ],
      [
        102,
        93
      ],
      [
        233,
        160
      ],
      [
        207,
        102
      ],
      [
        200,
        200
      ],
      [
        164,
        186
      ],
      [
        187,
        191
      ],
      [
        45,
        63
      ],
      [
        102,
        38
      ],
      [
        164,
        178
      ],
      [
        188,
        225
      ],
      [
        194,
        168
      ],
      [
        199,
        166
      ],
      [
        195,
        45
      ],
      [
        22,
        164
      ],
      [
        177,
        169
      ],
      [
        160,
        228
      ],
      [
        167,
        93
      ],
      [
        266,
        12
      ],
      [
        164,
        165
      ],
      [
        188,
        168
      ],
      [
        44,
        153
      ],
      [
        187,
        224
      ],
      [
        105,
        7
      ],
      [
        13,
        7
      ],
      [
        182,
        153
      ],
      [
        184,
        153
      ],
      [
        244,
        160
      ],
      [
        160,
        197
      ],
      [
        160,
        205
      ],
      [
        182,
        166
      ],
      [
        80,
        7
      ],
      [
        187,
        253
      ],
      [
        323,
        153
      ],
      [
        22,
        153
      ],
      [
        169,
        167
      ],
      [
        165,
        165
      ],
      [
        102,
        238
      ],
      [
        270,
        386
      ],
      [
        168,
        200
      ],
      [
        7,
        14
      ],
      [
        337,
        8
      ],
      [
        182,
        186
      ],
      [
        160,
        50
      ],
      [
        254,
        8
      ],
      [
        246,
        105
      ],
      [
        197,
        197
      ],
      [
        324,
        8
      ],
      [
        325,
        325
      ],
      [
        237,
        160
      ],
      [
        45,
        105
      ],
      [
        102,
        201
      ],
      [
        217,
        197
      ],
      [
        181,
        93
      ],
      [
        155,
        162
      ],
      [
        177,
        211
      ],
      [
        199,
        102
      ],
      [
        237,
        45
      ],
      [
        178,
        179
      ],
      [
        202,
        168
      ],
      [
        229,
        180
      ],
      [
        200,
        168
      ],
      [
        154,
        157
      ],
      [
        179,
        122
      ],
      [
        93,
        230
      ],
      [
        219,
        105
      ],
      [
        178,
        169
      ],
      [
        157,
        159
      ],
      [
        212,
        212
      ],
      [
        153,
        155
      ],
      [
        122,
        7
      ],
      [
        199,
        186
      ],
      [
        188,
        200
      ],
      [
        217,
        167
      ],
      [
        217,
        154
      ],
      [
        168,
        196
      ],
      [
        169,
        199
      ],
      [
        169,
        330
      ],
      [
        206,
        171
      ],
      [
        164,
        154
      ],
      [
        229,
        164
      ],
      [
        229,
        153
      ],
      [
        217,
        165
      ],
      [
        216,
        154
      ],
      [
        22,
        191
      ],
      [
        1,
        171
      ],
      [
        233,
        45
      ],
      [
        195,
        179
      ],
      [
        229,
        166
      ],
      [
        153,
        317
      ],
      [
        154,
        8
      ],
      [
        44,
        8
      ],
      [
        177,
        213
      ],
      [
        154,
        196
      ],
      [
        71,
        7
      ],
      [
        83,
        7
      ],
      [
        164,
        122
      ],
      [
        266,
        13
      ],
      [
        217,
        186
      ],
      [
        164,
        171
      ],
      [
        155,
        168
      ],
      [
        93,
        342
      ],
      [
        166,
        161
      ],
      [
        177,
        219
      ],
      [
        179,
        167
      ],
      [
        191,
        166
      ],
      [
        167,
        167
      ],
      [
        93,
        180
      ],
      [
        177,
        122
      ],
      [
        199,
        154
      ],
      [
        77,
        8
      ],
      [
        38,
        8
      ],
      [
        252,
        188
      ],
      [
        217,
        166
      ],
      [
        93,
        207
      ],
      [
        14,
        7
      ],
      [
        199,
        122
      ],
      [
        22,
        179
      ],
      [
        160,
        161
      ],
      [
        169,
        205
      ],
      [
        237,
        169
      ],
      [
        256,
        168
      ],
      [
        177,
        243
      ],
      [
        206,
        169
      ],
      [
        160,
        284
      ],
      [
        229,
        190
      ],
      [
        196,
        168
      ],
      [
        14,
        71
      ],
      [
        207,
        165
      ],
      [
        177,
        220
      ],
      [
        93,
        191
      ],
      [
        93,
        161
      ],
      [
        122,
        8
      ],
      [
        169,
        182
      ],
      [
        270,
        477
      ],
      [
        184,
        102
      ],
      [
        122,
        169
      ],
      [
        199,
        165
      ],
      [
        177,
        204
      ],
      [
        178,
        219
      ],
      [
        177,
        93
      ],
      [
        112,
        301
      ],
      [
        222,
        154
      ],
      [
        207,
        166
      ],
      [
        102,
        197
      ],
      [
        358,
        13
      ],
      [
        207,
        179
      ],
      [
        102,
        187
      ],
      [
        255,
        154
      ],
      [
        424,
        168
      ],
      [
        268,
        166
      ],
      [
        164,
        179
      ]
    ]
  }
}